#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: f8d551ea653d7ebdc1de0698de466357.pdb
; shader hash: f8d551ea653d7ebdc1de0698de466357
;
; Buffer Definitions:
;
; cbuffer g_sceneCB
; {
;
;   struct g_sceneCB
;   {
;
;       struct struct.VolumeRaytracer::VSceneConstantBuffer
;       {
;
;           column_major float4x4 viewMatrixInverted; ; Offset:    0
;           column_major float4x4 projectionMatrixInverted;; Offset:   64
;           float4 cameraPosition;                    ; Offset:  128
;           uint voxelAxisCount;                      ; Offset:  144
;           float volumeExtend;                       ; Offset:  148
;           float distanceBtwVoxels;                  ; Offset:  152
;       
;       } g_sceneCB;                                  ; Offset:    0
;
;   
;   } g_sceneCB;                                      ; Offset:    0 Size:   156
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; g_sceneCB                         cbuffer      NA          NA     CB0            cb0     1
; g_envMapSampler                   sampler      NA          NA      S0             s0     1
; g_scene                           texture     i32         ras      T0             t0     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !32, globals: !139)
!1 = !DIFile(filename: "./DX/Resources/Shaders/Raytracing.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16, !25}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 80, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 80, size: 96, align: 32, elements: !18, templateParams: !22)
!18 = !{!19, !20, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 80, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 80, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, line: 80, baseType: !15, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!23, !24}
!23 = !DITemplateTypeParameter(name: "element", type: !15)
!24 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !27, templateParams: !31)
!27 = !{!28, !29, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !26, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!13, !24}
!32 = !{!33, !42, !51, !54, !57, !70, !73, !76, !77, !80, !96, !97, !100, !107}
!33 = !DISubprogram(name: "TraceRadianceRay", linkageName: "\01?TraceRadianceRay@@YA?AV?$vector@M$03@@URay@@I@Z", scope: !1, file: !1, line: 56, type: !34, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false)
!34 = !DISubroutineType(types: !35)
!35 = !{!4, !36, !40}
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray", file: !1, line: 28, size: 192, align: 32, elements: !37)
!37 = !{!38, !39}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !36, file: !1, line: 30, baseType: !25, size: 96, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !36, file: !1, line: 31, baseType: !25, size: 96, align: 32, offset: 96)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !41)
!41 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!42 = !DISubprogram(name: "DetermineRayAABBIntersection", linkageName: "\01?DetermineRayAABBIntersection@@YA_NURay@@Y01V?$vector@M$02@@AIAM2@Z", scope: !1, file: !1, line: 77, type: !43, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: false)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !36, !46, !49, !49}
!45 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 192, align: 32, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 2)
!49 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !8)
!51 = !DISubprogram(name: "WorldSpaceToVoxelSpace", linkageName: "\01?WorldSpaceToVoxelSpace@@YA?AV?$vector@H$02@@V?$vector@M$02@@@Z", scope: !1, file: !1, line: 102, type: !52, isLocal: false, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: false)
!52 = !DISubroutineType(types: !53)
!53 = !{!16, !25}
!54 = !DISubprogram(name: "VoxelIndexToWorldSpace", linkageName: "\01?VoxelIndexToWorldSpace@@YA?AV?$vector@M$02@@V?$vector@H$02@@@Z", scope: !1, file: !1, line: 111, type: !55, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: false)
!55 = !DISubroutineType(types: !56)
!56 = !{!25, !16}
!57 = !DISubprogram(name: "GoToNextVoxel", linkageName: "\01?GoToNextVoxel@@YA?AV?$vector@H$02@@URay@@V?$vector@I$02@@V1@AIAMAIAV?$vector@M$02@@@Z", scope: !1, file: !1, line: 120, type: !58, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!58 = !DISubroutineType(types: !59)
!59 = !{!16, !36, !60, !16, !49, !68}
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 118, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 118, size: 96, align: 32, elements: !62, templateParams: !66)
!62 = !{!63, !64, !65}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !61, file: !1, line: 118, baseType: !41, size: 32, align: 32, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !61, file: !1, line: 118, baseType: !41, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !61, file: !1, line: 118, baseType: !41, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!66 = !{!67, !24}
!67 = !DITemplateTypeParameter(name: "element", type: !41)
!68 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !25)
!70 = !DISubprogram(name: "GetPositionAlongRay", linkageName: "\01?GetPositionAlongRay@@YA?AV?$vector@M$02@@URay@@M@Z", scope: !1, file: !1, line: 178, type: !71, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: false)
!71 = !DISubroutineType(types: !72)
!72 = !{!25, !36, !8}
!73 = !DISubprogram(name: "IsValidVoxelIndex", linkageName: "\01?IsValidVoxelIndex@@YA_NV?$vector@H$02@@@Z", scope: !1, file: !1, line: 183, type: !74, isLocal: false, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: false)
!74 = !DISubroutineType(types: !75)
!75 = !{!45, !16}
!76 = !DISubprogram(name: "IsSolid", linkageName: "\01?IsSolid@@YA_NV?$vector@H$02@@@Z", scope: !1, file: !1, line: 188, type: !74, isLocal: false, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: false)
!77 = !DISubprogram(name: "VRRaygen", linkageName: "\01?VRRaygen@@YAXXZ", scope: !1, file: !1, line: 194, type: !78, isLocal: false, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?VRRaygen@@YAXXZ")
!78 = !DISubroutineType(types: !79)
!79 = !{null}
!80 = !DISubprogram(name: "VRClosestHit", linkageName: "\01?VRClosestHit@@YAXUVRayPayload@VolumeRaytracer@@UVPrimitiveAttributes@2@@Z", scope: !1, file: !1, line: 205, type: !81, isLocal: false, isDefinition: true, scopeLine: 206, flags: DIFlagPrototyped, isOptimized: false, function: void (%"struct.VolumeRaytracer::VRayPayload"*, %"struct.VolumeRaytracer::VPrimitiveAttributes"*)* @"\01?VRClosestHit@@YAXUVRayPayload@VolumeRaytracer@@UVPrimitiveAttributes@2@@Z")
!81 = !DISubroutineType(types: !82)
!82 = !{null, !83, !92}
!83 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !84)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "VRayPayload", scope: !86, file: !85, line: 38, size: 160, align: 32, elements: !87)
!85 = !DIFile(filename: "./DX/Resources/Shaders/RaytracingHlsl.h", directory: "")
!86 = !DINamespace(name: "VolumeRaytracer", scope: null, file: !85, line: 31)
!87 = !{!88, !90}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !84, file: !85, line: 40, baseType: !89, size: 128, align: 32)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !85, line: 20, baseType: !4)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !84, file: !85, line: 41, baseType: !91, size: 32, align: 32, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !85, line: 23, baseType: !40)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "VPrimitiveAttributes", scope: !86, file: !85, line: 33, size: 96, align: 32, elements: !93)
!93 = !{!94}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !92, file: !85, line: 35, baseType: !95, size: 96, align: 32)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !85, line: 19, baseType: !25)
!96 = !DISubprogram(name: "VRIntersection", linkageName: "\01?VRIntersection@@YAXXZ", scope: !1, file: !1, line: 212, type: !78, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?VRIntersection@@YAXXZ")
!97 = !DISubprogram(name: "VRMiss", linkageName: "\01?VRMiss@@YAXUVRayPayload@VolumeRaytracer@@@Z", scope: !1, file: !1, line: 283, type: !98, isLocal: false, isDefinition: true, scopeLine: 284, flags: DIFlagPrototyped, isOptimized: false, function: void (%"struct.VolumeRaytracer::VRayPayload"*)* @"\01?VRMiss@@YAXUVRayPayload@VolumeRaytracer@@@Z")
!98 = !DISubroutineType(types: !99)
!99 = !{null, !83}
!100 = !DISubprogram(name: "VRMissShadowRay", linkageName: "\01?VRMissShadowRay@@YAXUVShadowRayPayload@VolumeRaytracer@@@Z", scope: !1, file: !1, line: 290, type: !101, isLocal: false, isDefinition: true, scopeLine: 291, flags: DIFlagPrototyped, isOptimized: false, function: void (%"struct.VolumeRaytracer::VShadowRayPayload"*)* @"\01?VRMissShadowRay@@YAXUVShadowRayPayload@VolumeRaytracer@@@Z")
!101 = !DISubroutineType(types: !102)
!102 = !{null, !103}
!103 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !104)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "VShadowRayPayload", scope: !86, file: !85, line: 44, size: 32, align: 32, elements: !105)
!105 = !{!106}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !104, file: !85, line: 46, baseType: !45, size: 32, align: 32)
!107 = !DISubprogram(name: "GenerateCameraRay", linkageName: "\01?GenerateCameraRay@@YA?AURay@@V?$vector@I$01@@V?$vector@M$02@@V?$matrix@M$03$03@@2@Z", scope: !1, file: !1, line: 34, type: !108, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!108 = !DISubroutineType(types: !109)
!109 = !{!36, !110, !25, !117, !117}
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 26, baseType: !111)
!111 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 26, size: 64, align: 32, elements: !112, templateParams: !115)
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !111, file: !1, line: 26, baseType: !41, size: 32, align: 32, flags: DIFlagPublic)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !111, file: !1, line: 26, baseType: !41, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!115 = !{!67, !116}
!116 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 26, baseType: !118)
!118 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 26, size: 512, align: 32, elements: !119, templateParams: !136)
!119 = !{!120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!136 = !{!13, !137, !138}
!137 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!138 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!139 = !{!140, !142, !144, !145, !147, !152, !154, !158, !160, !162, !164, !178, !180, !182, !184}
!140 = !DIGlobalVariable(name: "RAY_FLAG_CULL_BACK_FACING_TRIANGLES", scope: !0, file: !1, line: 72, type: !141, isLocal: true, isDefinition: true, variable: i32 16)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!142 = !DIGlobalVariable(name: "FLT_INFINITY", scope: !42, file: !1, line: 82, type: !143, isLocal: true, isDefinition: true)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!144 = !DIGlobalVariable(name: "FLT_INFINITY", scope: !57, file: !1, line: 124, type: !143, isLocal: true, isDefinition: true)
!145 = !DIGlobalVariable(name: "BackgroundColor", linkageName: "\01?BackgroundColor@VolumeRaytracer@@3V?$vector@M$03@@B", scope: !86, file: !85, line: 59, type: !146, isLocal: true, isDefinition: true)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!147 = !DIGlobalVariable(name: "CubeNormals", linkageName: "\01?CubeNormals@VolumeRaytracer@@3QBV?$vector@M$02@@B", scope: !86, file: !85, line: 60, type: !148, isLocal: true, isDefinition: true)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 576, align: 32, elements: !150)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!150 = !{!151}
!151 = !DISubrange(count: 6)
!152 = !DIGlobalVariable(name: "g_scene", linkageName: "\01?g_scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 19, type: !153, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?g_scene@@3URaytracingAccelerationStructure@@A")
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 19, size: 32, align: 32, elements: !2)
!154 = !DIGlobalVariable(name: "g_voxelVolume", linkageName: "\01?g_voxelVolume@@3V?$Texture3D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 20, type: !155, isLocal: false, isDefinition: true, variable: %"class.Texture3D<vector<float, 4> >"* @"\01?g_voxelVolume@@3V?$Texture3D@V?$vector@M$03@@@@A")
!155 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture3D<vector<float, 4> >", file: !1, line: 20, size: 160, align: 32, elements: !2, templateParams: !156)
!156 = !{!157}
!157 = !DITemplateTypeParameter(name: "element", type: !5)
!158 = !DIGlobalVariable(name: "g_envMap", linkageName: "\01?g_envMap@@3V?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 22, type: !159, isLocal: false, isDefinition: true, variable: %"class.TextureCube<vector<float, 4> >"* @"\01?g_envMap@@3V?$TextureCube@V?$vector@M$03@@@@A")
!159 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 22, size: 128, align: 32, elements: !2, templateParams: !156)
!160 = !DIGlobalVariable(name: "g_envMapSampler", linkageName: "\01?g_envMapSampler@@3USamplerState@@A", scope: !0, file: !1, line: 23, type: !161, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?g_envMapSampler@@3USamplerState@@A")
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 23, size: 32, align: 32, elements: !2)
!162 = !DIGlobalVariable(name: "g_renderTarget", linkageName: "\01?g_renderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 25, type: !163, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?g_renderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!163 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 25, size: 128, align: 32, elements: !2, templateParams: !156)
!164 = !DIGlobalVariable(name: "g_sceneCB", linkageName: "\01?g_sceneCB@@3V?$ConstantBuffer@UVSceneConstantBuffer@VolumeRaytracer@@@@A", scope: !0, file: !1, line: 26, type: !165, isLocal: false, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_class_type, name: "ConstantBuffer<VolumeRaytracer::VSceneConstantBuffer>", file: !1, line: 26, size: 32, align: 32, elements: !2, templateParams: !166)
!166 = !{!167}
!167 = !DITemplateTypeParameter(name: "T", type: !168)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSceneConstantBuffer", scope: !86, file: !85, line: 49, size: 1248, align: 32, elements: !169)
!169 = !{!170, !172, !173, !175, !176, !177}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatrixInverted", scope: !168, file: !85, line: 51, baseType: !171, size: 512, align: 32)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMMATRIX", file: !85, line: 22, baseType: !117)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "projectionMatrixInverted", scope: !168, file: !85, line: 52, baseType: !171, size: 512, align: 32, offset: 512)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "cameraPosition", scope: !168, file: !85, line: 53, baseType: !174, size: 128, align: 32, offset: 1024)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMVECTOR", file: !85, line: 21, baseType: !4)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "voxelAxisCount", scope: !168, file: !85, line: 54, baseType: !91, size: 32, align: 32, offset: 1152)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "volumeExtend", scope: !168, file: !85, line: 55, baseType: !8, size: 32, align: 32, offset: 1184)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "distanceBtwVoxels", scope: !168, file: !85, line: 56, baseType: !8, size: 32, align: 32, offset: 1216)
!178 = !DIGlobalVariable(name: "BackgroundColor.1", linkageName: "\01?BackgroundColor@VolumeRaytracer@@3V?$vector@M$03@@B.1", scope: !86, file: !85, line: 59, type: !179, isLocal: false, isDefinition: true)
!179 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !146, size: 32, align: 4, offset: 32)
!180 = !DIGlobalVariable(name: "BackgroundColor.2", linkageName: "\01?BackgroundColor@VolumeRaytracer@@3V?$vector@M$03@@B.2", scope: !86, file: !85, line: 59, type: !181, isLocal: false, isDefinition: true)
!181 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !146, size: 32, align: 4, offset: 64)
!182 = !DIGlobalVariable(name: "BackgroundColor.3", linkageName: "\01?BackgroundColor@VolumeRaytracer@@3V?$vector@M$03@@B.3", scope: !86, file: !85, line: 59, type: !183, isLocal: false, isDefinition: true)
!183 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !146, size: 32, align: 4, offset: 96)
!184 = !DIGlobalVariable(name: "BackgroundColor.0", linkageName: "\01?BackgroundColor@VolumeRaytracer@@3V?$vector@M$03@@B.0", scope: !86, file: !85, line: 59, type: !185, isLocal: false, isDefinition: true)
!185 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !146, size: 32, align: 4)
!186 = !{i32 2, !"Dwarf Version", i32 4}
!187 = !{i32 2, !"Debug Info Version", i32 3}
!188 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!189 = !{!".\5CDX\5CResources\5CShaders\5CRaytracing.hlsl", !"/*\0D\0A\09Copyright (c) 2020 Thomas Sch\C3\B6ngrundner\0D\0A\0D\0A\09Permission is hereby granted, free of charge, to any person obtaining a copy\0D\0A\09of this software and associated documentation files (the \22Software\22), to deal\0D\0A\09in the Software without restriction, including without limitation the rights\0D\0A\09to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\0D\0A\09copies of the Software, and to permit persons to whom the Software is\0D\0A\09furnished to do so, subject to the following conditions:\0D\0A\0D\0A\09The above copyright notice and this permission notice shall be included in all\0D\0A\09copies or substantial portions of the Software.\0D\0A*/\0D\0A\0D\0A#define HLSL\0D\0A\0D\0A#include \22RaytracingHlsl.h\22\0D\0A\0D\0ARaytracingAccelerationStructure g_scene : register(t0, space0);\0D\0ATexture3D<float4> g_voxelVolume : register(t2, space0);\0D\0A\0D\0ATextureCube g_envMap : register(t1, space0);\0D\0ASamplerState g_envMapSampler : register(s0);\0D\0A\0D\0ARWTexture2D<float4> g_renderTarget : register(u0);\0D\0AConstantBuffer<VolumeRaytracer::VSceneConstantBuffer> g_sceneCB : register(b0);\0D\0A\0D\0Astruct Ray\0D\0A{\0D\0A\09float3 origin;\0D\0A\09float3 direction;\0D\0A};\0D\0A\0D\0Ainline Ray GenerateCameraRay(uint2 index, in float3 cameraPosition, in float4x4 viewInverted, in float4x4 projInverted)\0D\0A{\0D\0A\09float2 xy = index + 0.5f; // center in the middle of the pixel.\0D\0A\09float2 screenPos = xy / DispatchRaysDimensions().xy * 2.0 - 1.0;\0D\0A\0D\0A\09// Invert Y for DirectX-style coordinates.\0D\0A\09//screenPos.y = -screenPos.y;\0D\0A\0D\0A\09// Unproject the pixel coordinate into a world positon.\0D\0A\09//float4 world = mul(float4(screenPos, 0, 1), projectionToWorld);\0D\0A\09//world.xyz /= world.w;\0D\0A\0D\0A\09Ray ray;\0D\0A\09//ray.origin = cameraPosition;\0D\0A\09ray.origin = mul(viewInverted, float4(0,0,0,1)).xyz;\0D\0A\0D\0A\09float4 target = mul(projInverted, float4(screenPos.x, -screenPos.y, 1, 1));\0D\0A\09ray.direction = mul(viewInverted, float4(target.xyz, 0)).xyz;\0D\0A\0D\0A\09return ray;\0D\0A}\0D\0A\0D\0Afloat4 TraceRadianceRay(in Ray ray, in uint currentRayRecursionDepth)\0D\0A{\0D\0A\09if (currentRayRecursionDepth >= MAX_RAY_RECURSION_DEPTH)\0D\0A\09{\0D\0A\09\09return float4(0,0,0,0);\0D\0A\09}\0D\0A\0D\0A\09RayDesc rayDesc;\0D\0A\09rayDesc.Origin = ray.origin;\0D\0A\09rayDesc.Direction = ray.direction;\0D\0A\0D\0A\09rayDesc.TMin = 0;\0D\0A\09rayDesc.TMax = 10000;\0D\0A\0D\0A\09VolumeRaytracer::VRayPayload rayPayload = { float4(0,0,0,0), currentRayRecursionDepth + 1 };\0D\0A\0D\0A\09TraceRay(g_scene, RAY_FLAG_CULL_BACK_FACING_TRIANGLES, 0xff, 0, 2, 0, rayDesc, rayPayload);\0D\0A\0D\0A\09return rayPayload.color;\0D\0A}\0D\0A\0D\0Abool DetermineRayAABBIntersection(in Ray ray, in float3 aabb[2], out float tEnter, out float tExit)\0D\0A{\0D\0A\09float3 tmin3, tmax3;\0D\0A\09int3 sign3 = ray.direction > 0;\0D\0A\0D\0A\09const float FLT_INFINITY = 1.#INF;\0D\0A\09float3 invRayDirection = ray.direction != 0\0D\0A\09\09? 1 / ray.direction\0D\0A\09\09: (ray.direction > 0) ? FLT_INFINITY : -FLT_INFINITY;\0D\0A\0D\0A\09tmin3.x = (aabb[1 - sign3.x].x - ray.origin.x) * invRayDirection.x;\0D\0A\09tmax3.x = (aabb[sign3.x].x - ray.origin.x) * invRayDirection.x;\0D\0A\0D\0A\09tmin3.y = (aabb[1 - sign3.y].y - ray.origin.y) * invRayDirection.y;\0D\0A\09tmax3.y = (aabb[sign3.y].y - ray.origin.y) * invRayDirection.y;\0D\0A\0D\0A\09tmin3.z = (aabb[1 - sign3.z].z - ray.origin.z) * invRayDirection.z;\0D\0A\09tmax3.z = (aabb[sign3.z].z - ray.origin.z) * invRayDirection.z;\0D\0A\0D\0A\09tEnter = max(max(tmin3.x, tmin3.y), tmin3.z);\0D\0A\09tExit = min(min(tmax3.x, tmax3.y), tmax3.z);\0D\0A\0D\0A\09return tExit > tEnter && tExit >= RayTMin() && tEnter <= RayTCurrent();\0D\0A}\0D\0A\0D\0Aint3 WorldSpaceToVoxelSpace(in float3 worldLocation)\0D\0A{\0D\0A\09float3 volumeOrigin = -g_sceneCB.volumeExtend;\0D\0A\09float3 relativeVolumePos = worldLocation - volumeOrigin;\0D\0A\09float distanceBetweenVoxel = g_sceneCB.distanceBtwVoxels;\0D\0A\0D\0A\09return int3(floor(relativeVolumePos.x / distanceBetweenVoxel), floor(relativeVolumePos.y / distanceBetweenVoxel), floor(relativeVolumePos.z / distanceBetweenVoxel));\0D\0A}\0D\0A\0D\0Afloat3 VoxelIndexToWorldSpace(in int3 voxelIndex)\0D\0A{\0D\0A\09float distanceBetweenVoxel = g_sceneCB.distanceBtwVoxels;\0D\0A\09float3 voxelIndexF = voxelIndex;\0D\0A\09float3 volumeOrigin = -g_sceneCB.volumeExtend;\0D\0A\0D\0A\09return voxelIndexF * distanceBetweenVoxel + distanceBetweenVoxel * 0.5f + volumeOrigin;\0D\0A}\0D\0A\0D\0Aint3 GoToNextVoxel(in Ray ray, in uint3 voxelIndex, in int3 direction, out float newT, out float3 voxelFaceNormal)\0D\0A{\0D\0A\09float3 tMax = float3(100000, 100000, 100000);\0D\0A\09int3 res = voxelIndex;\0D\0A\09const float FLT_INFINITY = 1.#INF;\0D\0A\09float3 invRayDirection = ray.direction != 0 ? 1 / ray.direction : (ray.direction > 0) ? FLT_INFINITY : -FLT_INFINITY;\0D\0A\0D\0A\09int3 sign = ray.direction > 0;\0D\0A\0D\0A\09float3 voxelPos = VoxelIndexToWorldSpace(voxelIndex);\0D\0A\09float3 voxelExtends = g_sceneCB.distanceBtwVoxels * 0.5;\0D\0A\09float3 aabb[2] = { voxelPos - voxelExtends, voxelPos + voxelExtends };\0D\0A\0D\0A\09if(ray.direction.x != 0)\0D\0A\09\09tMax.x = (aabb[sign.x].x - ray.origin.x) * invRayDirection.x;\0D\0A\09\0D\0A\09if(ray.direction.y != 0)\0D\0A\09\09tMax.y = (aabb[sign.y].y - ray.origin.y) * invRayDirection.y;\0D\0A\09\0D\0A\09if(ray.direction.z != 0)\0D\0A\09\09tMax.z = (aabb[sign.z].z - ray.origin.z) * invRayDirection.z;\0D\0A\0D\0A\09if (tMax.x < tMax.y)\0D\0A\09{\0D\0A\09\09if (tMax.x < tMax.z)\0D\0A\09\09{\0D\0A\09\09\09res.x += direction.x;\0D\0A\09\09\09newT = tMax.x;\0D\0A\09\09\09voxelFaceNormal = VolumeRaytracer::CubeNormals[0] * -direction.x;\0D\0A\09\09}\0D\0A\09\09else\0D\0A\09\09{\0D\0A\09\09\09res.z += direction.z;\0D\0A\09\09\09newT = tMax.z;\0D\0A\09\09\09voxelFaceNormal = VolumeRaytracer::CubeNormals[4] * -direction.z;\0D\0A\09\09}\0D\0A\09}\0D\0A\09else\0D\0A\09{\0D\0A\09\09if (tMax.y < tMax.z)\0D\0A\09\09{\0D\0A\09\09\09res.y += direction.y;\0D\0A\09\09\09newT = tMax.y;\0D\0A\09\09\09voxelFaceNormal = VolumeRaytracer::CubeNormals[2] * -direction.y;\0D\0A\09\09}\0D\0A\09\09else\0D\0A\09\09{\0D\0A\09\09\09res.z += direction.z;\0D\0A\09\09\09newT = tMax.z;\0D\0A\09\09\09voxelFaceNormal = VolumeRaytracer::CubeNormals[4] * -direction.z;\0D\0A\09\09}\0D\0A\09}\0D\0A\0D\0A\09return res;\0D\0A}\0D\0A\0D\0A\0D\0A\0D\0Afloat3 GetPositionAlongRay(in Ray ray, in float t)\0D\0A{\0D\0A\09return ray.origin + ray.direction * t;\0D\0A}\0D\0A\0D\0Abool IsValidVoxelIndex(in int3 index)\0D\0A{\0D\0A\09return index.x >= 0 && index.x < g_sceneCB.voxelAxisCount && index.y >= 0 && index.y < g_sceneCB.voxelAxisCount && index.z >= 0 && index.z < g_sceneCB.voxelAxisCount;\0D\0A}\0D\0A\0D\0Abool IsSolid(in int3 index)\0D\0A{\0D\0A\09return g_voxelVolume[index].r > 0;\0D\0A}\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid VRRaygen()\0D\0A{\0D\0A\09Ray ray = GenerateCameraRay(DispatchRaysIndex().xy, g_sceneCB.cameraPosition.xyz, g_sceneCB.viewMatrixInverted, g_sceneCB.projectionMatrixInverted);\0D\0A\0D\0A\09uint currentRecursionDepth = 0;\0D\0A\09float4 color = TraceRadianceRay(ray, currentRecursionDepth);\0D\0A\0D\0A\09g_renderTarget[DispatchRaysIndex().xy] = color;\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid VRClosestHit(inout VolumeRaytracer::VRayPayload rayPayload, in VolumeRaytracer::VPrimitiveAttributes attr)\0D\0A{\0D\0A\09rayPayload.color = float4(attr.normal, 1);\0D\0A\09//rayPayload.color = float4(abs((attr.normal + 1) * 0.5), 1);\0D\0A}\0D\0A\0D\0A[shader(\22intersection\22)]\0D\0Avoid VRIntersection()\0D\0A{\0D\0A\09Ray ray;\0D\0A\0D\0A\09ray.origin = WorldRayOrigin();\0D\0A\09ray.direction = WorldRayDirection();\0D\0A\0D\0A\09//Check if we intersect voxel volume\0D\0A\09float3 volumeAABB[2] = {float3(-g_sceneCB.volumeExtend, -g_sceneCB.volumeExtend, -g_sceneCB.volumeExtend), float3(g_sceneCB.volumeExtend, g_sceneCB.volumeExtend, g_sceneCB.volumeExtend)};\0D\0A\09float tEnter, tExit;\0D\0A\0D\0A\09float tMax = RayTCurrent();\0D\0A\0D\0A\09if (DetermineRayAABBIntersection(ray, volumeAABB, tEnter, tExit))\0D\0A\09{\0D\0A\09\09int3 voxelDir = sign(ray.direction);\0D\0A\09\09int3 voxelPos;\0D\0A\09\09float3 hitNormal = -ray.direction;\0D\0A\0D\0A\09\09tEnter += 0.0001;\0D\0A\0D\0A\09\09if (tEnter >= 0)\0D\0A\09\09{\0D\0A\09\09\09voxelPos = WorldSpaceToVoxelSpace(GetPositionAlongRay(ray, tEnter));\0D\0A\09\09}\0D\0A\09\09else\0D\0A\09\09{\0D\0A\09\09\09voxelPos = WorldSpaceToVoxelSpace(ray.origin);\0D\0A\09\09}\0D\0A\0D\0A\09\09tExit = tEnter;\0D\0A\0D\0A\09\09while (tEnter <= tMax)\0D\0A\09\09{\0D\0A\09\09\09if (IsValidVoxelIndex(voxelPos) && IsSolid(voxelPos))\0D\0A\09\09\09{\0D\0A\09\09\09\09break;\0D\0A\09\09\09}\0D\0A\0D\0A\09\09\09tEnter = tExit + g_sceneCB.distanceBtwVoxels * 0.5;\0D\0A\09\09\09voxelPos = GoToNextVoxel(ray, voxelPos, voxelDir, tExit, hitNormal);\0D\0A\09\09}\0D\0A\0D\0A\09\09if (IsValidVoxelIndex(voxelPos) && IsSolid(voxelPos))\0D\0A\09\09{\0D\0A\09\09\09VolumeRaytracer::VPrimitiveAttributes attr;\0D\0A\09\09\09attr.normal = hitNormal;\0D\0A\0D\0A\09\09\09ReportHit(tEnter, 0, attr);\0D\0A\0D\0A\09\09\09/*VolumeRaytracer::VPrimitiveAttributes attr;\0D\0A\09\09\09attr.normal = g_voxelVolume[voxelPos].rgb;\0D\0A\0D\0A\09\09\09ReportHit(tEnter, 0, attr);*/\0D\0A\09\09}\0D\0A\09}\0D\0A\09//else\0D\0A\09//{\0D\0A\09//\09VolumeRaytracer::VPrimitiveAttributes attr;\0D\0A\09//\09attr.normal = float3(1, 0, 0);\0D\0A\0D\0A\09//\09ReportHit(RayTCurrent(), 0, attr);\0D\0A\09//}\0D\0A\0D\0A\09//VolumeRaytracer::VPrimitiveAttributes attr;\0D\0A\09//attr.normal = float3(1, 0, 0);\0D\0A\0D\0A\09//ReportHit(RayTCurrent(), 0, attr);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid VRMiss(inout VolumeRaytracer::VRayPayload rayPayload)\0D\0A{\0D\0A\09float3 rayDirection = WorldRayDirection();\0D\0A\09rayPayload.color = g_envMap.SampleLevel(g_envMapSampler, rayDirection.xzy, 0);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid VRMissShadowRay(inout VolumeRaytracer::VShadowRayPayload rayPayload)\0D\0A{\0D\0A\09rayPayload.hit = false;\0D\0A}"}
!190 = !{!".\5CDX\5CResources\5CShaders\5CRaytracingHlsl.h", !"/*\0D\0A\09Copyright (c) 2020 Thomas Sch\C3\B6ngrundner\0D\0A\0D\0A\09Permission is hereby granted, free of charge, to any person obtaining a copy\0D\0A\09of this software and associated documentation files (the \22Software\22), to deal\0D\0A\09in the Software without restriction, including without limitation the rights\0D\0A\09to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\0D\0A\09copies of the Software, and to permit persons to whom the Software is\0D\0A\09furnished to do so, subject to the following conditions:\0D\0A\0D\0A\09The above copyright notice and this permission notice shall be included in all\0D\0A\09copies or substantial portions of the Software.\0D\0A*/\0D\0A\0D\0A#pragma once\0D\0A\0D\0A#ifdef HLSL\0D\0Atypedef float2 XMFLOAT2;\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A#else\0D\0A\09#include <DirectXMath.h>\0D\0A\09using namespace DirectX;\0D\0A#endif\0D\0A\0D\0A#define MAX_RAY_RECURSION_DEPTH 3\0D\0A\0D\0Anamespace VolumeRaytracer\0D\0A{\0D\0A\09struct VPrimitiveAttributes\0D\0A\09{\0D\0A\09\09XMFLOAT3 normal;\0D\0A\09};\0D\0A\0D\0A\09struct VRayPayload\0D\0A\09{\0D\0A\09\09XMFLOAT4 color;\0D\0A\09\09UINT depth;\0D\0A\09};\0D\0A\0D\0A\09struct VShadowRayPayload\0D\0A\09{\0D\0A\09\09bool hit;\0D\0A\09};\0D\0A\0D\0A\09struct VSceneConstantBuffer\0D\0A\09{\0D\0A\09\09XMMATRIX viewMatrixInverted;\0D\0A\09\09XMMATRIX projectionMatrixInverted;\0D\0A\09\09XMVECTOR cameraPosition;\0D\0A\09\09UINT voxelAxisCount;\0D\0A\09\09float volumeExtend;\0D\0A\09\09float distanceBtwVoxels;\0D\0A\09};\0D\0A\0D\0A\09static const XMFLOAT4 BackgroundColor = XMFLOAT4(0.8f, 0.9f, 1.0f, 1.0f);\0D\0A\09static const XMFLOAT3 CubeNormals[] = {\0D\0A\09\09XMFLOAT3(1.0f, 0.0f, 0.0f),\0D\0A\09\09XMFLOAT3(-1.0f, 0.0f, 0.0f),\0D\0A\09\09XMFLOAT3(0.0f, 1.0f, 0.0f),\0D\0A\09\09XMFLOAT3(0.0f, -1.0f, 0.0f),\0D\0A\09\09XMFLOAT3(0.0f, 0.0f, 1.0f),\0D\0A\09\09XMFLOAT3(0.0f, 0.0f, -1.0f)\0D\0A\09};\0D\0A}"}
!191 = !{!"./DX/Resources/Shaders/Raytracing.hlsl"}
!192 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"-Zi", !"-Od", !"-Fo", !"./DX/Resources/Shaders/Compiled/Raytracing.cso", !"-Qembed_debug"}
!193 = !{i32 1, i32 3}
!194 = !{i32 1, i32 5}
!195 = !{!"lib", i32 6, i32 3}
!196 = !{!197, !203, !205, !207}
!197 = !{!198, !200, !202}
!198 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?g_scene@@3URaytracingAccelerationStructure@@A", !"g_scene", i32 0, i32 0, i32 1, i32 16, i32 0, !199}
!199 = !{i32 0, i32 4}
!200 = !{i32 1, %"class.Texture3D<vector<float, 4> >"* @"\01?g_voxelVolume@@3V?$Texture3D@V?$vector@M$03@@@@A", !"g_voxelVolume", i32 0, i32 2, i32 1, i32 4, i32 0, !201}
!201 = !{i32 0, i32 9}
!202 = !{i32 2, %"class.TextureCube<vector<float, 4> >"* @"\01?g_envMap@@3V?$TextureCube@V?$vector@M$03@@@@A", !"g_envMap", i32 0, i32 1, i32 1, i32 5, i32 0, !201}
!203 = !{!204}
!204 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?g_renderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"g_renderTarget", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !201}
!205 = !{!206}
!206 = !{i32 0, %g_sceneCB* @g_sceneCB, !"g_sceneCB", i32 0, i32 0, i32 1, i32 156, null}
!207 = !{!208}
!208 = !{i32 0, %struct.SamplerState* @"\01?g_envMapSampler@@3USamplerState@@A", !"g_envMapSampler", i32 0, i32 0, i32 1, i32 0, null}
!209 = !{i32 0, %struct.RaytracingAccelerationStructure undef, !210, %"class.Texture3D<vector<float, 4> >" undef, !212, %"class.Texture3D<vector<float, 4> >::mips_type" undef, !215, %"class.TextureCube<vector<float, 4> >" undef, !217, %"class.RWTexture2D<vector<float, 4> >" undef, !217, %"struct.VolumeRaytracer::VSceneConstantBuffer" undef, !218, %struct.Ray undef, !226, %struct.RayDesc undef, !229, %"struct.VolumeRaytracer::VRayPayload" undef, !234, %"struct.VolumeRaytracer::VPrimitiveAttributes" undef, !237, %"struct.VolumeRaytracer::VShadowRayPayload" undef, !239, %g_sceneCB undef, !241}
!210 = !{i32 4, !211}
!211 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!212 = !{i32 20, !213, !214}
!213 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!214 = !{i32 6, !"mips", i32 3, i32 16}
!215 = !{i32 4, !216}
!216 = !{i32 6, !"handle", i32 3, i32 0, i32 7, i32 5}
!217 = !{i32 16, !213}
!218 = !{i32 156, !219, !221, !222, !223, !224, !225}
!219 = !{i32 6, !"viewMatrixInverted", i32 2, !220, i32 3, i32 0, i32 7, i32 9}
!220 = !{i32 4, i32 4, i32 2}
!221 = !{i32 6, !"projectionMatrixInverted", i32 2, !220, i32 3, i32 64, i32 7, i32 9}
!222 = !{i32 6, !"cameraPosition", i32 3, i32 128, i32 7, i32 9}
!223 = !{i32 6, !"voxelAxisCount", i32 3, i32 144, i32 7, i32 5}
!224 = !{i32 6, !"volumeExtend", i32 3, i32 148, i32 7, i32 9}
!225 = !{i32 6, !"distanceBtwVoxels", i32 3, i32 152, i32 7, i32 9}
!226 = !{i32 28, !227, !228}
!227 = !{i32 6, !"origin", i32 3, i32 0, i32 7, i32 9}
!228 = !{i32 6, !"direction", i32 3, i32 16, i32 7, i32 9}
!229 = !{i32 32, !230, !231, !232, !233}
!230 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!231 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!232 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!233 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!234 = !{i32 20, !235, !236}
!235 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!236 = !{i32 6, !"depth", i32 3, i32 16, i32 7, i32 5}
!237 = !{i32 12, !238}
!238 = !{i32 6, !"normal", i32 3, i32 0, i32 7, i32 9}
!239 = !{i32 4, !240}
!240 = !{i32 6, !"hit", i32 3, i32 0, i32 7, i32 1}
!241 = !{i32 156, !242}
!242 = !{i32 6, !"g_sceneCB", i32 3, i32 0}
!243 = !{i32 1, void ()* @"\01?VRRaygen@@YAXXZ", !244, void (%"struct.VolumeRaytracer::VRayPayload"*, %"struct.VolumeRaytracer::VPrimitiveAttributes"*)* @"\01?VRClosestHit@@YAXUVRayPayload@VolumeRaytracer@@UVPrimitiveAttributes@2@@Z", !246, void ()* @"\01?VRIntersection@@YAXXZ", !244, void (%"struct.VolumeRaytracer::VRayPayload"*)* @"\01?VRMiss@@YAXUVRayPayload@VolumeRaytracer@@@Z", !249, void (%"struct.VolumeRaytracer::VShadowRayPayload"*)* @"\01?VRMissShadowRay@@YAXUVShadowRayPayload@VolumeRaytracer@@@Z", !249}
!244 = !{!245}
!245 = !{i32 1, !2, !2}
!246 = !{!245, !247, !248}
!247 = !{i32 2, !2, !2}
!248 = !{i32 0, !2, !2}
!249 = !{!245, !247}
!250 = !{null, !"", null, !196, !251}
!251 = !{i32 0, i64 65537}
!252 = !{void (%"struct.VolumeRaytracer::VRayPayload"*, %"struct.VolumeRaytracer::VPrimitiveAttributes"*)* @"\01?VRClosestHit@@YAXUVRayPayload@VolumeRaytracer@@UVPrimitiveAttributes@2@@Z", !"\01?VRClosestHit@@YAXUVRayPayload@VolumeRaytracer@@UVPrimitiveAttributes@2@@Z", null, null, !253}
!253 = !{i32 8, i32 10, i32 6, i32 20, i32 7, i32 12, i32 5, !254}
!254 = !{i32 0}
!255 = !{void ()* @"\01?VRIntersection@@YAXXZ", !"\01?VRIntersection@@YAXXZ", null, null, !256}
!256 = !{i32 8, i32 8, i32 5, !254}
!257 = !{void (%"struct.VolumeRaytracer::VRayPayload"*)* @"\01?VRMiss@@YAXUVRayPayload@VolumeRaytracer@@@Z", !"\01?VRMiss@@YAXUVRayPayload@VolumeRaytracer@@@Z", null, null, !258}
!258 = !{i32 8, i32 11, i32 6, i32 20, i32 5, !254}
!259 = !{void (%"struct.VolumeRaytracer::VShadowRayPayload"*)* @"\01?VRMissShadowRay@@YAXUVShadowRayPayload@VolumeRaytracer@@@Z", !"\01?VRMissShadowRay@@YAXUVShadowRayPayload@VolumeRaytracer@@@Z", null, null, !260}
!260 = !{i32 8, i32 11, i32 6, i32 4, i32 5, !254}
!261 = !{void ()* @"\01?VRRaygen@@YAXXZ", !"\01?VRRaygen@@YAXXZ", null, null, !262}
!262 = !{i32 8, i32 7, i32 5, !254}
!263 = !DILocation(line: 196, column: 124, scope: !77)
!264 = !DILocation(line: 196, column: 94, scope: !77)
!265 = !DILocation(line: 196, column: 30, scope: !77)
!266 = !DILocation(line: 196, column: 12, scope: !77)
!267 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "projInverted", arg: 4, scope: !107, file: !1, line: 34, type: !117)
!268 = !DIExpression(DW_OP_bit_piece, 0, 32)
!269 = !DILocation(line: 34, column: 107, scope: !107, inlinedAt: !270)
!270 = distinct !DILocation(line: 196, column: 12, scope: !77)
!271 = !DIExpression(DW_OP_bit_piece, 32, 32)
!272 = !DIExpression(DW_OP_bit_piece, 64, 32)
!273 = !DIExpression(DW_OP_bit_piece, 128, 32)
!274 = !DIExpression(DW_OP_bit_piece, 160, 32)
!275 = !DIExpression(DW_OP_bit_piece, 192, 32)
!276 = !DIExpression(DW_OP_bit_piece, 256, 32)
!277 = !DIExpression(DW_OP_bit_piece, 288, 32)
!278 = !DIExpression(DW_OP_bit_piece, 320, 32)
!279 = !DIExpression(DW_OP_bit_piece, 384, 32)
!280 = !DIExpression(DW_OP_bit_piece, 416, 32)
!281 = !DIExpression(DW_OP_bit_piece, 448, 32)
!282 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "viewInverted", arg: 3, scope: !107, file: !1, line: 34, type: !117)
!283 = !DILocation(line: 34, column: 81, scope: !107, inlinedAt: !270)
!284 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 1, scope: !107, file: !1, line: 34, type: !110)
!285 = !DILocation(line: 34, column: 36, scope: !107, inlinedAt: !270)
!286 = !DILocation(line: 36, column: 14, scope: !107, inlinedAt: !270)
!287 = !DILocation(line: 36, column: 20, scope: !107, inlinedAt: !270)
!288 = !DILocation(line: 36, column: 9, scope: !107, inlinedAt: !270)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xy", scope: !107, file: !1, line: 36, type: !290)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 36, baseType: !291)
!291 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 36, size: 64, align: 32, elements: !292, templateParams: !295)
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !291, file: !1, line: 36, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !291, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!295 = !{!13, !116}
!296 = !DILocation(line: 37, column: 26, scope: !107, inlinedAt: !270)
!297 = !DILocation(line: 37, column: 24, scope: !107, inlinedAt: !270)
!298 = !DILocation(line: 37, column: 54, scope: !107, inlinedAt: !270)
!299 = !DILocation(line: 37, column: 60, scope: !107, inlinedAt: !270)
!300 = !DILocation(line: 37, column: 9, scope: !107, inlinedAt: !270)
!301 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "screenPos", scope: !107, file: !1, line: 37, type: !290)
!302 = !DILocation(line: 48, column: 15, scope: !107, inlinedAt: !270)
!303 = !DILocation(line: 48, column: 13, scope: !107, inlinedAt: !270)
!304 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ray", arg: 0, scope: !107, file: !1, line: 46, type: !36)
!305 = !DILocation(line: 46, column: 6, scope: !107, inlinedAt: !270)
!306 = !DILocation(line: 50, column: 56, scope: !107, inlinedAt: !270)
!307 = !DILocation(line: 50, column: 18, scope: !107, inlinedAt: !270)
!308 = !DILocation(line: 50, column: 9, scope: !107, inlinedAt: !270)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "target", scope: !107, file: !1, line: 50, type: !4)
!310 = !DILocation(line: 51, column: 18, scope: !107, inlinedAt: !270)
!311 = !DILocation(line: 51, column: 16, scope: !107, inlinedAt: !270)
!312 = !DIExpression(DW_OP_bit_piece, 96, 32)
!313 = !DILocation(line: 53, column: 2, scope: !107, inlinedAt: !270)
!314 = !DILocation(line: 198, column: 7, scope: !77)
!315 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currentRecursionDepth", scope: !77, file: !1, line: 198, type: !40)
!316 = !DIExpression()
!317 = !DILocation(line: 199, column: 17, scope: !77)
!318 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ray", arg: 1, scope: !33, file: !1, line: 56, type: !36)
!319 = !DILocation(line: 56, column: 32, scope: !33, inlinedAt: !320)
!320 = distinct !DILocation(line: 199, column: 17, scope: !77)
!321 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currentRayRecursionDepth", arg: 2, scope: !33, file: !1, line: 56, type: !40)
!322 = !DILocation(line: 56, column: 45, scope: !33, inlinedAt: !320)
!323 = !DILocation(line: 58, column: 6, scope: !33, inlinedAt: !320)
!324 = !DILocation(line: 64, column: 10, scope: !33, inlinedAt: !320)
!325 = !DILocation(line: 64, column: 17, scope: !33, inlinedAt: !320)
!326 = !DILocation(line: 65, column: 10, scope: !33, inlinedAt: !320)
!327 = !DILocation(line: 65, column: 20, scope: !33, inlinedAt: !320)
!328 = !DILocation(line: 67, column: 10, scope: !33, inlinedAt: !320)
!329 = !DILocation(line: 67, column: 15, scope: !33, inlinedAt: !320)
!330 = !DILocation(line: 68, column: 10, scope: !33, inlinedAt: !320)
!331 = !DILocation(line: 68, column: 15, scope: !33, inlinedAt: !320)
!332 = !DILocation(line: 70, column: 44, scope: !33, inlinedAt: !320)
!333 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayPayload", scope: !33, file: !1, line: 70, type: !84)
!334 = !DIExpression(DW_OP_bit_piece, 0, 128)
!335 = !DILocation(line: 70, column: 31, scope: !33, inlinedAt: !320)
!336 = !DILocation(line: 70, column: 88, scope: !33, inlinedAt: !320)
!337 = !DILocation(line: 72, column: 2, scope: !33, inlinedAt: !320)
!338 = !DILocation(line: 74, column: 2, scope: !33, inlinedAt: !320)
!339 = !DILocation(line: 75, column: 1, scope: !33, inlinedAt: !320)
!340 = !DILocation(line: 199, column: 9, scope: !77)
!341 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "color", scope: !77, file: !1, line: 199, type: !4)
!342 = !DILocation(line: 201, column: 17, scope: !77)
!343 = !DILocation(line: 201, column: 2, scope: !77)
!344 = !DILocation(line: 201, column: 41, scope: !77)
!345 = !DILocation(line: 202, column: 1, scope: !77)
!346 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayDesc", scope: !33, file: !1, line: 63, type: !347)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 63, size: 256, align: 32, elements: !348)
!348 = !{!349, !350, !351, !352}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !347, file: !1, line: 63, baseType: !26, size: 96, align: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !347, file: !1, line: 63, baseType: !8, size: 32, align: 32, offset: 96)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !347, file: !1, line: 63, baseType: !26, size: 96, align: 32, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !347, file: !1, line: 63, baseType: !8, size: 32, align: 32, offset: 224)
!353 = !DILocation(line: 63, column: 10, scope: !33, inlinedAt: !320)
!354 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !80, file: !1, line: 205, type: !92)
!355 = !DILocation(line: 205, column: 107, scope: !80)
!356 = !DILocation(line: 207, column: 33, scope: !80)
!357 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rayPayload", arg: 1, scope: !80, file: !1, line: 205, type: !84)
!358 = !DILocation(line: 205, column: 54, scope: !80)
!359 = !DILocation(line: 207, column: 28, scope: !80)
!360 = !DILocation(line: 207, column: 19, scope: !80)
!361 = !DILocation(line: 209, column: 1, scope: !80)
!362 = !DILocation(line: 216, column: 15, scope: !96)
!363 = !DILocation(line: 216, column: 13, scope: !96)
!364 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !96, file: !1, line: 214, type: !36)
!365 = !DILocation(line: 214, column: 6, scope: !96)
!366 = !DILocation(line: 217, column: 18, scope: !96)
!367 = !DILocation(line: 217, column: 16, scope: !96)
!368 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volumeAABB", scope: !96, file: !1, line: 220, type: !46)
!369 = !DILocation(line: 220, column: 9, scope: !96)
!370 = !{i32 0, i32 96, i32 2}
!371 = !{i32 32, i32 96, i32 2}
!372 = !{i32 64, i32 96, i32 2}
!373 = !DILocation(line: 220, column: 25, scope: !96)
!374 = !DILocation(line: 220, column: 44, scope: !96)
!375 = !DILocation(line: 220, column: 33, scope: !96)
!376 = !DILocation(line: 220, column: 69, scope: !96)
!377 = !DILocation(line: 220, column: 58, scope: !96)
!378 = !DILocation(line: 220, column: 94, scope: !96)
!379 = !DILocation(line: 220, column: 83, scope: !96)
!380 = !DILocation(line: 220, column: 126, scope: !96)
!381 = !DILocation(line: 220, column: 150, scope: !96)
!382 = !DILocation(line: 220, column: 174, scope: !96)
!383 = !DILocation(line: 223, column: 15, scope: !96)
!384 = !DILocation(line: 223, column: 8, scope: !96)
!385 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tMax", scope: !96, file: !1, line: 223, type: !8)
!386 = !DILocation(line: 225, column: 6, scope: !387)
!387 = distinct !DILexicalBlock(scope: !96, file: !1, line: 225, column: 6)
!388 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ray", arg: 1, scope: !42, file: !1, line: 77, type: !36)
!389 = !DILocation(line: 77, column: 42, scope: !42, inlinedAt: !390)
!390 = distinct !DILocation(line: 225, column: 6, scope: !387)
!391 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aabb", arg: 2, scope: !42, file: !1, line: 77, type: !46)
!392 = !DILocation(line: 77, column: 57, scope: !42, inlinedAt: !390)
!393 = !DILocation(line: 80, column: 29, scope: !42, inlinedAt: !390)
!394 = !DILocation(line: 80, column: 15, scope: !42, inlinedAt: !390)
!395 = !DILocation(line: 80, column: 7, scope: !42, inlinedAt: !390)
!396 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign3", scope: !42, file: !1, line: 80, type: !16)
!397 = !DILocation(line: 83, column: 41, scope: !42, inlinedAt: !390)
!398 = !DILocation(line: 84, column: 7, scope: !42, inlinedAt: !390)
!399 = !DILocation(line: 85, column: 20, scope: !42, inlinedAt: !390)
!400 = !DILocation(line: 85, column: 5, scope: !42, inlinedAt: !390)
!401 = !DILocation(line: 83, column: 27, scope: !42, inlinedAt: !390)
!402 = !DILocation(line: 83, column: 9, scope: !42, inlinedAt: !390)
!403 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "invRayDirection", scope: !42, file: !1, line: 83, type: !25)
!404 = !DILocation(line: 87, column: 20, scope: !42, inlinedAt: !390)
!405 = !DILocation(line: 87, column: 13, scope: !42, inlinedAt: !390)
!406 = !DILocation(line: 87, column: 33, scope: !42, inlinedAt: !390)
!407 = !DILocation(line: 87, column: 49, scope: !42, inlinedAt: !390)
!408 = !DILocation(line: 87, column: 10, scope: !42, inlinedAt: !390)
