#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: 8a8970758d21557d19af8a4414254c85.pdb
; shader hash: 8a8970758d21557d19af8a4414254c85
;
; Buffer Definitions:
;
; cbuffer g_sceneCB
; {
;
;   struct g_sceneCB
;   {
;
;       struct struct.VolumeRaytracer::VSceneConstantBuffer
;       {
;
;           column_major float4x4 viewMatrixInverted; ; Offset:    0
;           column_major float4x4 projectionMatrixInverted;; Offset:   64
;           float4 cameraPosition;                    ; Offset:  128
;           uint voxelAxisCount;                      ; Offset:  144
;           float volumeExtend;                       ; Offset:  148
;       
;       } g_sceneCB;                                  ; Offset:    0
;
;   
;   } g_sceneCB;                                      ; Offset:    0 Size:   152
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; g_sceneCB                         cbuffer      NA          NA     CB0            cb0     1
; g_envMapSampler                   sampler      NA          NA      S0             s0     1
; g_scene                           texture     i32         ras      T0             t0     1
; g_envMap                          texture     f32        cube      T1             t2     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !33, globals: !139)
!1 = !DIFile(filename: "./DX/Resources/Shaders/Raytracing.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16, !26}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 100, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 100, size: 96, align: 32, elements: !18, templateParams: !23)
!18 = !{!19, !21, !22}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 100, baseType: !20, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 100, baseType: !20, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, line: 100, baseType: !20, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!23 = !{!24, !25}
!24 = !DITemplateTypeParameter(name: "element", type: !20)
!25 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !28, templateParams: !32)
!28 = !{!29, !30, !31}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !27, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !27, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !27, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!32 = !{!13, !25}
!33 = !{!34, !42, !51, !54, !57, !70, !73, !76, !77, !80, !96, !97, !100, !107}
!34 = !DISubprogram(name: "TraceRadianceRay", linkageName: "\01?TraceRadianceRay@@YA?AV?$vector@M$03@@URay@@I@Z", scope: !1, file: !1, line: 56, type: !35, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false)
!35 = !DISubroutineType(types: !36)
!36 = !{!4, !37, !41}
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray", file: !1, line: 28, size: 192, align: 32, elements: !38)
!38 = !{!39, !40}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !37, file: !1, line: 30, baseType: !26, size: 96, align: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !37, file: !1, line: 31, baseType: !26, size: 96, align: 32, offset: 96)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !20)
!42 = !DISubprogram(name: "DetermineRayAABBIntersection", linkageName: "\01?DetermineRayAABBIntersection@@YA_NURay@@Y01V?$vector@M$02@@AIAM2@Z", scope: !1, file: !1, line: 77, type: !43, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: false)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !37, !46, !49, !49}
!45 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 192, align: 32, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 2)
!49 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !8)
!51 = !DISubprogram(name: "WorldSpaceToVoxelSpace", linkageName: "\01?WorldSpaceToVoxelSpace@@YA?AV?$vector@I$02@@V?$vector@M$02@@@Z", scope: !1, file: !1, line: 102, type: !52, isLocal: false, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: false)
!52 = !DISubroutineType(types: !53)
!53 = !{!16, !26}
!54 = !DISubprogram(name: "VoxelIndexToWorldSpace", linkageName: "\01?VoxelIndexToWorldSpace@@YA?AV?$vector@M$02@@V?$vector@I$02@@@Z", scope: !1, file: !1, line: 110, type: !55, isLocal: false, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: false)
!55 = !DISubroutineType(types: !56)
!56 = !{!26, !16}
!57 = !DISubprogram(name: "GoToNextVoxel", linkageName: "\01?GoToNextVoxel@@YA?AV?$vector@I$02@@URay@@MV1@V?$vector@H$02@@AIAMAIAV?$vector@M$02@@@Z", scope: !1, file: !1, line: 118, type: !58, isLocal: false, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: false)
!58 = !DISubroutineType(types: !59)
!59 = !{!16, !37, !8, !16, !60, !49, !68}
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 80, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 80, size: 96, align: 32, elements: !62, templateParams: !66)
!62 = !{!63, !64, !65}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !61, file: !1, line: 80, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !61, file: !1, line: 80, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !61, file: !1, line: 80, baseType: !15, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!66 = !{!67, !25}
!67 = !DITemplateTypeParameter(name: "element", type: !15)
!68 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !26)
!70 = !DISubprogram(name: "GetPositionAlongRay", linkageName: "\01?GetPositionAlongRay@@YA?AV?$vector@M$02@@URay@@M@Z", scope: !1, file: !1, line: 175, type: !71, isLocal: false, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: false)
!71 = !DISubroutineType(types: !72)
!72 = !{!26, !37, !8}
!73 = !DISubprogram(name: "IsValidVoxelIndex", linkageName: "\01?IsValidVoxelIndex@@YA_NV?$vector@I$02@@@Z", scope: !1, file: !1, line: 180, type: !74, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: false)
!74 = !DISubroutineType(types: !75)
!75 = !{!45, !16}
!76 = !DISubprogram(name: "IsSolid", linkageName: "\01?IsSolid@@YA_NV?$vector@I$02@@@Z", scope: !1, file: !1, line: 185, type: !74, isLocal: false, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: false)
!77 = !DISubprogram(name: "VRRaygen", linkageName: "\01?VRRaygen@@YAXXZ", scope: !1, file: !1, line: 191, type: !78, isLocal: false, isDefinition: true, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?VRRaygen@@YAXXZ")
!78 = !DISubroutineType(types: !79)
!79 = !{null}
!80 = !DISubprogram(name: "VRClosestHit", linkageName: "\01?VRClosestHit@@YAXUVRayPayload@VolumeRaytracer@@UVPrimitiveAttributes@2@@Z", scope: !1, file: !1, line: 202, type: !81, isLocal: false, isDefinition: true, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: false, function: void (%"struct.VolumeRaytracer::VRayPayload"*, %"struct.VolumeRaytracer::VPrimitiveAttributes"*)* @"\01?VRClosestHit@@YAXUVRayPayload@VolumeRaytracer@@UVPrimitiveAttributes@2@@Z")
!81 = !DISubroutineType(types: !82)
!82 = !{null, !83, !92}
!83 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !84)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "VRayPayload", scope: !86, file: !85, line: 38, size: 160, align: 32, elements: !87)
!85 = !DIFile(filename: "./DX/Resources/Shaders/RaytracingHlsl.h", directory: "")
!86 = !DINamespace(name: "VolumeRaytracer", scope: null, file: !85, line: 31)
!87 = !{!88, !90}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !84, file: !85, line: 40, baseType: !89, size: 128, align: 32)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !85, line: 20, baseType: !4)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !84, file: !85, line: 41, baseType: !91, size: 32, align: 32, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !85, line: 23, baseType: !41)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "VPrimitiveAttributes", scope: !86, file: !85, line: 33, size: 96, align: 32, elements: !93)
!93 = !{!94}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !92, file: !85, line: 35, baseType: !95, size: 96, align: 32)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !85, line: 19, baseType: !26)
!96 = !DISubprogram(name: "VRIntersection", linkageName: "\01?VRIntersection@@YAXXZ", scope: !1, file: !1, line: 208, type: !78, isLocal: false, isDefinition: true, scopeLine: 209, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?VRIntersection@@YAXXZ")
!97 = !DISubprogram(name: "VRMiss", linkageName: "\01?VRMiss@@YAXUVRayPayload@VolumeRaytracer@@@Z", scope: !1, file: !1, line: 270, type: !98, isLocal: false, isDefinition: true, scopeLine: 271, flags: DIFlagPrototyped, isOptimized: false, function: void (%"struct.VolumeRaytracer::VRayPayload"*)* @"\01?VRMiss@@YAXUVRayPayload@VolumeRaytracer@@@Z")
!98 = !DISubroutineType(types: !99)
!99 = !{null, !83}
!100 = !DISubprogram(name: "VRMissShadowRay", linkageName: "\01?VRMissShadowRay@@YAXUVShadowRayPayload@VolumeRaytracer@@@Z", scope: !1, file: !1, line: 282, type: !101, isLocal: false, isDefinition: true, scopeLine: 283, flags: DIFlagPrototyped, isOptimized: false, function: void (%"struct.VolumeRaytracer::VShadowRayPayload"*)* @"\01?VRMissShadowRay@@YAXUVShadowRayPayload@VolumeRaytracer@@@Z")
!101 = !DISubroutineType(types: !102)
!102 = !{null, !103}
!103 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !104)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "VShadowRayPayload", scope: !86, file: !85, line: 44, size: 32, align: 32, elements: !105)
!105 = !{!106}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !104, file: !85, line: 46, baseType: !45, size: 32, align: 32)
!107 = !DISubprogram(name: "GenerateCameraRay", linkageName: "\01?GenerateCameraRay@@YA?AURay@@V?$vector@I$01@@V?$vector@M$02@@V?$matrix@M$03$03@@2@Z", scope: !1, file: !1, line: 34, type: !108, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!108 = !DISubroutineType(types: !109)
!109 = !{!37, !110, !26, !117, !117}
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 26, baseType: !111)
!111 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 26, size: 64, align: 32, elements: !112, templateParams: !115)
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !111, file: !1, line: 26, baseType: !20, size: 32, align: 32, flags: DIFlagPublic)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !111, file: !1, line: 26, baseType: !20, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!115 = !{!24, !116}
!116 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 26, baseType: !118)
!118 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 26, size: 512, align: 32, elements: !119, templateParams: !136)
!119 = !{!120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !118, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!136 = !{!13, !137, !138}
!137 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!138 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!139 = !{!140, !142, !144, !146, !151, !153, !156, !160, !162, !164, !177, !179, !181, !183}
!140 = !DIGlobalVariable(name: "RAY_FLAG_CULL_BACK_FACING_TRIANGLES", scope: !0, file: !1, line: 72, type: !141, isLocal: true, isDefinition: true, variable: i32 16)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!142 = !DIGlobalVariable(name: "FLT_INFINITY", scope: !42, file: !1, line: 82, type: !143, isLocal: true, isDefinition: true)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!144 = !DIGlobalVariable(name: "BackgroundColor", linkageName: "\01?BackgroundColor@VolumeRaytracer@@3V?$vector@M$03@@B", scope: !86, file: !85, line: 58, type: !145, isLocal: true, isDefinition: true)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!146 = !DIGlobalVariable(name: "CubeNormals", linkageName: "\01?CubeNormals@VolumeRaytracer@@3QBV?$vector@M$02@@B", scope: !86, file: !85, line: 59, type: !147, isLocal: true, isDefinition: true)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 576, align: 32, elements: !149)
!148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!149 = !{!150}
!150 = !DISubrange(count: 6)
!151 = !DIGlobalVariable(name: "g_scene", linkageName: "\01?g_scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 19, type: !152, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?g_scene@@3URaytracingAccelerationStructure@@A")
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 19, size: 32, align: 32, elements: !2)
!153 = !DIGlobalVariable(name: "g_voxelVolume", linkageName: "\01?g_voxelVolume@@3V?$Texture3D@M@@A", scope: !0, file: !1, line: 20, type: !154, isLocal: false, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture3D<float>", file: !1, line: 20, size: 64, align: 32, elements: !2, templateParams: !155)
!155 = !{!13}
!156 = !DIGlobalVariable(name: "g_envMap", linkageName: "\01?g_envMap@@3V?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 22, type: !157, isLocal: false, isDefinition: true, variable: %"class.TextureCube<vector<float, 4> >"* @"\01?g_envMap@@3V?$TextureCube@V?$vector@M$03@@@@A")
!157 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 22, size: 128, align: 32, elements: !2, templateParams: !158)
!158 = !{!159}
!159 = !DITemplateTypeParameter(name: "element", type: !5)
!160 = !DIGlobalVariable(name: "g_envMapSampler", linkageName: "\01?g_envMapSampler@@3USamplerState@@A", scope: !0, file: !1, line: 23, type: !161, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?g_envMapSampler@@3USamplerState@@A")
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 23, size: 32, align: 32, elements: !2)
!162 = !DIGlobalVariable(name: "g_renderTarget", linkageName: "\01?g_renderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 25, type: !163, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?g_renderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!163 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 25, size: 128, align: 32, elements: !2, templateParams: !158)
!164 = !DIGlobalVariable(name: "g_sceneCB", linkageName: "\01?g_sceneCB@@3V?$ConstantBuffer@UVSceneConstantBuffer@VolumeRaytracer@@@@A", scope: !0, file: !1, line: 26, type: !165, isLocal: false, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_class_type, name: "ConstantBuffer<VolumeRaytracer::VSceneConstantBuffer>", file: !1, line: 26, size: 32, align: 32, elements: !2, templateParams: !166)
!166 = !{!167}
!167 = !DITemplateTypeParameter(name: "T", type: !168)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSceneConstantBuffer", scope: !86, file: !85, line: 49, size: 1216, align: 32, elements: !169)
!169 = !{!170, !172, !173, !175, !176}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatrixInverted", scope: !168, file: !85, line: 51, baseType: !171, size: 512, align: 32)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMMATRIX", file: !85, line: 22, baseType: !117)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "projectionMatrixInverted", scope: !168, file: !85, line: 52, baseType: !171, size: 512, align: 32, offset: 512)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "cameraPosition", scope: !168, file: !85, line: 53, baseType: !174, size: 128, align: 32, offset: 1024)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMVECTOR", file: !85, line: 21, baseType: !4)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "voxelAxisCount", scope: !168, file: !85, line: 54, baseType: !91, size: 32, align: 32, offset: 1152)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "volumeExtend", scope: !168, file: !85, line: 55, baseType: !8, size: 32, align: 32, offset: 1184)
!177 = !DIGlobalVariable(name: "BackgroundColor.1", linkageName: "\01?BackgroundColor@VolumeRaytracer@@3V?$vector@M$03@@B.1", scope: !86, file: !85, line: 58, type: !178, isLocal: false, isDefinition: true)
!178 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !145, size: 32, align: 4, offset: 32)
!179 = !DIGlobalVariable(name: "BackgroundColor.2", linkageName: "\01?BackgroundColor@VolumeRaytracer@@3V?$vector@M$03@@B.2", scope: !86, file: !85, line: 58, type: !180, isLocal: false, isDefinition: true)
!180 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !145, size: 32, align: 4, offset: 64)
!181 = !DIGlobalVariable(name: "BackgroundColor.3", linkageName: "\01?BackgroundColor@VolumeRaytracer@@3V?$vector@M$03@@B.3", scope: !86, file: !85, line: 58, type: !182, isLocal: false, isDefinition: true)
!182 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !145, size: 32, align: 4, offset: 96)
!183 = !DIGlobalVariable(name: "BackgroundColor.0", linkageName: "\01?BackgroundColor@VolumeRaytracer@@3V?$vector@M$03@@B.0", scope: !86, file: !85, line: 58, type: !184, isLocal: false, isDefinition: true)
!184 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !145, size: 32, align: 4)
!185 = !{i32 2, !"Dwarf Version", i32 4}
!186 = !{i32 2, !"Debug Info Version", i32 3}
!187 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!188 = !{!".\5CDX\5CResources\5CShaders\5CRaytracing.hlsl", !"/*\0D\0A\09Copyright (c) 2020 Thomas Sch\C3\B6ngrundner\0D\0A\0D\0A\09Permission is hereby granted, free of charge, to any person obtaining a copy\0D\0A\09of this software and associated documentation files (the \22Software\22), to deal\0D\0A\09in the Software without restriction, including without limitation the rights\0D\0A\09to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\0D\0A\09copies of the Software, and to permit persons to whom the Software is\0D\0A\09furnished to do so, subject to the following conditions:\0D\0A\0D\0A\09The above copyright notice and this permission notice shall be included in all\0D\0A\09copies or substantial portions of the Software.\0D\0A*/\0D\0A\0D\0A#define HLSL\0D\0A\0D\0A#include \22RaytracingHlsl.h\22\0D\0A\0D\0ARaytracingAccelerationStructure g_scene : register(t0, space0);\0D\0ATexture3D<float> g_voxelVolume : register(t1, space0);\0D\0A\0D\0ATextureCube g_envMap : register(t2, space0);\0D\0ASamplerState g_envMapSampler : register(s0);\0D\0A\0D\0ARWTexture2D<float4> g_renderTarget : register(u0);\0D\0AConstantBuffer<VolumeRaytracer::VSceneConstantBuffer> g_sceneCB : register(b0);\0D\0A\0D\0Astruct Ray\0D\0A{\0D\0A\09float3 origin;\0D\0A\09float3 direction;\0D\0A};\0D\0A\0D\0Ainline Ray GenerateCameraRay(uint2 index, in float3 cameraPosition, in float4x4 viewInverted, in float4x4 projInverted)\0D\0A{\0D\0A\09float2 xy = index + 0.5f; // center in the middle of the pixel.\0D\0A\09float2 screenPos = xy / DispatchRaysDimensions().xy * 2.0 - 1.0;\0D\0A\0D\0A\09// Invert Y for DirectX-style coordinates.\0D\0A\09//screenPos.y = -screenPos.y;\0D\0A\0D\0A\09// Unproject the pixel coordinate into a world positon.\0D\0A\09//float4 world = mul(float4(screenPos, 0, 1), projectionToWorld);\0D\0A\09//world.xyz /= world.w;\0D\0A\0D\0A\09Ray ray;\0D\0A\09//ray.origin = cameraPosition;\0D\0A\09ray.origin = mul(viewInverted, float4(0,0,0,1)).xyz;\0D\0A\0D\0A\09float4 target = mul(projInverted, float4(screenPos.x, -screenPos.y, 1, 1));\0D\0A\09ray.direction = mul(viewInverted, float4(target.xyz, 0)).xyz;\0D\0A\0D\0A\09return ray;\0D\0A}\0D\0A\0D\0Afloat4 TraceRadianceRay(in Ray ray, in uint currentRayRecursionDepth)\0D\0A{\0D\0A\09if (currentRayRecursionDepth >= MAX_RAY_RECURSION_DEPTH)\0D\0A\09{\0D\0A\09\09return float4(0,0,0,0);\0D\0A\09}\0D\0A\0D\0A\09RayDesc rayDesc;\0D\0A\09rayDesc.Origin = ray.origin;\0D\0A\09rayDesc.Direction = ray.direction;\0D\0A\0D\0A\09rayDesc.TMin = 0;\0D\0A\09rayDesc.TMax = 10000;\0D\0A\0D\0A\09VolumeRaytracer::VRayPayload rayPayload = { float4(0,0,0,0), currentRayRecursionDepth + 1 };\0D\0A\0D\0A\09TraceRay(g_scene, RAY_FLAG_CULL_BACK_FACING_TRIANGLES, 0xff, 0, 2, 0, rayDesc, rayPayload);\0D\0A\0D\0A\09return rayPayload.color;\0D\0A}\0D\0A\0D\0Abool DetermineRayAABBIntersection(in Ray ray, in float3 aabb[2], out float tEnter, out float tExit)\0D\0A{\0D\0A\09float3 tmin3, tmax3;\0D\0A\09int3 sign3 = ray.direction > 0;\0D\0A\0D\0A\09const float FLT_INFINITY = 1.#INF;\0D\0A\09float3 invRayDirection = ray.direction != 0\0D\0A\09\09? 1 / ray.direction\0D\0A\09\09: (ray.direction > 0) ? FLT_INFINITY : -FLT_INFINITY;\0D\0A\0D\0A\09tmin3.x = (aabb[1 - sign3.x].x - ray.origin.x) * invRayDirection.x;\0D\0A\09tmax3.x = (aabb[sign3.x].x - ray.origin.x) * invRayDirection.x;\0D\0A\0D\0A\09tmin3.y = (aabb[1 - sign3.y].y - ray.origin.y) * invRayDirection.y;\0D\0A\09tmax3.y = (aabb[sign3.y].y - ray.origin.y) * invRayDirection.y;\0D\0A\0D\0A\09tmin3.z = (aabb[1 - sign3.z].z - ray.origin.z) * invRayDirection.z;\0D\0A\09tmax3.z = (aabb[sign3.z].z - ray.origin.z) * invRayDirection.z;\0D\0A\0D\0A\09tEnter = max(max(tmin3.x, tmin3.y), tmin3.z);\0D\0A\09tExit = min(min(tmax3.x, tmax3.y), tmax3.z);\0D\0A\0D\0A\09return tExit > tEnter && tExit >= RayTMin() && tEnter <= RayTCurrent();\0D\0A}\0D\0A\0D\0Auint3 WorldSpaceToVoxelSpace(in float3 worldLocation)\0D\0A{\0D\0A\09float3 relativeVolumePos = worldLocation - g_sceneCB.volumeExtend;\0D\0A\09float distanceBetweenVoxel = (g_sceneCB.volumeExtend * 2) / g_sceneCB.voxelAxisCount;\0D\0A\0D\0A\09return uint3(relativeVolumePos.x / distanceBetweenVoxel, relativeVolumePos.y / distanceBetweenVoxel, relativeVolumePos.z / distanceBetweenVoxel);\0D\0A}\0D\0A\0D\0Afloat3 VoxelIndexToWorldSpace(in uint3 voxelIndex)\0D\0A{\0D\0A\09float distanceBetweenVoxel = (g_sceneCB.volumeExtend * 2) / g_sceneCB.voxelAxisCount;\0D\0A\09float3 voxelIndexF = voxelIndex;\0D\0A\0D\0A\09return voxelIndexF * distanceBetweenVoxel + distanceBetweenVoxel * 0.5f - g_sceneCB.volumeExtend;\0D\0A}\0D\0A\0D\0Auint3 GoToNextVoxel(in Ray ray, in float currentT, in uint3 voxelIndex, in int3 direction, out float newT, out float3 voxelFaceNormal)\0D\0A{\0D\0A\09float maxX, maxY, maxZ = 100000;\0D\0A\09float3 voxelMax = VoxelIndexToWorldSpace(voxelIndex) + ((g_sceneCB.volumeExtend * 2) / g_sceneCB.voxelAxisCount) * 0.5f;\0D\0A\09uint3 res = voxelIndex;\0D\0A\0D\0A\09if (ray.direction.x != 0)\0D\0A\09{\0D\0A\09\09maxX = (voxelMax.x - ray.origin.x) / ray.direction.x;\0D\0A\09}\0D\0A\0D\0A\09if (ray.direction.y != 0)\0D\0A\09{\0D\0A\09\09maxY = (voxelMax.y - ray.origin.y) / ray.direction.y;\0D\0A\09}\0D\0A\0D\0A\09if (ray.direction.z != 0)\0D\0A\09{\0D\0A\09\09maxZ = (voxelMax.z - ray.origin.z) / ray.direction.z;\0D\0A\09}\0D\0A\0D\0A\09if (maxX < maxY)\0D\0A\09{\0D\0A\09\09if (maxX < maxZ)\0D\0A\09\09{\0D\0A\09\09\09res.x += direction.x;\0D\0A\09\09\09newT = maxX;\0D\0A\09\09\09voxelFaceNormal = VolumeRaytracer::CubeNormals[0] * -direction.x;\0D\0A\09\09}\0D\0A\09\09else\0D\0A\09\09{\0D\0A\09\09\09res.z += direction.z;\0D\0A\09\09\09newT = maxZ;\0D\0A\09\09\09voxelFaceNormal = VolumeRaytracer::CubeNormals[4] * -direction.z;\0D\0A\09\09}\0D\0A\09}\0D\0A\09else\0D\0A\09{\0D\0A\09\09if (maxY < maxZ)\0D\0A\09\09{\0D\0A\09\09\09res.y += direction.y;\0D\0A\09\09\09newT = maxY;\0D\0A\09\09\09voxelFaceNormal = VolumeRaytracer::CubeNormals[2] * -direction.y;\0D\0A\09\09}\0D\0A\09\09else\0D\0A\09\09{\0D\0A\09\09\09res.z += direction.z;\0D\0A\09\09\09newT = maxZ;\0D\0A\09\09\09voxelFaceNormal = VolumeRaytracer::CubeNormals[4] * -direction.z;\0D\0A\09\09}\0D\0A\09}\0D\0A\0D\0A\09return res;\0D\0A}\0D\0A\0D\0A\0D\0A\0D\0Afloat3 GetPositionAlongRay(in Ray ray, in float t)\0D\0A{\0D\0A\09return ray.origin + ray.direction * t;\0D\0A}\0D\0A\0D\0Abool IsValidVoxelIndex(in uint3 index)\0D\0A{\0D\0A\09return index.x < g_sceneCB.voxelAxisCount && index.y < g_sceneCB.voxelAxisCount && index.z < g_sceneCB.voxelAxisCount;\0D\0A}\0D\0A\0D\0Abool IsSolid(in uint3 index)\0D\0A{\0D\0A\09return g_voxelVolume[index].r > 0;\0D\0A}\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid VRRaygen()\0D\0A{\0D\0A\09Ray ray = GenerateCameraRay(DispatchRaysIndex().xy, g_sceneCB.cameraPosition.xyz, g_sceneCB.viewMatrixInverted, g_sceneCB.projectionMatrixInverted);\0D\0A\0D\0A\09uint currentRecursionDepth = 0;\0D\0A\09float4 color = TraceRadianceRay(ray, currentRecursionDepth);\0D\0A\0D\0A\09g_renderTarget[DispatchRaysIndex().xy] = color;\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid VRClosestHit(inout VolumeRaytracer::VRayPayload rayPayload, in VolumeRaytracer::VPrimitiveAttributes attr)\0D\0A{\0D\0A\09rayPayload.color = float4(abs((attr.normal + 1) * 0.5), 1);\0D\0A}\0D\0A\0D\0A[shader(\22intersection\22)]\0D\0Avoid VRIntersection()\0D\0A{\0D\0A\09Ray ray;\0D\0A\0D\0A\09ray.origin = WorldRayOrigin();\0D\0A\09ray.direction = WorldRayDirection();\0D\0A\0D\0A\09//Check if we intersect voxel volume\0D\0A\09float3 volumeAABB[2] = {float3(-g_sceneCB.volumeExtend, -g_sceneCB.volumeExtend, -g_sceneCB.volumeExtend), float3(g_sceneCB.volumeExtend, g_sceneCB.volumeExtend, g_sceneCB.volumeExtend)};\0D\0A\09float tEnter, tExit;\0D\0A\0D\0A\09if (DetermineRayAABBIntersection(ray, volumeAABB, tEnter, tExit))\0D\0A\09{\0D\0A\09\09/*int3 voxelDir = sign(ray.direction);\0D\0A\09\09uint3 voxelPos;\0D\0A\09\09float3 hitNormal = -ray.direction;\0D\0A\0D\0A\09\09if (tEnter >= 0)\0D\0A\09\09{\0D\0A\09\09\09voxelPos = WorldSpaceToVoxelSpace(GetPositionAlongRay(ray, tEnter));\0D\0A\09\09}\0D\0A\09\09else\0D\0A\09\09{\0D\0A\09\09\09voxelPos = WorldSpaceToVoxelSpace(ray.origin);\0D\0A\09\09}\0D\0A\0D\0A\09\09tExit = tEnter;\0D\0A\0D\0A\09\09while (IsValidVoxelIndex(voxelPos) && !IsSolid(voxelPos))\0D\0A\09\09{\0D\0A\09\09\09tEnter = tExit;\0D\0A\09\09\09voxelPos = GoToNextVoxel(ray, tEnter, voxelPos, voxelDir, tExit, hitNormal);\0D\0A\09\09}\0D\0A\0D\0A\09\09if (IsValidVoxelIndex(voxelPos) && IsSolid(voxelPos))\0D\0A\09\09{\0D\0A\09\09\09VolumeRaytracer::VPrimitiveAttributes attr;\0D\0A\09\09\09attr.normal = hitNormal;\0D\0A\0D\0A\09\09\09ReportHit(tEnter, 0, attr);\0D\0A\09\09}*/\0D\0A\0D\0A\09\09VolumeRaytracer::VPrimitiveAttributes attr;\0D\0A\09\09attr.normal = float3(0, 1, 0);\0D\0A\0D\0A\09\09ReportHit(tEnter, 0, attr);\0D\0A\09}\0D\0A\09//else\0D\0A\09//{\0D\0A\09//\09VolumeRaytracer::VPrimitiveAttributes attr;\0D\0A\09//\09attr.normal = float3(1, 0, 0);\0D\0A\0D\0A\09//\09ReportHit(RayTCurrent(), 0, attr);\0D\0A\09//}\0D\0A\0D\0A\09//VolumeRaytracer::VPrimitiveAttributes attr;\0D\0A\09//attr.normal = float3(1, 0, 0);\0D\0A\0D\0A\09//ReportHit(RayTCurrent(), 0, attr);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid VRMiss(inout VolumeRaytracer::VRayPayload rayPayload)\0D\0A{\0D\0A\09float3 rayDirection = WorldRayDirection();\0D\0A\09/*float3 worldX = float3(1,0,0);\0D\0A\09float yawCos = dot(rayDirection, worldX);\0D\0A\0D\0A\09rayPayload.color = float4(abs(yawCos), 0, 0, 1);*/\0D\0A\0D\0A\09rayPayload.color = g_envMap.SampleLevel(g_envMapSampler, rayDirection.xzy, 0);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid VRMissShadowRay(inout VolumeRaytracer::VShadowRayPayload rayPayload)\0D\0A{\0D\0A\09rayPayload.hit = false;\0D\0A}"}
!189 = !{!".\5CDX\5CResources\5CShaders\5CRaytracingHlsl.h", !"/*\0D\0A\09Copyright (c) 2020 Thomas Sch\C3\B6ngrundner\0D\0A\0D\0A\09Permission is hereby granted, free of charge, to any person obtaining a copy\0D\0A\09of this software and associated documentation files (the \22Software\22), to deal\0D\0A\09in the Software without restriction, including without limitation the rights\0D\0A\09to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\0D\0A\09copies of the Software, and to permit persons to whom the Software is\0D\0A\09furnished to do so, subject to the following conditions:\0D\0A\0D\0A\09The above copyright notice and this permission notice shall be included in all\0D\0A\09copies or substantial portions of the Software.\0D\0A*/\0D\0A\0D\0A#pragma once\0D\0A\0D\0A#ifdef HLSL\0D\0Atypedef float2 XMFLOAT2;\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A#else\0D\0A\09#include <DirectXMath.h>\0D\0A\09using namespace DirectX;\0D\0A#endif\0D\0A\0D\0A#define MAX_RAY_RECURSION_DEPTH 3\0D\0A\0D\0Anamespace VolumeRaytracer\0D\0A{\0D\0A\09struct VPrimitiveAttributes\0D\0A\09{\0D\0A\09\09XMFLOAT3 normal;\0D\0A\09};\0D\0A\0D\0A\09struct VRayPayload\0D\0A\09{\0D\0A\09\09XMFLOAT4 color;\0D\0A\09\09UINT depth;\0D\0A\09};\0D\0A\0D\0A\09struct VShadowRayPayload\0D\0A\09{\0D\0A\09\09bool hit;\0D\0A\09};\0D\0A\0D\0A\09struct VSceneConstantBuffer\0D\0A\09{\0D\0A\09\09XMMATRIX viewMatrixInverted;\0D\0A\09\09XMMATRIX projectionMatrixInverted;\0D\0A\09\09XMVECTOR cameraPosition;\0D\0A\09\09UINT voxelAxisCount;\0D\0A\09\09float volumeExtend;\0D\0A\09};\0D\0A\0D\0A\09static const XMFLOAT4 BackgroundColor = XMFLOAT4(0.8f, 0.9f, 1.0f, 1.0f);\0D\0A\09static const XMFLOAT3 CubeNormals[] = {\0D\0A\09\09XMFLOAT3(1.0f, 0.0f, 0.0f),\0D\0A\09\09XMFLOAT3(-1.0f, 0.0f, 0.0f),\0D\0A\09\09XMFLOAT3(0.0f, 1.0f, 0.0f),\0D\0A\09\09XMFLOAT3(0.0f, -1.0f, 0.0f),\0D\0A\09\09XMFLOAT3(0.0f, 0.0f, 1.0f),\0D\0A\09\09XMFLOAT3(0.0f, 0.0f, -1.0f)\0D\0A\09};\0D\0A}"}
!190 = !{!"./DX/Resources/Shaders/Raytracing.hlsl"}
!191 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"-Zi", !"-Od", !"-Fo", !"./DX/Resources/Shaders/Compiled/Raytracing.cso", !"-Qembed_debug"}
!192 = !{i32 1, i32 3}
!193 = !{i32 1, i32 5}
!194 = !{!"lib", i32 6, i32 3}
!195 = !{!196, !201, !203, !205}
!196 = !{!197, !199}
!197 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?g_scene@@3URaytracingAccelerationStructure@@A", !"g_scene", i32 0, i32 0, i32 1, i32 16, i32 0, !198}
!198 = !{i32 0, i32 4}
!199 = !{i32 1, %"class.TextureCube<vector<float, 4> >"* @"\01?g_envMap@@3V?$TextureCube@V?$vector@M$03@@@@A", !"g_envMap", i32 0, i32 2, i32 1, i32 5, i32 0, !200}
!200 = !{i32 0, i32 9}
!201 = !{!202}
!202 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?g_renderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"g_renderTarget", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !200}
!203 = !{!204}
!204 = !{i32 0, %g_sceneCB* @g_sceneCB, !"g_sceneCB", i32 0, i32 0, i32 1, i32 152, null}
!205 = !{!206}
!206 = !{i32 0, %struct.SamplerState* @"\01?g_envMapSampler@@3USamplerState@@A", !"g_envMapSampler", i32 0, i32 0, i32 1, i32 0, null}
!207 = !{i32 0, %struct.RaytracingAccelerationStructure undef, !208, %"class.Texture3D<float>" undef, !210, %"class.Texture3D<float>::mips_type" undef, !213, %"class.TextureCube<vector<float, 4> >" undef, !215, %"class.RWTexture2D<vector<float, 4> >" undef, !215, %"struct.VolumeRaytracer::VSceneConstantBuffer" undef, !216, %struct.Ray undef, !223, %struct.RayDesc undef, !226, %"struct.VolumeRaytracer::VRayPayload" undef, !231, %"struct.VolumeRaytracer::VPrimitiveAttributes" undef, !234, %"struct.VolumeRaytracer::VShadowRayPayload" undef, !236, %g_sceneCB undef, !238}
!208 = !{i32 4, !209}
!209 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!210 = !{i32 20, !211, !212}
!211 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!212 = !{i32 6, !"mips", i32 3, i32 16}
!213 = !{i32 4, !214}
!214 = !{i32 6, !"handle", i32 3, i32 0, i32 7, i32 5}
!215 = !{i32 16, !211}
!216 = !{i32 152, !217, !219, !220, !221, !222}
!217 = !{i32 6, !"viewMatrixInverted", i32 2, !218, i32 3, i32 0, i32 7, i32 9}
!218 = !{i32 4, i32 4, i32 2}
!219 = !{i32 6, !"projectionMatrixInverted", i32 2, !218, i32 3, i32 64, i32 7, i32 9}
!220 = !{i32 6, !"cameraPosition", i32 3, i32 128, i32 7, i32 9}
!221 = !{i32 6, !"voxelAxisCount", i32 3, i32 144, i32 7, i32 5}
!222 = !{i32 6, !"volumeExtend", i32 3, i32 148, i32 7, i32 9}
!223 = !{i32 28, !224, !225}
!224 = !{i32 6, !"origin", i32 3, i32 0, i32 7, i32 9}
!225 = !{i32 6, !"direction", i32 3, i32 16, i32 7, i32 9}
!226 = !{i32 32, !227, !228, !229, !230}
!227 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!228 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!229 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!230 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!231 = !{i32 20, !232, !233}
!232 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!233 = !{i32 6, !"depth", i32 3, i32 16, i32 7, i32 5}
!234 = !{i32 12, !235}
!235 = !{i32 6, !"normal", i32 3, i32 0, i32 7, i32 9}
!236 = !{i32 4, !237}
!237 = !{i32 6, !"hit", i32 3, i32 0, i32 7, i32 1}
!238 = !{i32 152, !239}
!239 = !{i32 6, !"g_sceneCB", i32 3, i32 0}
!240 = !{i32 1, void ()* @"\01?VRRaygen@@YAXXZ", !241, void (%"struct.VolumeRaytracer::VRayPayload"*, %"struct.VolumeRaytracer::VPrimitiveAttributes"*)* @"\01?VRClosestHit@@YAXUVRayPayload@VolumeRaytracer@@UVPrimitiveAttributes@2@@Z", !243, void ()* @"\01?VRIntersection@@YAXXZ", !241, void (%"struct.VolumeRaytracer::VRayPayload"*)* @"\01?VRMiss@@YAXUVRayPayload@VolumeRaytracer@@@Z", !246, void (%"struct.VolumeRaytracer::VShadowRayPayload"*)* @"\01?VRMissShadowRay@@YAXUVShadowRayPayload@VolumeRaytracer@@@Z", !246}
!241 = !{!242}
!242 = !{i32 1, !2, !2}
!243 = !{!242, !244, !245}
!244 = !{i32 2, !2, !2}
!245 = !{i32 0, !2, !2}
!246 = !{!242, !244}
!247 = !{null, !"", null, !195, !248}
!248 = !{i32 0, i64 65537}
!249 = !{void (%"struct.VolumeRaytracer::VRayPayload"*, %"struct.VolumeRaytracer::VPrimitiveAttributes"*)* @"\01?VRClosestHit@@YAXUVRayPayload@VolumeRaytracer@@UVPrimitiveAttributes@2@@Z", !"\01?VRClosestHit@@YAXUVRayPayload@VolumeRaytracer@@UVPrimitiveAttributes@2@@Z", null, null, !250}
!250 = !{i32 8, i32 10, i32 6, i32 20, i32 7, i32 12, i32 5, !251}
!251 = !{i32 0}
!252 = !{void ()* @"\01?VRIntersection@@YAXXZ", !"\01?VRIntersection@@YAXXZ", null, null, !253}
!253 = !{i32 8, i32 8, i32 5, !251}
!254 = !{void (%"struct.VolumeRaytracer::VRayPayload"*)* @"\01?VRMiss@@YAXUVRayPayload@VolumeRaytracer@@@Z", !"\01?VRMiss@@YAXUVRayPayload@VolumeRaytracer@@@Z", null, null, !255}
!255 = !{i32 8, i32 11, i32 6, i32 20, i32 5, !251}
!256 = !{void (%"struct.VolumeRaytracer::VShadowRayPayload"*)* @"\01?VRMissShadowRay@@YAXUVShadowRayPayload@VolumeRaytracer@@@Z", !"\01?VRMissShadowRay@@YAXUVShadowRayPayload@VolumeRaytracer@@@Z", null, null, !257}
!257 = !{i32 8, i32 11, i32 6, i32 4, i32 5, !251}
!258 = !{void ()* @"\01?VRRaygen@@YAXXZ", !"\01?VRRaygen@@YAXXZ", null, null, !259}
!259 = !{i32 8, i32 7, i32 5, !251}
!260 = !DILocation(line: 193, column: 124, scope: !77)
!261 = !DILocation(line: 193, column: 94, scope: !77)
!262 = !DILocation(line: 193, column: 30, scope: !77)
!263 = !DILocation(line: 193, column: 12, scope: !77)
!264 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "projInverted", arg: 4, scope: !107, file: !1, line: 34, type: !117)
!265 = !DIExpression(DW_OP_bit_piece, 0, 32)
!266 = !DILocation(line: 34, column: 107, scope: !107, inlinedAt: !267)
!267 = distinct !DILocation(line: 193, column: 12, scope: !77)
!268 = !DIExpression(DW_OP_bit_piece, 32, 32)
!269 = !DIExpression(DW_OP_bit_piece, 64, 32)
!270 = !DIExpression(DW_OP_bit_piece, 128, 32)
!271 = !DIExpression(DW_OP_bit_piece, 160, 32)
!272 = !DIExpression(DW_OP_bit_piece, 192, 32)
!273 = !DIExpression(DW_OP_bit_piece, 256, 32)
!274 = !DIExpression(DW_OP_bit_piece, 288, 32)
!275 = !DIExpression(DW_OP_bit_piece, 320, 32)
!276 = !DIExpression(DW_OP_bit_piece, 384, 32)
!277 = !DIExpression(DW_OP_bit_piece, 416, 32)
!278 = !DIExpression(DW_OP_bit_piece, 448, 32)
!279 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "viewInverted", arg: 3, scope: !107, file: !1, line: 34, type: !117)
!280 = !DILocation(line: 34, column: 81, scope: !107, inlinedAt: !267)
!281 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 1, scope: !107, file: !1, line: 34, type: !110)
!282 = !DILocation(line: 34, column: 36, scope: !107, inlinedAt: !267)
!283 = !DILocation(line: 36, column: 14, scope: !107, inlinedAt: !267)
!284 = !DILocation(line: 36, column: 20, scope: !107, inlinedAt: !267)
!285 = !DILocation(line: 36, column: 9, scope: !107, inlinedAt: !267)
!286 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xy", scope: !107, file: !1, line: 36, type: !287)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 36, baseType: !288)
!288 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 36, size: 64, align: 32, elements: !289, templateParams: !292)
!289 = !{!290, !291}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !288, file: !1, line: 36, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !288, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!292 = !{!13, !116}
!293 = !DILocation(line: 37, column: 26, scope: !107, inlinedAt: !267)
!294 = !DILocation(line: 37, column: 24, scope: !107, inlinedAt: !267)
!295 = !DILocation(line: 37, column: 54, scope: !107, inlinedAt: !267)
!296 = !DILocation(line: 37, column: 60, scope: !107, inlinedAt: !267)
!297 = !DILocation(line: 37, column: 9, scope: !107, inlinedAt: !267)
!298 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "screenPos", scope: !107, file: !1, line: 37, type: !287)
!299 = !DILocation(line: 48, column: 15, scope: !107, inlinedAt: !267)
!300 = !DILocation(line: 48, column: 13, scope: !107, inlinedAt: !267)
!301 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ray", arg: 0, scope: !107, file: !1, line: 46, type: !37)
!302 = !DILocation(line: 46, column: 6, scope: !107, inlinedAt: !267)
!303 = !DILocation(line: 50, column: 56, scope: !107, inlinedAt: !267)
!304 = !DILocation(line: 50, column: 18, scope: !107, inlinedAt: !267)
!305 = !DILocation(line: 50, column: 9, scope: !107, inlinedAt: !267)
!306 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "target", scope: !107, file: !1, line: 50, type: !4)
!307 = !DILocation(line: 51, column: 18, scope: !107, inlinedAt: !267)
!308 = !DILocation(line: 51, column: 16, scope: !107, inlinedAt: !267)
!309 = !DIExpression(DW_OP_bit_piece, 96, 32)
!310 = !DILocation(line: 53, column: 2, scope: !107, inlinedAt: !267)
!311 = !DILocation(line: 195, column: 7, scope: !77)
!312 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currentRecursionDepth", scope: !77, file: !1, line: 195, type: !41)
!313 = !DIExpression()
!314 = !DILocation(line: 196, column: 17, scope: !77)
!315 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ray", arg: 1, scope: !34, file: !1, line: 56, type: !37)
!316 = !DILocation(line: 56, column: 32, scope: !34, inlinedAt: !317)
!317 = distinct !DILocation(line: 196, column: 17, scope: !77)
!318 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currentRayRecursionDepth", arg: 2, scope: !34, file: !1, line: 56, type: !41)
!319 = !DILocation(line: 56, column: 45, scope: !34, inlinedAt: !317)
!320 = !DILocation(line: 58, column: 6, scope: !34, inlinedAt: !317)
!321 = !DILocation(line: 64, column: 10, scope: !34, inlinedAt: !317)
!322 = !DILocation(line: 64, column: 17, scope: !34, inlinedAt: !317)
!323 = !DILocation(line: 65, column: 10, scope: !34, inlinedAt: !317)
!324 = !DILocation(line: 65, column: 20, scope: !34, inlinedAt: !317)
!325 = !DILocation(line: 67, column: 10, scope: !34, inlinedAt: !317)
!326 = !DILocation(line: 67, column: 15, scope: !34, inlinedAt: !317)
!327 = !DILocation(line: 68, column: 10, scope: !34, inlinedAt: !317)
!328 = !DILocation(line: 68, column: 15, scope: !34, inlinedAt: !317)
!329 = !DILocation(line: 70, column: 44, scope: !34, inlinedAt: !317)
!330 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayPayload", scope: !34, file: !1, line: 70, type: !84)
!331 = !DIExpression(DW_OP_bit_piece, 0, 128)
!332 = !DILocation(line: 70, column: 31, scope: !34, inlinedAt: !317)
!333 = !DILocation(line: 70, column: 88, scope: !34, inlinedAt: !317)
!334 = !DILocation(line: 72, column: 2, scope: !34, inlinedAt: !317)
!335 = !DILocation(line: 74, column: 2, scope: !34, inlinedAt: !317)
!336 = !DILocation(line: 75, column: 1, scope: !34, inlinedAt: !317)
!337 = !DILocation(line: 196, column: 9, scope: !77)
!338 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "color", scope: !77, file: !1, line: 196, type: !4)
!339 = !DILocation(line: 198, column: 17, scope: !77)
!340 = !DILocation(line: 198, column: 2, scope: !77)
!341 = !DILocation(line: 198, column: 41, scope: !77)
!342 = !DILocation(line: 199, column: 1, scope: !77)
!343 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayDesc", scope: !34, file: !1, line: 63, type: !344)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 63, size: 256, align: 32, elements: !345)
!345 = !{!346, !347, !348, !349}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !344, file: !1, line: 63, baseType: !27, size: 96, align: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !344, file: !1, line: 63, baseType: !8, size: 32, align: 32, offset: 96)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !344, file: !1, line: 63, baseType: !27, size: 96, align: 32, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !344, file: !1, line: 63, baseType: !8, size: 32, align: 32, offset: 224)
!350 = !DILocation(line: 63, column: 10, scope: !34, inlinedAt: !317)
!351 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !80, file: !1, line: 202, type: !92)
!352 = !DILocation(line: 202, column: 107, scope: !80)
!353 = !DILocation(line: 204, column: 38, scope: !80)
!354 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rayPayload", arg: 1, scope: !80, file: !1, line: 202, type: !84)
!355 = !DILocation(line: 202, column: 54, scope: !80)
!356 = !DILocation(line: 204, column: 45, scope: !80)
!357 = !DILocation(line: 204, column: 50, scope: !80)
!358 = !DILocation(line: 204, column: 28, scope: !80)
!359 = !DILocation(line: 204, column: 19, scope: !80)
!360 = !DILocation(line: 205, column: 1, scope: !80)
!361 = !DILocation(line: 212, column: 15, scope: !96)
!362 = !DILocation(line: 212, column: 13, scope: !96)
!363 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !96, file: !1, line: 210, type: !37)
!364 = !DILocation(line: 210, column: 6, scope: !96)
!365 = !DILocation(line: 213, column: 18, scope: !96)
!366 = !DILocation(line: 213, column: 16, scope: !96)
!367 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volumeAABB", scope: !96, file: !1, line: 216, type: !46)
!368 = !DILocation(line: 216, column: 9, scope: !96)
!369 = !{i32 0, i32 96, i32 2}
!370 = !{i32 32, i32 96, i32 2}
!371 = !{i32 64, i32 96, i32 2}
!372 = !DILocation(line: 216, column: 25, scope: !96)
!373 = !DILocation(line: 216, column: 44, scope: !96)
!374 = !DILocation(line: 216, column: 33, scope: !96)
!375 = !DILocation(line: 216, column: 69, scope: !96)
!376 = !DILocation(line: 216, column: 58, scope: !96)
!377 = !DILocation(line: 216, column: 94, scope: !96)
!378 = !DILocation(line: 216, column: 83, scope: !96)
!379 = !DILocation(line: 216, column: 126, scope: !96)
!380 = !DILocation(line: 216, column: 150, scope: !96)
!381 = !DILocation(line: 216, column: 174, scope: !96)
!382 = !DILocation(line: 219, column: 6, scope: !383)
!383 = distinct !DILexicalBlock(scope: !96, file: !1, line: 219, column: 6)
!384 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ray", arg: 1, scope: !42, file: !1, line: 77, type: !37)
!385 = !DILocation(line: 77, column: 42, scope: !42, inlinedAt: !386)
!386 = distinct !DILocation(line: 219, column: 6, scope: !383)
!387 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aabb", arg: 2, scope: !42, file: !1, line: 77, type: !46)
!388 = !DILocation(line: 77, column: 57, scope: !42, inlinedAt: !386)
!389 = !DILocation(line: 80, column: 29, scope: !42, inlinedAt: !386)
!390 = !DILocation(line: 80, column: 15, scope: !42, inlinedAt: !386)
!391 = !DILocation(line: 80, column: 7, scope: !42, inlinedAt: !386)
!392 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign3", scope: !42, file: !1, line: 80, type: !60)
!393 = !DILocation(line: 83, column: 41, scope: !42, inlinedAt: !386)
!394 = !DILocation(line: 84, column: 7, scope: !42, inlinedAt: !386)
!395 = !DILocation(line: 85, column: 20, scope: !42, inlinedAt: !386)
!396 = !DILocation(line: 85, column: 5, scope: !42, inlinedAt: !386)
!397 = !DILocation(line: 83, column: 27, scope: !42, inlinedAt: !386)
!398 = !DILocation(line: 83, column: 9, scope: !42, inlinedAt: !386)
!399 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "invRayDirection", scope: !42, file: !1, line: 83, type: !26)
!400 = !DILocation(line: 87, column: 20, scope: !42, inlinedAt: !386)
!401 = !DILocation(line: 87, column: 13, scope: !42, inlinedAt: !386)
!402 = !DILocation(line: 87, column: 33, scope: !42, inlinedAt: !386)
!403 = !DILocation(line: 87, column: 49, scope: !42, inlinedAt: !386)
!404 = !DILocation(line: 87, column: 10, scope: !42, inlinedAt: !386)
!405 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmin3", scope: !42, file: !1, line: 79, type: !26)
!406 = !DILocation(line: 79, column: 9, scope: !42, inlinedAt: !386)
