#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: 8402abe7a5920b65897c6c0e531ee3d9.pdb
; shader hash: 8402abe7a5920b65897c6c0e531ee3d9
;
; Buffer Definitions:
;
; cbuffer g_sceneCB
; {
;
;   struct g_sceneCB
;   {
;
;       struct struct.VolumeRaytracer::VSceneConstantBuffer
;       {
;
;           column_major float4x4 viewMatrixInverted; ; Offset:    0
;           column_major float4x4 projectionMatrixInverted;; Offset:   64
;           float4 cameraPosition;                    ; Offset:  128
;           uint voxelAxisCount;                      ; Offset:  144
;           float volumeExtend;                       ; Offset:  148
;           float distanceBtwVoxels;                  ; Offset:  152
;       
;       } g_sceneCB;                                  ; Offset:    0
;
;   
;   } g_sceneCB;                                      ; Offset:    0 Size:   156
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; g_sceneCB                         cbuffer      NA          NA     CB0            cb0     1
; g_envMapSampler                   sampler      NA          NA      S0             s0     1
; g_scene                           texture     i32         ras      T0             t0     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !32, globals: !173)
!1 = !DIFile(filename: "./DX/Resources/Shaders\5C./DX/Resources/Shaders/Raytracing.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16, !25}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 80, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 80, size: 96, align: 32, elements: !18, templateParams: !22)
!18 = !{!19, !20, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 80, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 80, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, line: 80, baseType: !15, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!23, !24}
!23 = !DITemplateTypeParameter(name: "element", type: !15)
!24 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !27, templateParams: !31)
!27 = !{!28, !29, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !26, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!13, !24}
!32 = !{!33, !43, !52, !55, !58, !61, !62, !65, !66, !69, !82, !85, !86, !87, !88, !91, !94, !97, !98, !101, !117, !118, !121, !128, !131, !132, !133, !134, !135, !136, !137, !138, !141}
!33 = !DISubprogram(name: "TraceRadianceRay", linkageName: "\01?TraceRadianceRay@@YA?AV?$vector@M$03@@URay@@I@Z", scope: !34, file: !34, line: 56, type: !35, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false)
!34 = !DIFile(filename: "./DX/Resources/Shaders/Raytracing.hlsl", directory: "")
!35 = !DISubroutineType(types: !36)
!36 = !{!4, !37, !41}
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray", file: !34, line: 28, size: 192, align: 32, elements: !38)
!38 = !{!39, !40}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !37, file: !34, line: 30, baseType: !25, size: 96, align: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !37, file: !34, line: 31, baseType: !25, size: 96, align: 32, offset: 96)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !42)
!42 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!43 = !DISubprogram(name: "DetermineRayAABBIntersection", linkageName: "\01?DetermineRayAABBIntersection@@YA_NURay@@Y01V?$vector@M$02@@AIAM2@Z", scope: !34, file: !34, line: 77, type: !44, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: false)
!44 = !DISubroutineType(types: !45)
!45 = !{!46, !37, !47, !50, !50}
!46 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 192, align: 32, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 2)
!50 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !8)
!52 = !DISubprogram(name: "WorldSpaceToVoxelSpace", linkageName: "\01?WorldSpaceToVoxelSpace@@YA?AV?$vector@H$02@@V?$vector@M$02@@@Z", scope: !34, file: !34, line: 102, type: !53, isLocal: false, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: false)
!53 = !DISubroutineType(types: !54)
!54 = !{!16, !25}
!55 = !DISubprogram(name: "VoxelIndexToWorldSpace", linkageName: "\01?VoxelIndexToWorldSpace@@YA?AV?$vector@M$02@@V?$vector@H$02@@@Z", scope: !34, file: !34, line: 111, type: !56, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: false)
!56 = !DISubroutineType(types: !57)
!57 = !{!25, !16}
!58 = !DISubprogram(name: "WorldSpaceToBottomLevelCellSpace", linkageName: "\01?WorldSpaceToBottomLevelCellSpace@@YA?AV?$vector@M$02@@V?$vector@H$02@@V1@@Z", scope: !34, file: !34, line: 128, type: !59, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: false)
!59 = !DISubroutineType(types: !60)
!60 = !{!25, !16, !25}
!61 = !DISubprogram(name: "WorldSpaceToTopLevelCellSpace", linkageName: "\01?WorldSpaceToTopLevelCellSpace@@YA?AV?$vector@M$02@@V?$vector@H$02@@V1@@Z", scope: !34, file: !34, line: 139, type: !59, isLocal: false, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: false)
!62 = !DISubprogram(name: "WorldDirectionToBottomLevelCellSpace", linkageName: "\01?WorldDirectionToBottomLevelCellSpace@@YA?AV?$vector@M$02@@V1@@Z", scope: !34, file: !34, line: 150, type: !63, isLocal: false, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: false)
!63 = !DISubroutineType(types: !64)
!64 = !{!25, !25}
!65 = !DISubprogram(name: "WorldDirectionToTopLevelCellSpace", linkageName: "\01?WorldDirectionToTopLevelCellSpace@@YA?AV?$vector@M$02@@V1@@Z", scope: !34, file: !34, line: 155, type: !63, isLocal: false, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped, isOptimized: false)
!66 = !DISubprogram(name: "IsValidCell", linkageName: "\01?IsValidCell@@YA_NV?$vector@H$02@@@Z", scope: !34, file: !34, line: 160, type: !67, isLocal: false, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: false)
!67 = !DISubroutineType(types: !68)
!68 = !{!46, !16}
!69 = !DISubprogram(name: "GoToNextVoxel", linkageName: "\01?GoToNextVoxel@@YA?AV?$vector@H$02@@URay@@V?$vector@I$02@@V1@AIAMAIAV?$vector@M$02@@@Z", scope: !34, file: !34, line: 170, type: !70, isLocal: false, isDefinition: true, scopeLine: 171, flags: DIFlagPrototyped, isOptimized: false)
!70 = !DISubroutineType(types: !71)
!71 = !{!16, !37, !72, !16, !50, !80}
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 168, baseType: !73)
!73 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 168, size: 96, align: 32, elements: !74, templateParams: !78)
!74 = !{!75, !76, !77}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !73, file: !1, line: 168, baseType: !42, size: 32, align: 32, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !73, file: !1, line: 168, baseType: !42, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !73, file: !1, line: 168, baseType: !42, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!78 = !{!79, !24}
!79 = !DITemplateTypeParameter(name: "element", type: !42)
!80 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !25)
!82 = !DISubprogram(name: "GetPositionAlongRay", linkageName: "\01?GetPositionAlongRay@@YA?AV?$vector@M$02@@URay@@M@Z", scope: !34, file: !34, line: 228, type: !83, isLocal: false, isDefinition: true, scopeLine: 229, flags: DIFlagPrototyped, isOptimized: false)
!83 = !DISubroutineType(types: !84)
!84 = !{!25, !37, !8}
!85 = !DISubprogram(name: "IsValidVoxelIndex", linkageName: "\01?IsValidVoxelIndex@@YA_NV?$vector@H$02@@@Z", scope: !34, file: !34, line: 233, type: !67, isLocal: false, isDefinition: true, scopeLine: 234, flags: DIFlagPrototyped, isOptimized: false)
!86 = !DISubprogram(name: "IsSolid", linkageName: "\01?IsSolid@@YA_NV?$vector@H$02@@@Z", scope: !34, file: !34, line: 238, type: !67, isLocal: false, isDefinition: true, scopeLine: 239, flags: DIFlagPrototyped, isOptimized: false)
!87 = !DISubprogram(name: "HasIsoSurfaceInsideCell", linkageName: "\01?HasIsoSurfaceInsideCell@@YA_NV?$vector@H$02@@@Z", scope: !34, file: !34, line: 283, type: !67, isLocal: false, isDefinition: true, scopeLine: 284, flags: DIFlagPrototyped, isOptimized: false)
!88 = !DISubprogram(name: "GetDensityPolynomial", linkageName: "\01?GetDensityPolynomial@@YAXURay@@V?$vector@H$02@@MMAIAM222@Z", scope: !34, file: !34, line: 319, type: !89, isLocal: false, isDefinition: true, scopeLine: 320, flags: DIFlagPrototyped, isOptimized: false)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !37, !16, !8, !8, !50, !50, !50, !50}
!91 = !DISubprogram(name: "GetDensity", linkageName: "\01?GetDensity@@YAMV?$vector@H$02@@V?$vector@M$02@@@Z", scope: !34, file: !34, line: 377, type: !92, isLocal: false, isDefinition: true, scopeLine: 378, flags: DIFlagPrototyped, isOptimized: false)
!92 = !DISubroutineType(types: !93)
!93 = !{!8, !16, !25}
!94 = !DISubprogram(name: "GetSurfaceIntersectionT", linkageName: "\01?GetSurfaceIntersectionT@@YA_NURay@@V?$vector@H$02@@MMAIAM@Z", scope: !34, file: !34, line: 405, type: !95, isLocal: false, isDefinition: true, scopeLine: 406, flags: DIFlagPrototyped, isOptimized: false)
!95 = !DISubroutineType(types: !96)
!96 = !{!46, !37, !16, !8, !8, !50}
!97 = !DISubprogram(name: "GetNormal", linkageName: "\01?GetNormal@@YA?AV?$vector@M$02@@V?$vector@H$02@@V1@@Z", scope: !34, file: !34, line: 507, type: !59, isLocal: false, isDefinition: true, scopeLine: 508, flags: DIFlagPrototyped, isOptimized: false)
!98 = !DISubprogram(name: "VRRaygen", linkageName: "\01?VRRaygen@@YAXXZ", scope: !34, file: !34, line: 543, type: !99, isLocal: false, isDefinition: true, scopeLine: 544, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?VRRaygen@@YAXXZ")
!99 = !DISubroutineType(types: !100)
!100 = !{null}
!101 = !DISubprogram(name: "VRClosestHit", linkageName: "\01?VRClosestHit@@YAXUVRayPayload@VolumeRaytracer@@UVPrimitiveAttributes@2@@Z", scope: !34, file: !34, line: 554, type: !102, isLocal: false, isDefinition: true, scopeLine: 555, flags: DIFlagPrototyped, isOptimized: false, function: void (%"struct.VolumeRaytracer::VRayPayload"*, %"struct.VolumeRaytracer::VPrimitiveAttributes"*)* @"\01?VRClosestHit@@YAXUVRayPayload@VolumeRaytracer@@UVPrimitiveAttributes@2@@Z")
!102 = !DISubroutineType(types: !103)
!103 = !{null, !104, !113}
!104 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !105)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "VRayPayload", scope: !107, file: !106, line: 39, size: 160, align: 32, elements: !108)
!106 = !DIFile(filename: "./DX/Resources/Shaders/RaytracingHlsl.h", directory: "")
!107 = !DINamespace(name: "VolumeRaytracer", scope: null, file: !106, line: 32)
!108 = !{!109, !111}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !105, file: !106, line: 41, baseType: !110, size: 128, align: 32)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !106, line: 20, baseType: !4)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !105, file: !106, line: 42, baseType: !112, size: 32, align: 32, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !106, line: 24, baseType: !41)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "VPrimitiveAttributes", scope: !107, file: !106, line: 34, size: 96, align: 32, elements: !114)
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !113, file: !106, line: 36, baseType: !116, size: 96, align: 32)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !106, line: 19, baseType: !25)
!117 = !DISubprogram(name: "VRIntersection", linkageName: "\01?VRIntersection@@YAXXZ", scope: !34, file: !34, line: 561, type: !99, isLocal: false, isDefinition: true, scopeLine: 562, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?VRIntersection@@YAXXZ")
!118 = !DISubprogram(name: "VRMiss", linkageName: "\01?VRMiss@@YAXUVRayPayload@VolumeRaytracer@@@Z", scope: !34, file: !34, line: 632, type: !119, isLocal: false, isDefinition: true, scopeLine: 633, flags: DIFlagPrototyped, isOptimized: false, function: void (%"struct.VolumeRaytracer::VRayPayload"*)* @"\01?VRMiss@@YAXUVRayPayload@VolumeRaytracer@@@Z")
!119 = !DISubroutineType(types: !120)
!120 = !{null, !104}
!121 = !DISubprogram(name: "VRMissShadowRay", linkageName: "\01?VRMissShadowRay@@YAXUVShadowRayPayload@VolumeRaytracer@@@Z", scope: !34, file: !34, line: 639, type: !122, isLocal: false, isDefinition: true, scopeLine: 640, flags: DIFlagPrototyped, isOptimized: false, function: void (%"struct.VolumeRaytracer::VShadowRayPayload"*)* @"\01?VRMissShadowRay@@YAXUVShadowRayPayload@VolumeRaytracer@@@Z")
!122 = !DISubroutineType(types: !123)
!123 = !{null, !124}
!124 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !125)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "VShadowRayPayload", scope: !107, file: !106, line: 45, size: 32, align: 32, elements: !126)
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !125, file: !106, line: 47, baseType: !46, size: 32, align: 32)
!128 = !DISubprogram(name: "GetCellVoxel1", linkageName: "\01?GetCellVoxel1@@YAMV?$vector@H$02@@@Z", scope: !34, file: !34, line: 243, type: !129, isLocal: false, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: false)
!129 = !DISubroutineType(types: !130)
!130 = !{!8, !16}
!131 = !DISubprogram(name: "GetCellVoxel2", linkageName: "\01?GetCellVoxel2@@YAMV?$vector@H$02@@@Z", scope: !34, file: !34, line: 248, type: !129, isLocal: false, isDefinition: true, scopeLine: 249, flags: DIFlagPrototyped, isOptimized: false)
!132 = !DISubprogram(name: "GetCellVoxel3", linkageName: "\01?GetCellVoxel3@@YAMV?$vector@H$02@@@Z", scope: !34, file: !34, line: 253, type: !129, isLocal: false, isDefinition: true, scopeLine: 254, flags: DIFlagPrototyped, isOptimized: false)
!133 = !DISubprogram(name: "GetCellVoxel4", linkageName: "\01?GetCellVoxel4@@YAMV?$vector@H$02@@@Z", scope: !34, file: !34, line: 258, type: !129, isLocal: false, isDefinition: true, scopeLine: 259, flags: DIFlagPrototyped, isOptimized: false)
!134 = !DISubprogram(name: "GetCellVoxel5", linkageName: "\01?GetCellVoxel5@@YAMV?$vector@H$02@@@Z", scope: !34, file: !34, line: 263, type: !129, isLocal: false, isDefinition: true, scopeLine: 264, flags: DIFlagPrototyped, isOptimized: false)
!135 = !DISubprogram(name: "GetCellVoxel6", linkageName: "\01?GetCellVoxel6@@YAMV?$vector@H$02@@@Z", scope: !34, file: !34, line: 268, type: !129, isLocal: false, isDefinition: true, scopeLine: 269, flags: DIFlagPrototyped, isOptimized: false)
!136 = !DISubprogram(name: "GetCellVoxel7", linkageName: "\01?GetCellVoxel7@@YAMV?$vector@H$02@@@Z", scope: !34, file: !34, line: 273, type: !129, isLocal: false, isDefinition: true, scopeLine: 274, flags: DIFlagPrototyped, isOptimized: false)
!137 = !DISubprogram(name: "GetCellVoxel8", linkageName: "\01?GetCellVoxel8@@YAMV?$vector@H$02@@@Z", scope: !34, file: !34, line: 278, type: !129, isLocal: false, isDefinition: true, scopeLine: 279, flags: DIFlagPrototyped, isOptimized: false)
!138 = !DISubprogram(name: "GetDensityWithPolynomial", linkageName: "\01?GetDensityWithPolynomial@@YAMMMMMM@Z", scope: !34, file: !34, line: 400, type: !139, isLocal: false, isDefinition: true, scopeLine: 401, flags: DIFlagPrototyped, isOptimized: false)
!139 = !DISubroutineType(types: !140)
!140 = !{!8, !8, !8, !8, !8, !8}
!141 = !DISubprogram(name: "GenerateCameraRay", linkageName: "\01?GenerateCameraRay@@YA?AURay@@V?$vector@I$01@@V?$vector@M$02@@V?$matrix@M$03$03@@2@Z", scope: !34, file: !34, line: 34, type: !142, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!142 = !DISubroutineType(types: !143)
!143 = !{!37, !144, !25, !151, !151}
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 403, baseType: !145)
!145 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 403, size: 64, align: 32, elements: !146, templateParams: !149)
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !145, file: !1, line: 403, baseType: !42, size: 32, align: 32, flags: DIFlagPublic)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !145, file: !1, line: 403, baseType: !42, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!149 = !{!79, !150}
!150 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 403, baseType: !152)
!152 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 403, size: 512, align: 32, elements: !153, templateParams: !170)
!153 = !{!154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !152, file: !1, line: 403, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !152, file: !1, line: 403, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !152, file: !1, line: 403, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !152, file: !1, line: 403, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !152, file: !1, line: 403, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !152, file: !1, line: 403, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !152, file: !1, line: 403, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !152, file: !1, line: 403, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !152, file: !1, line: 403, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !152, file: !1, line: 403, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !152, file: !1, line: 403, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !152, file: !1, line: 403, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !152, file: !1, line: 403, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !152, file: !1, line: 403, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !152, file: !1, line: 403, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !152, file: !1, line: 403, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!170 = !{!13, !171, !172}
!171 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!172 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!173 = !{!174, !176, !178, !179, !181, !186, !188, !191, !195, !197, !199, !201, !203, !205, !207, !209, !211}
!174 = !DIGlobalVariable(name: "RAY_FLAG_CULL_BACK_FACING_TRIANGLES", scope: !0, file: !1, line: 72, type: !175, isLocal: true, isDefinition: true, variable: i32 16)
!175 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!176 = !DIGlobalVariable(name: "FLT_INFINITY", scope: !43, file: !34, line: 82, type: !177, isLocal: true, isDefinition: true)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!178 = !DIGlobalVariable(name: "FLT_INFINITY", scope: !69, file: !34, line: 174, type: !177, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariable(name: "BackgroundColor", linkageName: "\01?BackgroundColor@VolumeRaytracer@@3V?$vector@M$03@@B", scope: !107, file: !106, line: 60, type: !180, isLocal: true, isDefinition: true)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!181 = !DIGlobalVariable(name: "CubeNormals", linkageName: "\01?CubeNormals@VolumeRaytracer@@3QBV?$vector@M$02@@B", scope: !107, file: !106, line: 61, type: !182, isLocal: true, isDefinition: true)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 576, align: 32, elements: !184)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!184 = !{!185}
!185 = !DISubrange(count: 6)
!186 = !DIGlobalVariable(name: "g_scene", linkageName: "\01?g_scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !34, line: 19, type: !187, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?g_scene@@3URaytracingAccelerationStructure@@A")
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 19, size: 32, align: 32, elements: !2)
!188 = !DIGlobalVariable(name: "g_voxelVolume", linkageName: "\01?g_voxelVolume@@3V?$Texture3D@M@@A", scope: !0, file: !34, line: 20, type: !189, isLocal: false, isDefinition: true, variable: %"class.Texture3D<float>"* @"\01?g_voxelVolume@@3V?$Texture3D@M@@A")
!189 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture3D<float>", file: !1, line: 20, size: 64, align: 32, elements: !2, templateParams: !190)
!190 = !{!13}
!191 = !DIGlobalVariable(name: "g_envMap", linkageName: "\01?g_envMap@@3V?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !34, line: 22, type: !192, isLocal: false, isDefinition: true, variable: %"class.TextureCube<vector<float, 4> >"* @"\01?g_envMap@@3V?$TextureCube@V?$vector@M$03@@@@A")
!192 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 22, size: 128, align: 32, elements: !2, templateParams: !193)
!193 = !{!194}
!194 = !DITemplateTypeParameter(name: "element", type: !5)
!195 = !DIGlobalVariable(name: "g_envMapSampler", linkageName: "\01?g_envMapSampler@@3USamplerState@@A", scope: !0, file: !34, line: 23, type: !196, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?g_envMapSampler@@3USamplerState@@A")
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 23, size: 32, align: 32, elements: !2)
!197 = !DIGlobalVariable(name: "g_renderTarget", linkageName: "\01?g_renderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !34, line: 25, type: !198, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?g_renderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!198 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 25, size: 128, align: 32, elements: !2, templateParams: !193)
!199 = !DIGlobalVariable(name: "BackgroundColor.0", linkageName: "\01?BackgroundColor@VolumeRaytracer@@3V?$vector@M$03@@B.0", scope: !107, file: !106, line: 60, type: !200, isLocal: false, isDefinition: true)
!200 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !180, size: 32, align: 4)
!201 = !DIGlobalVariable(name: "BackgroundColor.1", linkageName: "\01?BackgroundColor@VolumeRaytracer@@3V?$vector@M$03@@B.1", scope: !107, file: !106, line: 60, type: !202, isLocal: false, isDefinition: true)
!202 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !180, size: 32, align: 4, offset: 32)
!203 = !DIGlobalVariable(name: "BackgroundColor.2", linkageName: "\01?BackgroundColor@VolumeRaytracer@@3V?$vector@M$03@@B.2", scope: !107, file: !106, line: 60, type: !204, isLocal: false, isDefinition: true)
!204 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !180, size: 32, align: 4, offset: 64)
!205 = !DIGlobalVariable(name: "BackgroundColor.3", linkageName: "\01?BackgroundColor@VolumeRaytracer@@3V?$vector@M$03@@B.3", scope: !107, file: !106, line: 60, type: !206, isLocal: false, isDefinition: true)
!206 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !180, size: 32, align: 4, offset: 96)
!207 = !DIGlobalVariable(name: "CubeNormals.0", linkageName: "\01?CubeNormals@VolumeRaytracer@@3QBV?$vector@M$02@@B.0", scope: !107, file: !106, line: 61, type: !208, isLocal: false, isDefinition: true)
!208 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !182, size: 192, align: 4)
!209 = !DIGlobalVariable(name: "CubeNormals.1", linkageName: "\01?CubeNormals@VolumeRaytracer@@3QBV?$vector@M$02@@B.1", scope: !107, file: !106, line: 61, type: !210, isLocal: false, isDefinition: true)
!210 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !182, size: 192, align: 4, offset: 192)
!211 = !DIGlobalVariable(name: "CubeNormals.2", linkageName: "\01?CubeNormals@VolumeRaytracer@@3QBV?$vector@M$02@@B.2", scope: !107, file: !106, line: 61, type: !212, isLocal: false, isDefinition: true)
!212 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !182, size: 192, align: 4, offset: 384)
!213 = !{i32 2, !"Dwarf Version", i32 4}
!214 = !{i32 2, !"Debug Info Version", i32 3}
!215 = !{!"dxc 1.2"}
!216 = !{!"./DX/Resources/Shaders/Raytracing.hlsl", !"/*\0D\0A\09Copyright (c) 2020 Thomas Sch\C3\B6ngrundner\0D\0A\0D\0A\09Permission is hereby granted, free of charge, to any person obtaining a copy\0D\0A\09of this software and associated documentation files (the \22Software\22), to deal\0D\0A\09in the Software without restriction, including without limitation the rights\0D\0A\09to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\0D\0A\09copies of the Software, and to permit persons to whom the Software is\0D\0A\09furnished to do so, subject to the following conditions:\0D\0A\0D\0A\09The above copyright notice and this permission notice shall be included in all\0D\0A\09copies or substantial portions of the Software.\0D\0A*/\0D\0A\0D\0A#define HLSL\0D\0A\0D\0A#include \22RaytracingHlsl.h\22\0D\0A\0D\0ARaytracingAccelerationStructure g_scene : register(t0, space0);\0D\0ATexture3D<float> g_voxelVolume : register(t2, space0);\0D\0A\0D\0ATextureCube g_envMap : register(t1, space0);\0D\0ASamplerState g_envMapSampler : register(s0);\0D\0A\0D\0ARWTexture2D<float4> g_renderTarget : register(u0);\0D\0AConstantBuffer<VolumeRaytracer::VSceneConstantBuffer> g_sceneCB : register(b0);\0D\0A\0D\0Astruct Ray\0D\0A{\0D\0A\09float3 origin;\0D\0A\09float3 direction;\0D\0A};\0D\0A\0D\0Ainline Ray GenerateCameraRay(uint2 index, in float3 cameraPosition, in float4x4 viewInverted, in float4x4 projInverted)\0D\0A{\0D\0A\09float2 xy = index + 0.5f; // center in the middle of the pixel.\0D\0A\09float2 screenPos = xy / DispatchRaysDimensions().xy * 2.0 - 1.0;\0D\0A\0D\0A\09// Invert Y for DirectX-style coordinates.\0D\0A\09//screenPos.y = -screenPos.y;\0D\0A\0D\0A\09// Unproject the pixel coordinate into a world positon.\0D\0A\09//float4 world = mul(float4(screenPos, 0, 1), projectionToWorld);\0D\0A\09//world.xyz /= world.w;\0D\0A\0D\0A\09Ray ray;\0D\0A\09//ray.origin = cameraPosition;\0D\0A\09ray.origin = mul(viewInverted, float4(0,0,0,1)).xyz;\0D\0A\0D\0A\09float4 target = mul(projInverted, float4(screenPos.x, -screenPos.y, 1, 1));\0D\0A\09ray.direction = mul(viewInverted, float4(target.xyz, 0)).xyz;\0D\0A\0D\0A\09return ray;\0D\0A}\0D\0A\0D\0Afloat4 TraceRadianceRay(in Ray ray, in uint currentRayRecursionDepth)\0D\0A{\0D\0A\09if (currentRayRecursionDepth >= MAX_RAY_RECURSION_DEPTH)\0D\0A\09{\0D\0A\09\09return float4(0,0,0,0);\0D\0A\09}\0D\0A\0D\0A\09RayDesc rayDesc;\0D\0A\09rayDesc.Origin = ray.origin;\0D\0A\09rayDesc.Direction = ray.direction;\0D\0A\0D\0A\09rayDesc.TMin = 0;\0D\0A\09rayDesc.TMax = 600;\0D\0A\0D\0A\09VolumeRaytracer::VRayPayload rayPayload = { float4(0,0,0,0), currentRayRecursionDepth + 1 };\0D\0A\0D\0A\09TraceRay(g_scene, RAY_FLAG_CULL_BACK_FACING_TRIANGLES, 0xff, 0, 2, 0, rayDesc, rayPayload);\0D\0A\0D\0A\09return rayPayload.color;\0D\0A}\0D\0A\0D\0Abool DetermineRayAABBIntersection(in Ray ray, in float3 aabb[2], out float tEnter, out float tExit)\0D\0A{\0D\0A\09float3 tmin3, tmax3;\0D\0A\09int3 sign3 = ray.direction > 0;\0D\0A\0D\0A\09const float FLT_INFINITY = 1.#INF;\0D\0A\09float3 invRayDirection = ray.direction != 0\0D\0A\09\09? 1 / ray.direction\0D\0A\09\09: (ray.direction > 0) ? FLT_INFINITY : -FLT_INFINITY;\0D\0A\0D\0A\09tmin3.x = (aabb[1 - sign3.x].x - ray.origin.x) * invRayDirection.x;\0D\0A\09tmax3.x = (aabb[sign3.x].x - ray.origin.x) * invRayDirection.x;\0D\0A\0D\0A\09tmin3.y = (aabb[1 - sign3.y].y - ray.origin.y) * invRayDirection.y;\0D\0A\09tmax3.y = (aabb[sign3.y].y - ray.origin.y) * invRayDirection.y;\0D\0A\0D\0A\09tmin3.z = (aabb[1 - sign3.z].z - ray.origin.z) * invRayDirection.z;\0D\0A\09tmax3.z = (aabb[sign3.z].z - ray.origin.z) * invRayDirection.z;\0D\0A\0D\0A\09tEnter = max(max(tmin3.x, tmin3.y), tmin3.z);\0D\0A\09tExit = min(min(tmax3.x, tmax3.y), tmax3.z);\0D\0A\0D\0A\09return tExit > tEnter && tExit >= RayTMin() && tEnter <= RayTCurrent();\0D\0A}\0D\0A\0D\0Aint3 WorldSpaceToVoxelSpace(in float3 worldLocation)\0D\0A{\0D\0A\09float3 volumeOrigin = -g_sceneCB.volumeExtend;\0D\0A\09float3 relativeVolumePos = worldLocation - volumeOrigin;\0D\0A\09float distanceBetweenVoxel = g_sceneCB.distanceBtwVoxels;\0D\0A\0D\0A\09return int3(floor(relativeVolumePos.x / distanceBetweenVoxel), floor(relativeVolumePos.y / distanceBetweenVoxel), floor(relativeVolumePos.z / distanceBetweenVoxel));\0D\0A}\0D\0A\0D\0Afloat3 VoxelIndexToWorldSpace(in int3 voxelIndex)\0D\0A{\0D\0A\09float distanceBetweenVoxel = g_sceneCB.distanceBtwVoxels;\0D\0A\09float3 voxelIndexF = voxelIndex;\0D\0A\09float3 volumeOrigin = -g_sceneCB.volumeExtend;\0D\0A\0D\0A\09return voxelIndexF * distanceBetweenVoxel + volumeOrigin;\0D\0A}\0D\0A\0D\0Ainline float3 WorldSpaceToCellSpace(in int3 cellOriginPos, in float3 worldLocation)\0D\0A{\0D\0A\09float3 voxelOriginPos = VoxelIndexToWorldSpace(cellOriginPos);\0D\0A\09float3 rel = worldLocation - voxelOriginPos;\0D\0A\0D\0A\09return rel / g_sceneCB.distanceBtwVoxels;\0D\0A}\0D\0A\0D\0Afloat3 WorldSpaceToBottomLevelCellSpace(in int3 cellOrigin, in float3 worldSpace)\0D\0A{\0D\0A\09/*float3 voxelPos = VoxelIndexToWorldSpace(cellOrigin + int3(1,1,1));\0D\0A\0D\0A\09return (voxelPos - worldSpace) / g_sceneCB.distanceBtwVoxels;*/\0D\0A\0D\0A\09float3 voxelPos = VoxelIndexToWorldSpace(cellOrigin);\0D\0A\0D\0A\09return (worldSpace - voxelPos) / g_sceneCB.distanceBtwVoxels;\0D\0A}\0D\0A\0D\0Afloat3 WorldSpaceToTopLevelCellSpace(in int3 cellOrigin, in float3 worldSpace)\0D\0A{\0D\0A\09/*float3 voxelPos = VoxelIndexToWorldSpace(cellOrigin);\0D\0A\0D\0A\09return (worldSpace - voxelPos) / g_sceneCB.distanceBtwVoxels;*/\0D\0A\0D\0A\09float3 voxelPos = VoxelIndexToWorldSpace(cellOrigin + int3(1, 1, 1));\0D\0A\0D\0A\09return abs(worldSpace - voxelPos) / g_sceneCB.distanceBtwVoxels;\0D\0A}\0D\0A\0D\0Afloat3 WorldDirectionToBottomLevelCellSpace(in float3 worldDirection)\0D\0A{\0D\0A\09return worldDirection / g_sceneCB.distanceBtwVoxels;\0D\0A}\0D\0A\0D\0Afloat3 WorldDirectionToTopLevelCellSpace(in float3 worldDirection)\0D\0A{\0D\0A\09return -worldDirection / g_sceneCB.distanceBtwVoxels;\0D\0A}\0D\0A\0D\0Abool IsValidCell(in int3 originVoxelPos)\0D\0A{\0D\0A\09return  originVoxelPos.x >= 0 &&\0D\0A\09\09\09originVoxelPos.y >= 0 &&\0D\0A\09\09\09originVoxelPos.z >= 0 &&\0D\0A\09\09\09(originVoxelPos.x + 1) < g_sceneCB.voxelAxisCount &&\0D\0A\09\09\09(originVoxelPos.y + 1) < g_sceneCB.voxelAxisCount &&\0D\0A\09\09\09(originVoxelPos.z + 1) < g_sceneCB.voxelAxisCount;\0D\0A}\0D\0A\0D\0Aint3 GoToNextVoxel(in Ray ray, in uint3 voxelIndex, in int3 direction, out float newT, out float3 voxelFaceNormal)\0D\0A{\0D\0A\09float3 tMax = float3(100000, 100000, 100000);\0D\0A\09int3 res = voxelIndex;\0D\0A\09const float FLT_INFINITY = 1.#INF;\0D\0A\09float3 invRayDirection = ray.direction != 0 ? 1 / ray.direction : (ray.direction > 0) ? FLT_INFINITY : -FLT_INFINITY;\0D\0A\0D\0A\09int3 sign = ray.direction > 0;\0D\0A\0D\0A\09float3 voxelPos = VoxelIndexToWorldSpace(voxelIndex);\0D\0A\09float3 voxelExtends = g_sceneCB.distanceBtwVoxels * 0.5;\0D\0A\09float3 aabb[2] = { voxelPos, voxelPos + g_sceneCB.distanceBtwVoxels };\0D\0A\0D\0A\09if(ray.direction.x != 0)\0D\0A\09\09tMax.x = (aabb[sign.x].x - ray.origin.x) * invRayDirection.x;\0D\0A\09\0D\0A\09if(ray.direction.y != 0)\0D\0A\09\09tMax.y = (aabb[sign.y].y - ray.origin.y) * invRayDirection.y;\0D\0A\09\0D\0A\09if(ray.direction.z != 0)\0D\0A\09\09tMax.z = (aabb[sign.z].z - ray.origin.z) * invRayDirection.z;\0D\0A\0D\0A\09if (tMax.x < tMax.y)\0D\0A\09{\0D\0A\09\09if (tMax.x < tMax.z)\0D\0A\09\09{\0D\0A\09\09\09res.x += direction.x;\0D\0A\09\09\09newT = tMax.x;\0D\0A\09\09\09voxelFaceNormal = VolumeRaytracer::CubeNormals[0] * -direction.x;\0D\0A\09\09}\0D\0A\09\09else\0D\0A\09\09{\0D\0A\09\09\09res.z += direction.z;\0D\0A\09\09\09newT = tMax.z;\0D\0A\09\09\09voxelFaceNormal = VolumeRaytracer::CubeNormals[4] * -direction.z;\0D\0A\09\09}\0D\0A\09}\0D\0A\09else\0D\0A\09{\0D\0A\09\09if (tMax.y < tMax.z)\0D\0A\09\09{\0D\0A\09\09\09res.y += direction.y;\0D\0A\09\09\09newT = tMax.y;\0D\0A\09\09\09voxelFaceNormal = VolumeRaytracer::CubeNormals[2] * -direction.y;\0D\0A\09\09}\0D\0A\09\09else\0D\0A\09\09{\0D\0A\09\09\09res.z += direction.z;\0D\0A\09\09\09newT = tMax.z;\0D\0A\09\09\09voxelFaceNormal = VolumeRaytracer::CubeNormals[4] * -direction.z;\0D\0A\09\09}\0D\0A\09}\0D\0A\0D\0A\09return res;\0D\0A}\0D\0A\0D\0A\0D\0A\0D\0Afloat3 GetPositionAlongRay(in Ray ray, in float t)\0D\0A{\0D\0A\09return ray.origin + ray.direction * t;\0D\0A}\0D\0A\0D\0Abool IsValidVoxelIndex(in int3 index)\0D\0A{\0D\0A\09return index.x >= 0 && index.x < g_sceneCB.voxelAxisCount && index.y >= 0 && index.y < g_sceneCB.voxelAxisCount && index.z >= 0 && index.z < g_sceneCB.voxelAxisCount;\0D\0A}\0D\0A\0D\0Abool IsSolid(in int3 index)\0D\0A{\0D\0A\09return g_voxelVolume[index] <= 0;\0D\0A}\0D\0A\0D\0Ainline float GetCellVoxel1(in int3 cellOriginIndex)\0D\0A{\0D\0A\09return g_voxelVolume[cellOriginIndex];\0D\0A}\0D\0A\0D\0Ainline float GetCellVoxel2(in int3 cellOriginIndex)\0D\0A{\0D\0A\09return\09g_voxelVolume[int3(cellOriginIndex.x + 1, cellOriginIndex.y, cellOriginIndex.z)];\0D\0A}\0D\0A\0D\0Ainline float GetCellVoxel3(in int3 cellOriginIndex)\0D\0A{\0D\0A\09return\09g_voxelVolume[int3(cellOriginIndex.x + 1, cellOriginIndex.y + 1, cellOriginIndex.z)];\0D\0A}\0D\0A\0D\0Ainline float GetCellVoxel4(in int3 cellOriginIndex)\0D\0A{\0D\0A\09return\09g_voxelVolume[int3(cellOriginIndex.x, cellOriginIndex.y + 1, cellOriginIndex.z)];\0D\0A}\0D\0A\0D\0Ainline float GetCellVoxel5(in int3 cellOriginIndex)\0D\0A{\0D\0A\09return g_voxelVolume[int3(cellOriginIndex.x, cellOriginIndex.y, cellOriginIndex.z + 1)];\0D\0A}\0D\0A\0D\0Ainline float GetCellVoxel6(in int3 cellOriginIndex)\0D\0A{\0D\0A\09return\09g_voxelVolume[int3(cellOriginIndex.x + 1, cellOriginIndex.y, cellOriginIndex.z + 1)];\0D\0A}\0D\0A\0D\0Ainline float GetCellVoxel7(in int3 cellOriginIndex)\0D\0A{\0D\0A\09return\09g_voxelVolume[int3(cellOriginIndex.x + 1, cellOriginIndex.y + 1, cellOriginIndex.z + 1)];\0D\0A}\0D\0A\0D\0Ainline float GetCellVoxel8(in int3 cellOriginIndex)\0D\0A{\0D\0A\09return\09g_voxelVolume[int3(cellOriginIndex.x, cellOriginIndex.y + 1, cellOriginIndex.z + 1)];\0D\0A}\0D\0A\0D\0Abool HasIsoSurfaceInsideCell(in int3 cellOriginIndex)\0D\0A{\0D\0A\09float v1 = GetCellVoxel1(cellOriginIndex);\0D\0A\09float v2 = GetCellVoxel2(cellOriginIndex);\0D\0A\09float v3 = GetCellVoxel3(cellOriginIndex);\0D\0A\09float v4 = GetCellVoxel4(cellOriginIndex);\0D\0A\09float v5 = GetCellVoxel5(cellOriginIndex);\0D\0A\09float v6 = GetCellVoxel6(cellOriginIndex);\0D\0A\09float v7 = GetCellVoxel7(cellOriginIndex);\0D\0A\09float v8 = GetCellVoxel8(cellOriginIndex);\0D\0A\0D\0A\09//return (sign(v1.g) & sign(v2.g) & sign(v3.g) & sign(v4.g) & sign(v5.g) & sign(v6.g) & sign(v7.g) & sign(v8.g)) != sign(v1.g);\0D\0A\0D\0A\09float v1Sign = sign(v1);\0D\0A\0D\0A\09return  v1Sign != sign(v2) ||\0D\0A\09\09\09v1Sign != sign(v3) ||\0D\0A\09\09\09v1Sign != sign(v4) ||\0D\0A\09\09\09v1Sign != sign(v5) ||\0D\0A\09\09\09v1Sign != sign(v6) ||\0D\0A\09\09\09v1Sign != sign(v7) ||\0D\0A\09\09\09v1Sign != sign(v8);\0D\0A}\0D\0A\0D\0Ainline float SumUVW(in float u0, in float v0, in float w0, in float u1, in float v1, in float w1)\0D\0A{\0D\0A\09return\09u0 * v0 * w0 +\0D\0A\09\09\09u1 * v0 * w0 +\0D\0A\09\09\09u0 * v1 * w0 +\0D\0A\09\09\09u1 * v1 * w0 +\0D\0A\09\09\09u0 * v0 * w1 +\0D\0A\09\09\09u1 * v0 * w1 +\0D\0A\09\09\09u0 * v1 * w1 +\0D\0A\09\09\09u1 * v1 * w1;\0D\0A}\0D\0A\0D\0Avoid GetDensityPolynomial(in Ray ray, in int3 cellIndex, in float tIn, in float tOut, out float A, out float B, out float C, out float D)\0D\0A{\0D\0A\09//float3 a0 = WorldSpaceToBottomLevelCellSpace(cellIndex, GetPositionAlongRay(ray, tIn));\0D\0A\09//float3 a1 = 1 - a0;/* WorldSpaceToTopLevelCellSpace(cellIndex, ray.origin);*/\0D\0A\09//float3 b0 = WorldSpaceToBottomLevelCellSpace(cellIndex, GetPositionAlongRay(ray, tOut)) - a0; /*WorldDirectionToBottomLevelCellSpace(ray.direction);*/\0D\0A\09//float3 b1 = -b0; /*WorldDirectionToTopLevelCellSpace(ray.direction);*/\0D\0A\0D\0A\09float3 a1 = WorldSpaceToBottomLevelCellSpace(cellIndex, GetPositionAlongRay(ray, tIn));\0D\0A\09float3 a0 = 1 - a1;/* WorldSpaceToTopLevelCellSpace(cellIndex, ray.origin);*/\0D\0A\09float3 b1 = WorldSpaceToBottomLevelCellSpace(cellIndex, GetPositionAlongRay(ray, tOut)) - a1; /*WorldDirectionToBottomLevelCellSpace(ray.direction);*/\0D\0A\09float3 b0 = -b1; /*WorldDirectionToTopLevelCellSpace(ray.direction);*/\0D\0A\0D\0A\09int3 v000 = cellIndex;\0D\0A\09int3 v100 = cellIndex + int3(1, 0, 0);\0D\0A\09int3 v010 = cellIndex + int3(0, 1, 0);\0D\0A\09int3 v110 = cellIndex + int3(1, 1, 0);\0D\0A\09int3 v001 = cellIndex + int3(0, 0, 1);\0D\0A\09int3 v101 = cellIndex + int3(1, 0, 1);\0D\0A\09int3 v111 = cellIndex + int3(1, 1, 1);\0D\0A\09int3 v011 = cellIndex + int3(0, 1, 1);\0D\0A\0D\0A\09A =\09b0.x * b0.y * b0.z * g_voxelVolume[v000] + \0D\0A\09\09b1.x * b0.y * b0.z * g_voxelVolume[v100] +\0D\0A\09\09b0.x * b1.y * b0.z * g_voxelVolume[v010] +\0D\0A\09\09b1.x * b1.y * b0.z * g_voxelVolume[v110] +\0D\0A\09\09b0.x * b0.y * b1.z * g_voxelVolume[v001] +\0D\0A\09\09b1.x * b0.y * b1.z * g_voxelVolume[v101] +\0D\0A\09\09b0.x * b1.y * b1.z * g_voxelVolume[v011] +\0D\0A\09\09b1.x * b1.y * b1.z * g_voxelVolume[v111];\0D\0A\0D\0A\09D = a0.x * a0.y * a0.z * g_voxelVolume[v000] +\0D\0A\09\09a1.x * a0.y * a0.z * g_voxelVolume[v100] +\0D\0A\09\09a0.x * a1.y * a0.z * g_voxelVolume[v010] +\0D\0A\09\09a1.x * a1.y * a0.z * g_voxelVolume[v110] +\0D\0A\09\09a0.x * a0.y * a1.z * g_voxelVolume[v001] +\0D\0A\09\09a1.x * a0.y * a1.z * g_voxelVolume[v101] +\0D\0A\09\09a0.x * a1.y * a1.z * g_voxelVolume[v011] +\0D\0A\09\09a1.x * a1.y * a1.z * g_voxelVolume[v111];\0D\0A\0D\0A\09B = (a0.x * b0.y * b0.z + b0.x * a0.y * b0.z + b0.x * b0.y * a0.z) * g_voxelVolume[v000] +\0D\0A\09\09(a1.x * b0.y * b0.z + b1.x * a0.y * b0.z + b1.x * b0.y * a0.z) * g_voxelVolume[v100] +\0D\0A\09\09(a0.x * b1.y * b0.z + b0.x * a1.y * b0.z + b0.x * b1.y * a0.z) * g_voxelVolume[v010] +\0D\0A\09\09(a1.x * b1.y * b0.z + b1.x * a1.y * b0.z + b1.x * b1.y * a0.z) * g_voxelVolume[v110] +\0D\0A\09\09(a0.x * b0.y * b1.z + b0.x * a0.y * b1.z + b0.x * b0.y * a1.z) * g_voxelVolume[v001] +\0D\0A\09\09(a1.x * b0.y * b1.z + b1.x * a0.y * b1.z + b1.x * b0.y * a1.z) * g_voxelVolume[v101] +\0D\0A\09\09(a0.x * b1.y * b1.z + b0.x * a1.y * b1.z + b0.x * b1.y * a1.z) * g_voxelVolume[v011] +\0D\0A\09\09(a1.x * b1.y * b1.z + b1.x * a1.y * b1.z + b1.x * b1.y * a1.z) * g_voxelVolume[v111];\0D\0A\0D\0A\09C = (b0.x * a0.y * a0.z + a0.x * b0.y * a0.z + a0.x * a0.y * b0.z) * g_voxelVolume[v000] +\0D\0A\09\09(b1.x * a0.y * a0.z + a1.x * b0.y * a0.z + a1.x * a0.y * b0.z) * g_voxelVolume[v100] +\0D\0A\09\09(b0.x * a1.y * a0.z + a0.x * b1.y * a0.z + a0.x * a1.y * b0.z) * g_voxelVolume[v010] +\0D\0A\09\09(b1.x * a1.y * a0.z + a1.x * b1.y * a0.z + a1.x * a1.y * b0.z) * g_voxelVolume[v110] +\0D\0A\09\09(b0.x * a0.y * a1.z + a0.x * b0.y * a1.z + a0.x * a0.y * b1.z) * g_voxelVolume[v001] +\0D\0A\09\09(b1.x * a0.y * a1.z + a1.x * b0.y * a1.z + a1.x * a0.y * b1.z) * g_voxelVolume[v101] +\0D\0A\09\09(b0.x * a1.y * a1.z + a0.x * b1.y * a1.z + a0.x * a1.y * b1.z) * g_voxelVolume[v011] +\0D\0A\09\09(b1.x * a1.y * a1.z + a1.x * b1.y * a1.z + a1.x * a1.y * b1.z) * g_voxelVolume[v111];\0D\0A}\0D\0A\0D\0Afloat GetDensity(in int3 cellOriginIndex, in float3 cellPos)\0D\0A{\0D\0A\09float v1 = GetCellVoxel1(cellOriginIndex);\0D\0A\09float v2 = GetCellVoxel2(cellOriginIndex);\0D\0A\09float v3 = GetCellVoxel3(cellOriginIndex);\0D\0A\09float v4 = GetCellVoxel4(cellOriginIndex);\0D\0A\09float v5 = GetCellVoxel5(cellOriginIndex);\0D\0A\09float v6 = GetCellVoxel6(cellOriginIndex);\0D\0A\09float v7 = GetCellVoxel7(cellOriginIndex);\0D\0A\09float v8 = GetCellVoxel8(cellOriginIndex);\0D\0A\0D\0A\09float a = v3 + v6 + v1 + v8 - v4 - v7 - v5 - v2;\0D\0A\09float b = v7 - v6 - v3 + v2;\0D\0A\09float c = v4 - v1 - v3 + v2;\0D\0A\09float d = v5 - v1 - v6 + v2;\0D\0A\09float e = v3 - v2;\0D\0A\09float f = v6 - v2;\0D\0A\09float g = v1 - v2;\0D\0A\09float h = v2;\0D\0A\0D\0A\09return a * cellPos.x * cellPos.y * cellPos.z + b * cellPos.y * cellPos.z + c * cellPos.x * cellPos.z + d * cellPos.x * cellPos.y + e * cellPos.y + f * cellPos.z + g * cellPos.x + h;\0D\0A}\0D\0A\0D\0Ainline float GetDensityWithPolynomial(in float t, in float A, in float B, in float C, in float D)\0D\0A{\0D\0A\09return A*t*t*t + B*t*t + C*t + D;\0D\0A}\0D\0A\0D\0Abool GetSurfaceIntersectionT(in Ray ray, in int3 cellIndex, in float tIn, in float tOut, out float tHit)\0D\0A{\0D\0A\09float A, B, C, D = 0;\0D\0A\09float t0 = 0;\0D\0A\09float t1 = 1;\0D\0A\0D\0A\09GetDensityPolynomial(ray, cellIndex, tIn, tOut, A, B, C, D);\0D\0A\0D\0A\09if (A == 0)\0D\0A\09{\0D\0A\09\09return false;\0D\0A\09}\0D\0A\0D\0A\09float dA = 3 * A;\0D\0A\09float dB = 2 * B;\0D\0A\0D\0A\09float ex1 = (-dB + sqrt(dB*dB - 4*dA*C)) / (2 * dA);\0D\0A\09float ex2 = (-dB - sqrt(dB*dB - 4*dA*C)) / (2 * dA);\0D\0A\0D\0A\09float f0 = GetDensityWithPolynomial(t0, A, B, C, D);\0D\0A\09float f1 = GetDensityWithPolynomial(t1, A, B, C, D);\0D\0A\0D\0A\09//if (f0 <= 0)\0D\0A\09//{\0D\0A\09//\09tHit = t0;\0D\0A\09//\09return true;\0D\0A\09//}\0D\0A\09//else\0D\0A\09//{\0D\0A\09//\09return false;\0D\0A\09//}\0D\0A\0D\0A\0D\0A\09if (ex1 > ex2)\0D\0A\09{\0D\0A\09\09float f = ex1;\0D\0A\09\09ex1 = ex2;\0D\0A\09\09ex2 = f;\0D\0A\09}\0D\0A\0D\0A\09if (ex1 >= t0 && ex1 <= t1)\0D\0A\09{\0D\0A\09\09float fex1 = GetDensityWithPolynomial(ex1, A, B, C, D);\0D\0A\0D\0A\09\09if (sign(fex1) == sign(f0))\0D\0A\09\09{\0D\0A\09\09\09t0 = ex1;\0D\0A\09\09\09f0 = fex1;\0D\0A\09\09}\0D\0A\09\09else\0D\0A\09\09{\0D\0A\09\09\09t1 = ex1;\0D\0A\09\09\09f1 = fex1;\0D\0A\09\09}\0D\0A\09}\0D\0A\0D\0A\09if (ex2 >= t0 && ex2 <= t1)\0D\0A\09{\0D\0A\09\09float fex2 = GetDensityWithPolynomial(ex2, A, B, C, D);\0D\0A\0D\0A\09\09if (sign(fex2) == sign(f0))\0D\0A\09\09{\0D\0A\09\09\09t0 = ex2;\0D\0A\09\09\09f0 = fex2;\0D\0A\09\09}\0D\0A\09\09else\0D\0A\09\09{\0D\0A\09\09\09t1 = ex2;\0D\0A\09\09\09f1 = fex2;\0D\0A\09\09}\0D\0A\09}\0D\0A\0D\0A\09if (sign(f0) == sign(f1))\0D\0A\09{\0D\0A\09\09return false;\0D\0A\09}\0D\0A\0D\0A\09for (int i = 0; i < 2; i++)\0D\0A\09{\0D\0A\09\09float t = t0 + (t1 - t0) * (-f0 / (f1 - f0));\0D\0A\09\09float f = GetDensityWithPolynomial(t, A, B, C, D);\0D\0A\0D\0A\09\09if (sign(f) == sign(f0))\0D\0A\09\09{\0D\0A\09\09\09t0 = t;\0D\0A\09\09\09f0 = f;\0D\0A\09\09}\0D\0A\09\09else\0D\0A\09\09{\0D\0A\09\09\09t1 = t;\0D\0A\09\09\09f1 = f;\0D\0A\09\09}\0D\0A\09}\0D\0A\0D\0A\09tHit = t0 + (t1 - t0) * (-f0 / (f1 - f0));\0D\0A\09//tHit = (tHit * (tOut - tIn)) / -tIn;\0D\0A\0D\0A\09tHit = lerp(tIn, tOut, tHit);\0D\0A\0D\0A\09return true;\0D\0A}\0D\0A\0D\0Afloat3 GetNormal(in int3 cellIndex, in float3 normPos)\0D\0A{\0D\0A\09float v1 = GetCellVoxel1(cellIndex);\0D\0A\09float v2 = GetCellVoxel2(cellIndex);\0D\0A\09float v3 = GetCellVoxel3(cellIndex);\0D\0A\09float v4 = GetCellVoxel4(cellIndex);\0D\0A\09float v5 = GetCellVoxel5(cellIndex);\0D\0A\09float v6 = GetCellVoxel6(cellIndex);\0D\0A\09float v7 = GetCellVoxel7(cellIndex);\0D\0A\09float v8 = GetCellVoxel8(cellIndex);\0D\0A\0D\0A\09float a = v3 + v6 + v1 + v8 - v4 - v7 - v5 - v2;\0D\0A\09float b = v7 - v6 - v3 + v2;\0D\0A\09float c = v4 - v1 - v3 + v2;\0D\0A\09float d = v5 - v1 - v6 + v2;\0D\0A\09float e = v3 - v2;\0D\0A\09float f = v6 - v2;\0D\0A\09float g = v1 - v2;\0D\0A\0D\0A\09float nX = a * normPos.y * normPos.z + c * normPos.z + d * normPos.y + g;\0D\0A\09float nY = a * normPos.z * normPos.x + b * normPos.z + d * normPos.x + e;\0D\0A\09float nZ = a * normPos.y * normPos.x + b * normPos.y + c * normPos.x + f;\0D\0A\0D\0A\09float3 norm = normalize(float3(nX, nY, nZ));\0D\0A\0D\0A\09if (isnan(norm.x))\0D\0A\09{\0D\0A\09\09return float3(0,0,0);\0D\0A\09}\0D\0A\09else\0D\0A\09{\0D\0A\09\09return norm;\0D\0A\09}\0D\0A}\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid VRRaygen()\0D\0A{\0D\0A\09Ray ray = GenerateCameraRay(DispatchRaysIndex().xy, g_sceneCB.cameraPosition.xyz, g_sceneCB.viewMatrixInverted, g_sceneCB.projectionMatrixInverted);\0D\0A\0D\0A\09uint currentRecursionDepth = 0;\0D\0A\09float4 color = TraceRadianceRay(ray, currentRecursionDepth);\0D\0A\0D\0A\09g_renderTarget[DispatchRaysIndex().xy] = color;\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid VRClosestHit(inout VolumeRaytracer::VRayPayload rayPayload, in VolumeRaytracer::VPrimitiveAttributes attr)\0D\0A{\0D\0A\09rayPayload.color = float4(attr.normal, 1);\0D\0A\09//rayPayload.color = float4(abs((attr.normal + 1) * 0.5), 1);\0D\0A}\0D\0A\0D\0A[shader(\22intersection\22)]\0D\0Avoid VRIntersection()\0D\0A{\0D\0A\09Ray ray;\0D\0A\0D\0A\09ray.origin = WorldRayOrigin();\0D\0A\09ray.direction = WorldRayDirection();\0D\0A\0D\0A\09//Check if we intersect voxel volume\0D\0A\09float3 volumeAABB[2] = {float3(-g_sceneCB.volumeExtend, -g_sceneCB.volumeExtend, -g_sceneCB.volumeExtend), float3(g_sceneCB.volumeExtend, g_sceneCB.volumeExtend, g_sceneCB.volumeExtend)};\0D\0A\09float tEnter, tExit;\0D\0A\0D\0A\09float tMax = RayTCurrent();\0D\0A\0D\0A\09if (DetermineRayAABBIntersection(ray, volumeAABB, tEnter, tExit))\0D\0A\09{\0D\0A\09\09int3 voxelDir = sign(ray.direction);\0D\0A\09\09int3 voxelPos;\0D\0A\09\09int3 nextVoxelPos;\0D\0A\09\09float3 hitNormal = -ray.direction;\0D\0A\09\09float cellExit;\0D\0A\09\09float cellEnter;\0D\0A\09\09float tHit;\0D\0A\0D\0A\09\09tEnter += 0.0001;\0D\0A\0D\0A\09\09if (tEnter >= 0)\0D\0A\09\09{\0D\0A\09\09\09voxelPos = WorldSpaceToVoxelSpace(GetPositionAlongRay(ray, tEnter));\0D\0A\09\09}\0D\0A\09\09else\0D\0A\09\09{\0D\0A\09\09\09voxelPos = WorldSpaceToVoxelSpace(ray.origin);\0D\0A\09\09}\0D\0A\0D\0A\09\09cellExit = tEnter;\0D\0A\0D\0A\09\09int maxIterations = 3000;\0D\0A\0D\0A\09\09while (cellExit <= tMax && maxIterations > 0)\0D\0A\09\09{\0D\0A\09\09\09maxIterations--;\0D\0A\0D\0A\09\09\09cellEnter = cellExit;\0D\0A\0D\0A\09\09\09nextVoxelPos = GoToNextVoxel(ray, voxelPos, voxelDir, cellExit, hitNormal);\0D\0A\0D\0A\09\09\09if (IsValidCell(voxelPos))\0D\0A\09\09\09{\0D\0A\09\09\09\09if (HasIsoSurfaceInsideCell(voxelPos))\0D\0A\09\09\09\09{\0D\0A\09\09\09\09\09/*VolumeRaytracer::VPrimitiveAttributes attr;\0D\0A\09\09\09\09\09attr.normal = float3(1, 0, 0);\0D\0A\0D\0A\09\09\09\09\09ReportHit(cellEnter, 0, attr);*/\0D\0A\0D\0A\09\09\09\09\09if (GetSurfaceIntersectionT(ray, voxelPos, cellEnter, cellExit, tHit))\0D\0A\09\09\09\09\09{\0D\0A\09\09\09\09\09\09VolumeRaytracer::VPrimitiveAttributes attr;\0D\0A\09\09\09\09\09\09attr.normal = float3(tHit, tHit, tHit) / tMax;\0D\0A\0D\0A\09\09\09\09\09\09ReportHit(tHit, 0, attr);\0D\0A\09\09\09\09\09}\0D\0A\09\09\09\09}\0D\0A\09\09\09}\0D\0A\09\09\09\0D\0A\09\09\09voxelPos = nextVoxelPos;\0D\0A\09\09}\0D\0A\09}\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid VRMiss(inout VolumeRaytracer::VRayPayload rayPayload)\0D\0A{\0D\0A\09float3 rayDirection = WorldRayDirection();\0D\0A\09rayPayload.color = g_envMap.SampleLevel(g_envMapSampler, rayDirection.xzy, 0);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid VRMissShadowRay(inout VolumeRaytracer::VShadowRayPayload rayPayload)\0D\0A{\0D\0A\09rayPayload.hit = false;\0D\0A}"}
!217 = !{!"./DX/Resources/Shaders/RaytracingHlsl.h", !"/*\0D\0A\09Copyright (c) 2020 Thomas Sch\C3\B6ngrundner\0D\0A\0D\0A\09Permission is hereby granted, free of charge, to any person obtaining a copy\0D\0A\09of this software and associated documentation files (the \22Software\22), to deal\0D\0A\09in the Software without restriction, including without limitation the rights\0D\0A\09to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\0D\0A\09copies of the Software, and to permit persons to whom the Software is\0D\0A\09furnished to do so, subject to the following conditions:\0D\0A\0D\0A\09The above copyright notice and this permission notice shall be included in all\0D\0A\09copies or substantial portions of the Software.\0D\0A*/\0D\0A\0D\0A#pragma once\0D\0A\0D\0A#ifdef HLSL\0D\0Atypedef float2 XMFLOAT2;\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef int3 XMINT3;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A#else\0D\0A\09#include <DirectXMath.h>\0D\0A\09using namespace DirectX;\0D\0A#endif\0D\0A\0D\0A#define MAX_RAY_RECURSION_DEPTH 3\0D\0A\0D\0Anamespace VolumeRaytracer\0D\0A{\0D\0A\09struct VPrimitiveAttributes\0D\0A\09{\0D\0A\09\09XMFLOAT3 normal;\0D\0A\09};\0D\0A\0D\0A\09struct VRayPayload\0D\0A\09{\0D\0A\09\09XMFLOAT4 color;\0D\0A\09\09UINT depth;\0D\0A\09};\0D\0A\0D\0A\09struct VShadowRayPayload\0D\0A\09{\0D\0A\09\09bool hit;\0D\0A\09};\0D\0A\0D\0A\09struct VSceneConstantBuffer\0D\0A\09{\0D\0A\09\09XMMATRIX viewMatrixInverted;\0D\0A\09\09XMMATRIX projectionMatrixInverted;\0D\0A\09\09XMVECTOR cameraPosition;\0D\0A\09\09UINT voxelAxisCount;\0D\0A\09\09float volumeExtend;\0D\0A\09\09float distanceBtwVoxels;\0D\0A\09};\0D\0A\0D\0A\09static const XMFLOAT4 BackgroundColor = XMFLOAT4(0.8f, 0.9f, 1.0f, 1.0f);\0D\0A\09static const XMFLOAT3 CubeNormals[] = {\0D\0A\09\09XMFLOAT3(1.0f, 0.0f, 0.0f),\0D\0A\09\09XMFLOAT3(-1.0f, 0.0f, 0.0f),\0D\0A\09\09XMFLOAT3(0.0f, 1.0f, 0.0f),\0D\0A\09\09XMFLOAT3(0.0f, -1.0f, 0.0f),\0D\0A\09\09XMFLOAT3(0.0f, 0.0f, 1.0f),\0D\0A\09\09XMFLOAT3(0.0f, 0.0f, -1.0f)\0D\0A\09};\0D\0A}"}
!218 = !{!"./DX/Resources/Shaders/Raytracing.hlsl"}
!219 = !{!"-Zi", !"-Od", !"-Fo", !"./DX/Resources/Shaders/Compiled/Raytracing.cso", !"-T", !"lib_6_3"}
!220 = !{i32 1, i32 3}
!221 = !{i32 1, i32 5}
!222 = !{!"lib", i32 6, i32 3}
!223 = !{!224, !230, !232, !234}
!224 = !{!225, !227, !229}
!225 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?g_scene@@3URaytracingAccelerationStructure@@A", !"g_scene", i32 0, i32 0, i32 1, i32 16, i32 0, !226}
!226 = !{i32 0, i32 4}
!227 = !{i32 1, %"class.Texture3D<float>"* @"\01?g_voxelVolume@@3V?$Texture3D@M@@A", !"g_voxelVolume", i32 0, i32 2, i32 1, i32 4, i32 0, !228}
!228 = !{i32 0, i32 9}
!229 = !{i32 2, %"class.TextureCube<vector<float, 4> >"* @"\01?g_envMap@@3V?$TextureCube@V?$vector@M$03@@@@A", !"g_envMap", i32 0, i32 1, i32 1, i32 5, i32 0, !228}
!230 = !{!231}
!231 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?g_renderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"g_renderTarget", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !228}
!232 = !{!233}
!233 = !{i32 0, %g_sceneCB* @g_sceneCB, !"g_sceneCB", i32 0, i32 0, i32 1, i32 156, null}
!234 = !{!235}
!235 = !{i32 0, %struct.SamplerState* @"\01?g_envMapSampler@@3USamplerState@@A", !"g_envMapSampler", i32 0, i32 0, i32 1, i32 0, null}
!236 = !{i32 0, %struct.RaytracingAccelerationStructure undef, !237, %"class.Texture3D<float>" undef, !239, %"class.Texture3D<float>::mips_type" undef, !242, %"class.TextureCube<vector<float, 4> >" undef, !244, %"class.RWTexture2D<vector<float, 4> >" undef, !244, %"struct.VolumeRaytracer::VSceneConstantBuffer" undef, !245, %struct.Ray undef, !253, %struct.RayDesc undef, !256, %"struct.VolumeRaytracer::VRayPayload" undef, !261, %"struct.VolumeRaytracer::VPrimitiveAttributes" undef, !264, %"struct.VolumeRaytracer::VShadowRayPayload" undef, !266, %g_sceneCB undef, !268}
!237 = !{i32 4, !238}
!238 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!239 = !{i32 20, !240, !241}
!240 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!241 = !{i32 6, !"mips", i32 3, i32 16}
!242 = !{i32 4, !243}
!243 = !{i32 6, !"handle", i32 3, i32 0, i32 7, i32 5}
!244 = !{i32 16, !240}
!245 = !{i32 156, !246, !248, !249, !250, !251, !252}
!246 = !{i32 6, !"viewMatrixInverted", i32 2, !247, i32 3, i32 0, i32 7, i32 9}
!247 = !{i32 4, i32 4, i32 2}
!248 = !{i32 6, !"projectionMatrixInverted", i32 2, !247, i32 3, i32 64, i32 7, i32 9}
!249 = !{i32 6, !"cameraPosition", i32 3, i32 128, i32 7, i32 9}
!250 = !{i32 6, !"voxelAxisCount", i32 3, i32 144, i32 7, i32 5}
!251 = !{i32 6, !"volumeExtend", i32 3, i32 148, i32 7, i32 9}
!252 = !{i32 6, !"distanceBtwVoxels", i32 3, i32 152, i32 7, i32 9}
!253 = !{i32 28, !254, !255}
!254 = !{i32 6, !"origin", i32 3, i32 0, i32 7, i32 9}
!255 = !{i32 6, !"direction", i32 3, i32 16, i32 7, i32 9}
!256 = !{i32 32, !257, !258, !259, !260}
!257 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!258 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!259 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!260 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!261 = !{i32 20, !262, !263}
!262 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!263 = !{i32 6, !"depth", i32 3, i32 16, i32 7, i32 5}
!264 = !{i32 12, !265}
!265 = !{i32 6, !"normal", i32 3, i32 0, i32 7, i32 9}
!266 = !{i32 4, !267}
!267 = !{i32 6, !"hit", i32 3, i32 0, i32 7, i32 1}
!268 = !{i32 156, !269}
!269 = !{i32 6, !"g_sceneCB", i32 3, i32 0}
!270 = !{i32 1, void ()* @"\01?VRRaygen@@YAXXZ", !271, void (%"struct.VolumeRaytracer::VRayPayload"*, %"struct.VolumeRaytracer::VPrimitiveAttributes"*)* @"\01?VRClosestHit@@YAXUVRayPayload@VolumeRaytracer@@UVPrimitiveAttributes@2@@Z", !273, void ()* @"\01?VRIntersection@@YAXXZ", !271, void (%"struct.VolumeRaytracer::VRayPayload"*)* @"\01?VRMiss@@YAXUVRayPayload@VolumeRaytracer@@@Z", !276, void (%"struct.VolumeRaytracer::VShadowRayPayload"*)* @"\01?VRMissShadowRay@@YAXUVShadowRayPayload@VolumeRaytracer@@@Z", !276}
!271 = !{!272}
!272 = !{i32 1, !2, !2}
!273 = !{!272, !274, !275}
!274 = !{i32 2, !2, !2}
!275 = !{i32 0, !2, !2}
!276 = !{!272, !274}
!277 = !{null, !"", null, !223, !278}
!278 = !{i32 0, i64 65537}
!279 = !{void (%"struct.VolumeRaytracer::VRayPayload"*, %"struct.VolumeRaytracer::VPrimitiveAttributes"*)* @"\01?VRClosestHit@@YAXUVRayPayload@VolumeRaytracer@@UVPrimitiveAttributes@2@@Z", !"\01?VRClosestHit@@YAXUVRayPayload@VolumeRaytracer@@UVPrimitiveAttributes@2@@Z", null, null, !280}
!280 = !{i32 8, i32 10, i32 6, i32 20, i32 7, i32 12, i32 5, !281}
!281 = !{i32 0}
!282 = !{void ()* @"\01?VRIntersection@@YAXXZ", !"\01?VRIntersection@@YAXXZ", null, null, !283}
!283 = !{i32 8, i32 8, i32 5, !281}
!284 = !{void (%"struct.VolumeRaytracer::VRayPayload"*)* @"\01?VRMiss@@YAXUVRayPayload@VolumeRaytracer@@@Z", !"\01?VRMiss@@YAXUVRayPayload@VolumeRaytracer@@@Z", null, null, !285}
!285 = !{i32 8, i32 11, i32 6, i32 20, i32 5, !281}
!286 = !{void (%"struct.VolumeRaytracer::VShadowRayPayload"*)* @"\01?VRMissShadowRay@@YAXUVShadowRayPayload@VolumeRaytracer@@@Z", !"\01?VRMissShadowRay@@YAXUVShadowRayPayload@VolumeRaytracer@@@Z", null, null, !287}
!287 = !{i32 8, i32 11, i32 6, i32 4, i32 5, !281}
!288 = !{void ()* @"\01?VRRaygen@@YAXXZ", !"\01?VRRaygen@@YAXXZ", null, null, !289}
!289 = !{i32 8, i32 7, i32 5, !281}
!290 = !DILocation(line: 545, column: 124, scope: !98)
!291 = !DILocation(line: 545, column: 94, scope: !98)
!292 = !DILocation(line: 545, column: 54, scope: !98)
!293 = !DILocation(line: 545, column: 30, scope: !98)
!294 = !DILocation(line: 545, column: 12, scope: !98)
!295 = !DILocation(line: 36, column: 14, scope: !141, inlinedAt: !296)
!296 = distinct !DILocation(line: 545, column: 12, scope: !98)
!297 = !DILocation(line: 36, column: 20, scope: !141, inlinedAt: !296)
!298 = !DILocation(line: 36, column: 9, scope: !141, inlinedAt: !296)
!299 = !DILocation(line: 37, column: 21, scope: !141, inlinedAt: !296)
!300 = !DILocation(line: 37, column: 26, scope: !141, inlinedAt: !296)
!301 = !DILocation(line: 37, column: 24, scope: !141, inlinedAt: !296)
!302 = !DILocation(line: 37, column: 54, scope: !141, inlinedAt: !296)
!303 = !DILocation(line: 37, column: 60, scope: !141, inlinedAt: !296)
!304 = !DILocation(line: 37, column: 9, scope: !141, inlinedAt: !296)
!305 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !141, file: !34, line: 46, type: !37)
!306 = !DIExpression(DW_OP_bit_piece, 0, 96)
!307 = !DILocation(line: 46, column: 6, scope: !141, inlinedAt: !296)
!308 = !DIExpression(DW_OP_bit_piece, 96, 96)
!309 = !DILocation(line: 48, column: 19, scope: !141, inlinedAt: !296)
!310 = !DILocation(line: 48, column: 15, scope: !141, inlinedAt: !296)
!311 = !DILocation(line: 48, column: 13, scope: !141, inlinedAt: !296)
!312 = !DILocation(line: 50, column: 43, scope: !141, inlinedAt: !296)
!313 = !DILocation(line: 50, column: 57, scope: !141, inlinedAt: !296)
!314 = !DILocation(line: 50, column: 56, scope: !141, inlinedAt: !296)
!315 = !DILocation(line: 50, column: 22, scope: !141, inlinedAt: !296)
!316 = !DILocation(line: 50, column: 18, scope: !141, inlinedAt: !296)
!317 = !DILocation(line: 50, column: 9, scope: !141, inlinedAt: !296)
!318 = !DILocation(line: 51, column: 43, scope: !141, inlinedAt: !296)
!319 = !DILocation(line: 51, column: 22, scope: !141, inlinedAt: !296)
!320 = !DILocation(line: 51, column: 18, scope: !141, inlinedAt: !296)
!321 = !DILocation(line: 51, column: 16, scope: !141, inlinedAt: !296)
!322 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currentRecursionDepth", scope: !98, file: !34, line: 547, type: !41)
!323 = !DIExpression()
!324 = !DILocation(line: 547, column: 7, scope: !98)
!325 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "color", scope: !98, file: !34, line: 548, type: !4)
!326 = !DILocation(line: 548, column: 9, scope: !98)
!327 = !DILocation(line: 548, column: 17, scope: !98)
!328 = !DILocation(line: 548, column: 39, scope: !98)
!329 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ray", arg: 1, scope: !33, file: !34, line: 56, type: !37)
!330 = !DILocation(line: 56, column: 32, scope: !33, inlinedAt: !331)
!331 = distinct !DILocation(line: 548, column: 17, scope: !98)
!332 = !DILocation(line: 58, column: 6, scope: !333, inlinedAt: !331)
!333 = distinct !DILexicalBlock(scope: !33, file: !34, line: 58, column: 6)
!334 = !DILocation(line: 58, column: 31, scope: !333, inlinedAt: !331)
!335 = !DILocation(line: 58, column: 6, scope: !33, inlinedAt: !331)
!336 = !DILocation(line: 60, column: 3, scope: !337, inlinedAt: !331)
!337 = distinct !DILexicalBlock(scope: !333, file: !34, line: 59, column: 2)
!338 = !DILocation(line: 64, column: 23, scope: !33, inlinedAt: !331)
!339 = !DILocation(line: 64, column: 10, scope: !33, inlinedAt: !331)
!340 = !DILocation(line: 64, column: 17, scope: !33, inlinedAt: !331)
!341 = !DILocation(line: 65, column: 26, scope: !33, inlinedAt: !331)
!342 = !DILocation(line: 65, column: 10, scope: !33, inlinedAt: !331)
!343 = !DILocation(line: 65, column: 20, scope: !33, inlinedAt: !331)
!344 = !DILocation(line: 67, column: 10, scope: !33, inlinedAt: !331)
!345 = !DILocation(line: 67, column: 15, scope: !33, inlinedAt: !331)
!346 = !DILocation(line: 68, column: 10, scope: !33, inlinedAt: !331)
!347 = !DILocation(line: 68, column: 15, scope: !33, inlinedAt: !331)
!348 = !DILocation(line: 70, column: 44, scope: !33, inlinedAt: !331)
!349 = !DILocation(line: 70, column: 63, scope: !33, inlinedAt: !331)
!350 = !DILocation(line: 70, column: 88, scope: !33, inlinedAt: !331)
!351 = !DILocation(line: 72, column: 2, scope: !33, inlinedAt: !331)
!352 = !DILocation(line: 74, column: 20, scope: !33, inlinedAt: !331)
!353 = !DILocation(line: 74, column: 2, scope: !33, inlinedAt: !331)
!354 = !DILocation(line: 75, column: 1, scope: !33, inlinedAt: !331)
!355 = !DILocation(line: 550, column: 43, scope: !98)
!356 = !DILocation(line: 550, column: 17, scope: !98)
!357 = !DILocation(line: 550, column: 2, scope: !98)
!358 = !DILocation(line: 550, column: 41, scope: !98)
!359 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "projInverted", arg: 4, scope: !141, file: !34, line: 34, type: !151)
!360 = !DILocation(line: 34, column: 107, scope: !141, inlinedAt: !296)
!361 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "viewInverted", arg: 3, scope: !141, file: !34, line: 34, type: !151)
!362 = !DILocation(line: 34, column: 81, scope: !141, inlinedAt: !296)
!363 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cameraPosition", arg: 2, scope: !141, file: !34, line: 34, type: !25)
!364 = !DILocation(line: 34, column: 53, scope: !141, inlinedAt: !296)
!365 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 1, scope: !141, file: !34, line: 34, type: !144)
!366 = !DILocation(line: 34, column: 36, scope: !141, inlinedAt: !296)
!367 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xy", scope: !141, file: !34, line: 36, type: !368)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 36, baseType: !369)
!369 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 36, size: 64, align: 32, elements: !370, templateParams: !373)
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !369, file: !1, line: 36, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !369, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!373 = !{!13, !150}
!374 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "screenPos", scope: !141, file: !34, line: 37, type: !368)
!375 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "target", scope: !141, file: !34, line: 50, type: !4)
!376 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currentRayRecursionDepth", arg: 2, scope: !33, file: !34, line: 56, type: !41)
!377 = !DILocation(line: 56, column: 45, scope: !33, inlinedAt: !331)
!378 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayDesc", scope: !33, file: !34, line: 63, type: !379)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 63, size: 256, align: 32, elements: !380)
!380 = !{!381, !382, !383, !384}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !379, file: !1, line: 63, baseType: !26, size: 96, align: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !379, file: !1, line: 63, baseType: !8, size: 32, align: 32, offset: 96)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !379, file: !1, line: 63, baseType: !26, size: 96, align: 32, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !379, file: !1, line: 63, baseType: !8, size: 32, align: 32, offset: 224)
!385 = !DILocation(line: 63, column: 10, scope: !33, inlinedAt: !331)
!386 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayPayload", scope: !33, file: !34, line: 70, type: !105)
!387 = !DIExpression(DW_OP_bit_piece, 0, 128)
!388 = !DILocation(line: 70, column: 31, scope: !33, inlinedAt: !331)
!389 = !DIExpression(DW_OP_bit_piece, 128, 32)
!390 = !DILocation(line: 551, column: 1, scope: !98)
!391 = !DILocation(line: 554, column: 107, scope: !101)
!392 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !101, file: !34, line: 554, type: !113)
!393 = !DIExpression(DW_OP_deref)
!394 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rayPayload", arg: 1, scope: !101, file: !34, line: 554, type: !104)
!395 = !DILocation(line: 554, column: 54, scope: !101)
!396 = !DILocation(line: 556, column: 33, scope: !101)
!397 = !DILocation(line: 556, column: 28, scope: !101)
!398 = !DILocation(line: 556, column: 19, scope: !101)
!399 = !DILocation(line: 558, column: 1, scope: !101)
!400 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !117, file: !34, line: 563, type: !37)
!401 = !DILocation(line: 563, column: 6, scope: !117)
!402 = !DILocation(line: 565, column: 15, scope: !117)
!403 = !DILocation(line: 565, column: 13, scope: !117)
!404 = !DILocation(line: 566, column: 18, scope: !117)
!405 = !DILocation(line: 566, column: 16, scope: !117)
!406 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volumeAABB", scope: !117, file: !34, line: 569, type: !47)
!407 = !DIExpression(DW_OP_bit_piece, 0, 64)
!408 = !DILocation(line: 569, column: 9, scope: !117)
!409 = !DIExpression(DW_OP_bit_piece, 64, 64)
!410 = !DIExpression(DW_OP_bit_piece, 128, 64)
!411 = !DILocation(line: 569, column: 25, scope: !117)
!412 = !DILocation(line: 569, column: 44, scope: !117)
!413 = !DILocation(line: 569, column: 33, scope: !117)
!414 = !DILocation(line: 569, column: 69, scope: !117)
!415 = !DILocation(line: 569, column: 58, scope: !117)
!416 = !DILocation(line: 569, column: 94, scope: !117)
!417 = !DILocation(line: 569, column: 83, scope: !117)
!418 = !DILocation(line: 569, column: 126, scope: !117)
!419 = !DILocation(line: 569, column: 150, scope: !117)
!420 = !DILocation(line: 569, column: 174, scope: !117)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tEnter", scope: !117, file: !34, line: 570, type: !8)
!422 = !DILocation(line: 570, column: 8, scope: !117)
!423 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tExit", scope: !117, file: !34, line: 570, type: !8)
!424 = !DILocation(line: 570, column: 16, scope: !117)
!425 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tMax", scope: !117, file: !34, line: 572, type: !8)
!426 = !DILocation(line: 572, column: 8, scope: !117)
!427 = !DILocation(line: 572, column: 15, scope: !117)
!428 = !DILocation(line: 574, column: 6, scope: !429)
!429 = distinct !DILexicalBlock(scope: !117, file: !34, line: 574, column: 6)
!430 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tExit", arg: 4, scope: !43, file: !34, line: 77, type: !50)
!431 = !DILocation(line: 77, column: 94, scope: !43, inlinedAt: !432)
!432 = distinct !DILocation(line: 574, column: 6, scope: !429)
!433 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tEnter", arg: 3, scope: !43, file: !34, line: 77, type: !50)
!434 = !DILocation(line: 77, column: 76, scope: !43, inlinedAt: !432)
!435 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ray", arg: 1, scope: !43, file: !34, line: 77, type: !37)
!436 = !DILocation(line: 77, column: 42, scope: !43, inlinedAt: !432)
!437 = !DILocation(line: 80, column: 19, scope: !43, inlinedAt: !432)
!438 = !DILocation(line: 80, column: 29, scope: !43, inlinedAt: !432)
!439 = !DILocation(line: 80, column: 15, scope: !43, inlinedAt: !432)
!440 = !DILocation(line: 80, column: 7, scope: !43, inlinedAt: !432)
