#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: 95b781296cf63bc816f12db4db598918.pdb
; shader hash: 95b781296cf63bc816f12db4db598918
;
; Buffer Definitions:
;
; cbuffer g_sceneCB
; {
;
;   struct g_sceneCB
;   {
;
;       struct struct.VolumeRaytracer::VSceneConstantBuffer
;       {
;
;           column_major float4x4 viewMatrixInverted; ; Offset:    0
;           column_major float4x4 projectionMatrixInverted;; Offset:   64
;           float4 cameraPosition;                    ; Offset:  128
;           uint voxelAxisCount;                      ; Offset:  144
;           float volumeExtend;                       ; Offset:  148
;       
;       } g_sceneCB;                                  ; Offset:    0
;
;   
;   } g_sceneCB;                                      ; Offset:    0 Size:   152
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; g_sceneCB                         cbuffer      NA          NA     CB0            cb0     1
; g_envMapSampler                   sampler      NA          NA      S0             s0     1
; g_scene                           texture     i32         ras      T0             t0     1
; g_envMap                          texture     f32        cube      T1             t2     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !33, globals: !140)
!1 = !DIFile(filename: "./DX/Resources/Shaders\5C./DX/Resources/Shaders/Raytracing.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16, !26}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 100, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 100, size: 96, align: 32, elements: !18, templateParams: !23)
!18 = !{!19, !21, !22}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 100, baseType: !20, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 100, baseType: !20, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, line: 100, baseType: !20, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!23 = !{!24, !25}
!24 = !DITemplateTypeParameter(name: "element", type: !20)
!25 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !28, templateParams: !32)
!28 = !{!29, !30, !31}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !27, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !27, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !27, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!32 = !{!13, !25}
!33 = !{!34, !43, !52, !55, !58, !71, !74, !77, !78, !81, !97, !98, !101, !108}
!34 = !DISubprogram(name: "TraceRadianceRay", linkageName: "\01?TraceRadianceRay@@YA?AV?$vector@M$03@@URay@@I@Z", scope: !35, file: !35, line: 56, type: !36, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false)
!35 = !DIFile(filename: "./DX/Resources/Shaders/Raytracing.hlsl", directory: "")
!36 = !DISubroutineType(types: !37)
!37 = !{!4, !38, !42}
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray", file: !35, line: 28, size: 192, align: 32, elements: !39)
!39 = !{!40, !41}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !38, file: !35, line: 30, baseType: !26, size: 96, align: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !38, file: !35, line: 31, baseType: !26, size: 96, align: 32, offset: 96)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !20)
!43 = !DISubprogram(name: "DetermineRayAABBIntersection", linkageName: "\01?DetermineRayAABBIntersection@@YA_NURay@@Y01V?$vector@M$02@@AIAM2@Z", scope: !35, file: !35, line: 77, type: !44, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: false)
!44 = !DISubroutineType(types: !45)
!45 = !{!46, !38, !47, !50, !50}
!46 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 192, align: 32, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 2)
!50 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !8)
!52 = !DISubprogram(name: "WorldSpaceToVoxelSpace", linkageName: "\01?WorldSpaceToVoxelSpace@@YA?AV?$vector@I$02@@V?$vector@M$02@@@Z", scope: !35, file: !35, line: 102, type: !53, isLocal: false, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: false)
!53 = !DISubroutineType(types: !54)
!54 = !{!16, !26}
!55 = !DISubprogram(name: "VoxelIndexToWorldSpace", linkageName: "\01?VoxelIndexToWorldSpace@@YA?AV?$vector@M$02@@V?$vector@I$02@@@Z", scope: !35, file: !35, line: 110, type: !56, isLocal: false, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: false)
!56 = !DISubroutineType(types: !57)
!57 = !{!26, !16}
!58 = !DISubprogram(name: "GoToNextVoxel", linkageName: "\01?GoToNextVoxel@@YA?AV?$vector@I$02@@URay@@MV1@V?$vector@H$02@@AIAMAIAV?$vector@M$02@@@Z", scope: !35, file: !35, line: 118, type: !59, isLocal: false, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: false)
!59 = !DISubroutineType(types: !60)
!60 = !{!16, !38, !8, !16, !61, !50, !69}
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 80, baseType: !62)
!62 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 80, size: 96, align: 32, elements: !63, templateParams: !67)
!63 = !{!64, !65, !66}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !62, file: !1, line: 80, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !62, file: !1, line: 80, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !62, file: !1, line: 80, baseType: !15, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!67 = !{!68, !25}
!68 = !DITemplateTypeParameter(name: "element", type: !15)
!69 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !26)
!71 = !DISubprogram(name: "GetPositionAlongRay", linkageName: "\01?GetPositionAlongRay@@YA?AV?$vector@M$02@@URay@@M@Z", scope: !35, file: !35, line: 175, type: !72, isLocal: false, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: false)
!72 = !DISubroutineType(types: !73)
!73 = !{!26, !38, !8}
!74 = !DISubprogram(name: "IsValidVoxelIndex", linkageName: "\01?IsValidVoxelIndex@@YA_NV?$vector@I$02@@@Z", scope: !35, file: !35, line: 180, type: !75, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: false)
!75 = !DISubroutineType(types: !76)
!76 = !{!46, !16}
!77 = !DISubprogram(name: "IsSolid", linkageName: "\01?IsSolid@@YA_NV?$vector@I$02@@@Z", scope: !35, file: !35, line: 185, type: !75, isLocal: false, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: false)
!78 = !DISubprogram(name: "VRRaygen", linkageName: "\01?VRRaygen@@YAXXZ", scope: !35, file: !35, line: 191, type: !79, isLocal: false, isDefinition: true, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?VRRaygen@@YAXXZ")
!79 = !DISubroutineType(types: !80)
!80 = !{null}
!81 = !DISubprogram(name: "VRClosestHit", linkageName: "\01?VRClosestHit@@YAXUVRayPayload@VolumeRaytracer@@UVPrimitiveAttributes@2@@Z", scope: !35, file: !35, line: 202, type: !82, isLocal: false, isDefinition: true, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: false, function: void (%"struct.VolumeRaytracer::VRayPayload"*, %"struct.VolumeRaytracer::VPrimitiveAttributes"*)* @"\01?VRClosestHit@@YAXUVRayPayload@VolumeRaytracer@@UVPrimitiveAttributes@2@@Z")
!82 = !DISubroutineType(types: !83)
!83 = !{null, !84, !93}
!84 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !85)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "VRayPayload", scope: !87, file: !86, line: 38, size: 160, align: 32, elements: !88)
!86 = !DIFile(filename: "./DX/Resources/Shaders/RaytracingHlsl.h", directory: "")
!87 = !DINamespace(name: "VolumeRaytracer", scope: null, file: !86, line: 31)
!88 = !{!89, !91}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !85, file: !86, line: 40, baseType: !90, size: 128, align: 32)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !86, line: 20, baseType: !4)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !85, file: !86, line: 41, baseType: !92, size: 32, align: 32, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !86, line: 23, baseType: !42)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "VPrimitiveAttributes", scope: !87, file: !86, line: 33, size: 96, align: 32, elements: !94)
!94 = !{!95}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !93, file: !86, line: 35, baseType: !96, size: 96, align: 32)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !86, line: 19, baseType: !26)
!97 = !DISubprogram(name: "VRIntersection", linkageName: "\01?VRIntersection@@YAXXZ", scope: !35, file: !35, line: 208, type: !79, isLocal: false, isDefinition: true, scopeLine: 209, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?VRIntersection@@YAXXZ")
!98 = !DISubprogram(name: "VRMiss", linkageName: "\01?VRMiss@@YAXUVRayPayload@VolumeRaytracer@@@Z", scope: !35, file: !35, line: 270, type: !99, isLocal: false, isDefinition: true, scopeLine: 271, flags: DIFlagPrototyped, isOptimized: false, function: void (%"struct.VolumeRaytracer::VRayPayload"*)* @"\01?VRMiss@@YAXUVRayPayload@VolumeRaytracer@@@Z")
!99 = !DISubroutineType(types: !100)
!100 = !{null, !84}
!101 = !DISubprogram(name: "VRMissShadowRay", linkageName: "\01?VRMissShadowRay@@YAXUVShadowRayPayload@VolumeRaytracer@@@Z", scope: !35, file: !35, line: 282, type: !102, isLocal: false, isDefinition: true, scopeLine: 283, flags: DIFlagPrototyped, isOptimized: false, function: void (%"struct.VolumeRaytracer::VShadowRayPayload"*)* @"\01?VRMissShadowRay@@YAXUVShadowRayPayload@VolumeRaytracer@@@Z")
!102 = !DISubroutineType(types: !103)
!103 = !{null, !104}
!104 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !105)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "VShadowRayPayload", scope: !87, file: !86, line: 44, size: 32, align: 32, elements: !106)
!106 = !{!107}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !105, file: !86, line: 46, baseType: !46, size: 32, align: 32)
!108 = !DISubprogram(name: "GenerateCameraRay", linkageName: "\01?GenerateCameraRay@@YA?AURay@@V?$vector@I$01@@V?$vector@M$02@@V?$matrix@M$03$03@@2@Z", scope: !35, file: !35, line: 34, type: !109, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!109 = !DISubroutineType(types: !110)
!110 = !{!38, !111, !26, !118, !118}
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 25, baseType: !112)
!112 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 25, size: 64, align: 32, elements: !113, templateParams: !116)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !112, file: !1, line: 25, baseType: !20, size: 32, align: 32, flags: DIFlagPublic)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !112, file: !1, line: 25, baseType: !20, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!116 = !{!24, !117}
!117 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 25, baseType: !119)
!119 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 25, size: 512, align: 32, elements: !120, templateParams: !137)
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !119, file: !1, line: 25, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !119, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !119, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !119, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !119, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !119, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !119, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !119, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !119, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !119, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !119, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !119, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !119, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !119, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !119, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !119, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!137 = !{!13, !138, !139}
!138 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!139 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!140 = !{!141, !143, !145, !147, !152, !154, !157, !161, !163, !165, !167, !169, !171, !173, !175, !177}
!141 = !DIGlobalVariable(name: "RAY_FLAG_CULL_BACK_FACING_TRIANGLES", scope: !0, file: !1, line: 72, type: !142, isLocal: true, isDefinition: true, variable: i32 16)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!143 = !DIGlobalVariable(name: "FLT_INFINITY", scope: !43, file: !35, line: 82, type: !144, isLocal: true, isDefinition: true)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!145 = !DIGlobalVariable(name: "BackgroundColor", linkageName: "\01?BackgroundColor@VolumeRaytracer@@3V?$vector@M$03@@B", scope: !87, file: !86, line: 58, type: !146, isLocal: true, isDefinition: true)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!147 = !DIGlobalVariable(name: "CubeNormals", linkageName: "\01?CubeNormals@VolumeRaytracer@@3QBV?$vector@M$02@@B", scope: !87, file: !86, line: 59, type: !148, isLocal: true, isDefinition: true)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 576, align: 32, elements: !150)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!150 = !{!151}
!151 = !DISubrange(count: 6)
!152 = !DIGlobalVariable(name: "g_scene", linkageName: "\01?g_scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !35, line: 19, type: !153, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?g_scene@@3URaytracingAccelerationStructure@@A")
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 19, size: 32, align: 32, elements: !2)
!154 = !DIGlobalVariable(name: "g_voxelVolume", linkageName: "\01?g_voxelVolume@@3V?$Texture3D@M@@A", scope: !0, file: !35, line: 20, type: !155, isLocal: false, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture3D<float>", file: !1, line: 20, size: 64, align: 32, elements: !2, templateParams: !156)
!156 = !{!13}
!157 = !DIGlobalVariable(name: "g_envMap", linkageName: "\01?g_envMap@@3V?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !35, line: 22, type: !158, isLocal: false, isDefinition: true, variable: %"class.TextureCube<vector<float, 4> >"* @"\01?g_envMap@@3V?$TextureCube@V?$vector@M$03@@@@A")
!158 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 22, size: 128, align: 32, elements: !2, templateParams: !159)
!159 = !{!160}
!160 = !DITemplateTypeParameter(name: "element", type: !5)
!161 = !DIGlobalVariable(name: "g_envMapSampler", linkageName: "\01?g_envMapSampler@@3USamplerState@@A", scope: !0, file: !35, line: 23, type: !162, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?g_envMapSampler@@3USamplerState@@A")
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 23, size: 32, align: 32, elements: !2)
!163 = !DIGlobalVariable(name: "g_renderTarget", linkageName: "\01?g_renderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !35, line: 25, type: !164, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?g_renderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!164 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 25, size: 128, align: 32, elements: !2, templateParams: !159)
!165 = !DIGlobalVariable(name: "BackgroundColor.0", linkageName: "\01?BackgroundColor@VolumeRaytracer@@3V?$vector@M$03@@B.0", scope: !87, file: !86, line: 58, type: !166, isLocal: false, isDefinition: true)
!166 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !146, size: 32, align: 4)
!167 = !DIGlobalVariable(name: "BackgroundColor.1", linkageName: "\01?BackgroundColor@VolumeRaytracer@@3V?$vector@M$03@@B.1", scope: !87, file: !86, line: 58, type: !168, isLocal: false, isDefinition: true)
!168 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !146, size: 32, align: 4, offset: 32)
!169 = !DIGlobalVariable(name: "BackgroundColor.2", linkageName: "\01?BackgroundColor@VolumeRaytracer@@3V?$vector@M$03@@B.2", scope: !87, file: !86, line: 58, type: !170, isLocal: false, isDefinition: true)
!170 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !146, size: 32, align: 4, offset: 64)
!171 = !DIGlobalVariable(name: "BackgroundColor.3", linkageName: "\01?BackgroundColor@VolumeRaytracer@@3V?$vector@M$03@@B.3", scope: !87, file: !86, line: 58, type: !172, isLocal: false, isDefinition: true)
!172 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !146, size: 32, align: 4, offset: 96)
!173 = !DIGlobalVariable(name: "CubeNormals.0", linkageName: "\01?CubeNormals@VolumeRaytracer@@3QBV?$vector@M$02@@B.0", scope: !87, file: !86, line: 59, type: !174, isLocal: false, isDefinition: true)
!174 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !148, size: 192, align: 4)
!175 = !DIGlobalVariable(name: "CubeNormals.1", linkageName: "\01?CubeNormals@VolumeRaytracer@@3QBV?$vector@M$02@@B.1", scope: !87, file: !86, line: 59, type: !176, isLocal: false, isDefinition: true)
!176 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !148, size: 192, align: 4, offset: 192)
!177 = !DIGlobalVariable(name: "CubeNormals.2", linkageName: "\01?CubeNormals@VolumeRaytracer@@3QBV?$vector@M$02@@B.2", scope: !87, file: !86, line: 59, type: !178, isLocal: false, isDefinition: true)
!178 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !148, size: 192, align: 4, offset: 384)
!179 = !{i32 2, !"Dwarf Version", i32 4}
!180 = !{i32 2, !"Debug Info Version", i32 3}
!181 = !{!"dxc 1.2"}
!182 = !{!"./DX/Resources/Shaders/Raytracing.hlsl", !"/*\0D\0A\09Copyright (c) 2020 Thomas Sch\C3\B6ngrundner\0D\0A\0D\0A\09Permission is hereby granted, free of charge, to any person obtaining a copy\0D\0A\09of this software and associated documentation files (the \22Software\22), to deal\0D\0A\09in the Software without restriction, including without limitation the rights\0D\0A\09to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\0D\0A\09copies of the Software, and to permit persons to whom the Software is\0D\0A\09furnished to do so, subject to the following conditions:\0D\0A\0D\0A\09The above copyright notice and this permission notice shall be included in all\0D\0A\09copies or substantial portions of the Software.\0D\0A*/\0D\0A\0D\0A#define HLSL\0D\0A\0D\0A#include \22RaytracingHlsl.h\22\0D\0A\0D\0ARaytracingAccelerationStructure g_scene : register(t0, space0);\0D\0ATexture3D<float> g_voxelVolume : register(t1, space0);\0D\0A\0D\0ATextureCube g_envMap : register(t2, space0);\0D\0ASamplerState g_envMapSampler : register(s0);\0D\0A\0D\0ARWTexture2D<float4> g_renderTarget : register(u0);\0D\0AConstantBuffer<VolumeRaytracer::VSceneConstantBuffer> g_sceneCB : register(b0);\0D\0A\0D\0Astruct Ray\0D\0A{\0D\0A\09float3 origin;\0D\0A\09float3 direction;\0D\0A};\0D\0A\0D\0Ainline Ray GenerateCameraRay(uint2 index, in float3 cameraPosition, in float4x4 viewInverted, in float4x4 projInverted)\0D\0A{\0D\0A\09float2 xy = index + 0.5f; // center in the middle of the pixel.\0D\0A\09float2 screenPos = xy / DispatchRaysDimensions().xy * 2.0 - 1.0;\0D\0A\0D\0A\09// Invert Y for DirectX-style coordinates.\0D\0A\09//screenPos.y = -screenPos.y;\0D\0A\0D\0A\09// Unproject the pixel coordinate into a world positon.\0D\0A\09//float4 world = mul(float4(screenPos, 0, 1), projectionToWorld);\0D\0A\09//world.xyz /= world.w;\0D\0A\0D\0A\09Ray ray;\0D\0A\09//ray.origin = cameraPosition;\0D\0A\09ray.origin = mul(viewInverted, float4(0,0,0,1)).xyz;\0D\0A\0D\0A\09float4 target = mul(projInverted, float4(screenPos.x, -screenPos.y, 1, 1));\0D\0A\09ray.direction = mul(viewInverted, float4(target.xyz, 0)).xyz;\0D\0A\0D\0A\09return ray;\0D\0A}\0D\0A\0D\0Afloat4 TraceRadianceRay(in Ray ray, in uint currentRayRecursionDepth)\0D\0A{\0D\0A\09if (currentRayRecursionDepth >= MAX_RAY_RECURSION_DEPTH)\0D\0A\09{\0D\0A\09\09return float4(0,0,0,0);\0D\0A\09}\0D\0A\0D\0A\09RayDesc rayDesc;\0D\0A\09rayDesc.Origin = ray.origin;\0D\0A\09rayDesc.Direction = ray.direction;\0D\0A\0D\0A\09rayDesc.TMin = 0;\0D\0A\09rayDesc.TMax = 10000;\0D\0A\0D\0A\09VolumeRaytracer::VRayPayload rayPayload = { float4(0,0,0,0), currentRayRecursionDepth + 1 };\0D\0A\0D\0A\09TraceRay(g_scene, RAY_FLAG_CULL_BACK_FACING_TRIANGLES, 0xff, 0, 2, 0, rayDesc, rayPayload);\0D\0A\0D\0A\09return rayPayload.color;\0D\0A}\0D\0A\0D\0Abool DetermineRayAABBIntersection(in Ray ray, in float3 aabb[2], out float tEnter, out float tExit)\0D\0A{\0D\0A\09float3 tmin3, tmax3;\0D\0A\09int3 sign3 = ray.direction > 0;\0D\0A\0D\0A\09const float FLT_INFINITY = 1.#INF;\0D\0A\09float3 invRayDirection = ray.direction != 0\0D\0A\09\09? 1 / ray.direction\0D\0A\09\09: (ray.direction > 0) ? FLT_INFINITY : -FLT_INFINITY;\0D\0A\0D\0A\09tmin3.x = (aabb[1 - sign3.x].x - ray.origin.x) * invRayDirection.x;\0D\0A\09tmax3.x = (aabb[sign3.x].x - ray.origin.x) * invRayDirection.x;\0D\0A\0D\0A\09tmin3.y = (aabb[1 - sign3.y].y - ray.origin.y) * invRayDirection.y;\0D\0A\09tmax3.y = (aabb[sign3.y].y - ray.origin.y) * invRayDirection.y;\0D\0A\0D\0A\09tmin3.z = (aabb[1 - sign3.z].z - ray.origin.z) * invRayDirection.z;\0D\0A\09tmax3.z = (aabb[sign3.z].z - ray.origin.z) * invRayDirection.z;\0D\0A\0D\0A\09tEnter = max(max(tmin3.x, tmin3.y), tmin3.z);\0D\0A\09tExit = min(min(tmax3.x, tmax3.y), tmax3.z);\0D\0A\0D\0A\09return tExit > tEnter && tExit >= RayTMin() && tEnter <= RayTCurrent();\0D\0A}\0D\0A\0D\0Auint3 WorldSpaceToVoxelSpace(in float3 worldLocation)\0D\0A{\0D\0A\09float3 relativeVolumePos = worldLocation - g_sceneCB.volumeExtend;\0D\0A\09float distanceBetweenVoxel = (g_sceneCB.volumeExtend * 2) / g_sceneCB.voxelAxisCount;\0D\0A\0D\0A\09return uint3(relativeVolumePos.x / distanceBetweenVoxel, relativeVolumePos.y / distanceBetweenVoxel, relativeVolumePos.z / distanceBetweenVoxel);\0D\0A}\0D\0A\0D\0Afloat3 VoxelIndexToWorldSpace(in uint3 voxelIndex)\0D\0A{\0D\0A\09float distanceBetweenVoxel = (g_sceneCB.volumeExtend * 2) / g_sceneCB.voxelAxisCount;\0D\0A\09float3 voxelIndexF = voxelIndex;\0D\0A\0D\0A\09return voxelIndexF * distanceBetweenVoxel + distanceBetweenVoxel * 0.5f - g_sceneCB.volumeExtend;\0D\0A}\0D\0A\0D\0Auint3 GoToNextVoxel(in Ray ray, in float currentT, in uint3 voxelIndex, in int3 direction, out float newT, out float3 voxelFaceNormal)\0D\0A{\0D\0A\09float maxX, maxY, maxZ = 100000;\0D\0A\09float3 voxelMax = VoxelIndexToWorldSpace(voxelIndex) + ((g_sceneCB.volumeExtend * 2) / g_sceneCB.voxelAxisCount) * 0.5f;\0D\0A\09uint3 res = voxelIndex;\0D\0A\0D\0A\09if (ray.direction.x != 0)\0D\0A\09{\0D\0A\09\09maxX = (voxelMax.x - ray.origin.x) / ray.direction.x;\0D\0A\09}\0D\0A\0D\0A\09if (ray.direction.y != 0)\0D\0A\09{\0D\0A\09\09maxY = (voxelMax.y - ray.origin.y) / ray.direction.y;\0D\0A\09}\0D\0A\0D\0A\09if (ray.direction.z != 0)\0D\0A\09{\0D\0A\09\09maxZ = (voxelMax.z - ray.origin.z) / ray.direction.z;\0D\0A\09}\0D\0A\0D\0A\09if (maxX < maxY)\0D\0A\09{\0D\0A\09\09if (maxX < maxZ)\0D\0A\09\09{\0D\0A\09\09\09res.x += direction.x;\0D\0A\09\09\09newT = maxX;\0D\0A\09\09\09voxelFaceNormal = VolumeRaytracer::CubeNormals[0] * -direction.x;\0D\0A\09\09}\0D\0A\09\09else\0D\0A\09\09{\0D\0A\09\09\09res.z += direction.z;\0D\0A\09\09\09newT = maxZ;\0D\0A\09\09\09voxelFaceNormal = VolumeRaytracer::CubeNormals[4] * -direction.z;\0D\0A\09\09}\0D\0A\09}\0D\0A\09else\0D\0A\09{\0D\0A\09\09if (maxY < maxZ)\0D\0A\09\09{\0D\0A\09\09\09res.y += direction.y;\0D\0A\09\09\09newT = maxY;\0D\0A\09\09\09voxelFaceNormal = VolumeRaytracer::CubeNormals[2] * -direction.y;\0D\0A\09\09}\0D\0A\09\09else\0D\0A\09\09{\0D\0A\09\09\09res.z += direction.z;\0D\0A\09\09\09newT = maxZ;\0D\0A\09\09\09voxelFaceNormal = VolumeRaytracer::CubeNormals[4] * -direction.z;\0D\0A\09\09}\0D\0A\09}\0D\0A\0D\0A\09return res;\0D\0A}\0D\0A\0D\0A\0D\0A\0D\0Afloat3 GetPositionAlongRay(in Ray ray, in float t)\0D\0A{\0D\0A\09return ray.origin + ray.direction * t;\0D\0A}\0D\0A\0D\0Abool IsValidVoxelIndex(in uint3 index)\0D\0A{\0D\0A\09return index.x < g_sceneCB.voxelAxisCount && index.y < g_sceneCB.voxelAxisCount && index.z < g_sceneCB.voxelAxisCount;\0D\0A}\0D\0A\0D\0Abool IsSolid(in uint3 index)\0D\0A{\0D\0A\09return g_voxelVolume[index].r > 0;\0D\0A}\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid VRRaygen()\0D\0A{\0D\0A\09Ray ray = GenerateCameraRay(DispatchRaysIndex().xy, g_sceneCB.cameraPosition.xyz, g_sceneCB.viewMatrixInverted, g_sceneCB.projectionMatrixInverted);\0D\0A\0D\0A\09uint currentRecursionDepth = 0;\0D\0A\09float4 color = TraceRadianceRay(ray, currentRecursionDepth);\0D\0A\0D\0A\09g_renderTarget[DispatchRaysIndex().xy] = color;\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid VRClosestHit(inout VolumeRaytracer::VRayPayload rayPayload, in VolumeRaytracer::VPrimitiveAttributes attr)\0D\0A{\0D\0A\09rayPayload.color = float4(abs((attr.normal + 1) * 0.5), 1);\0D\0A}\0D\0A\0D\0A[shader(\22intersection\22)]\0D\0Avoid VRIntersection()\0D\0A{\0D\0A\09Ray ray;\0D\0A\0D\0A\09ray.origin = WorldRayOrigin();\0D\0A\09ray.direction = WorldRayDirection();\0D\0A\0D\0A\09//Check if we intersect voxel volume\0D\0A\09float3 volumeAABB[2] = {float3(-g_sceneCB.volumeExtend, -g_sceneCB.volumeExtend, -g_sceneCB.volumeExtend), float3(g_sceneCB.volumeExtend, g_sceneCB.volumeExtend, g_sceneCB.volumeExtend)};\0D\0A\09float tEnter, tExit;\0D\0A\0D\0A\09if (DetermineRayAABBIntersection(ray, volumeAABB, tEnter, tExit))\0D\0A\09{\0D\0A\09\09/*int3 voxelDir = sign(ray.direction);\0D\0A\09\09uint3 voxelPos;\0D\0A\09\09float3 hitNormal = -ray.direction;\0D\0A\0D\0A\09\09if (tEnter >= 0)\0D\0A\09\09{\0D\0A\09\09\09voxelPos = WorldSpaceToVoxelSpace(GetPositionAlongRay(ray, tEnter));\0D\0A\09\09}\0D\0A\09\09else\0D\0A\09\09{\0D\0A\09\09\09voxelPos = WorldSpaceToVoxelSpace(ray.origin);\0D\0A\09\09}\0D\0A\0D\0A\09\09tExit = tEnter;\0D\0A\0D\0A\09\09while (IsValidVoxelIndex(voxelPos) && !IsSolid(voxelPos))\0D\0A\09\09{\0D\0A\09\09\09tEnter = tExit;\0D\0A\09\09\09voxelPos = GoToNextVoxel(ray, tEnter, voxelPos, voxelDir, tExit, hitNormal);\0D\0A\09\09}\0D\0A\0D\0A\09\09if (IsValidVoxelIndex(voxelPos) && IsSolid(voxelPos))\0D\0A\09\09{\0D\0A\09\09\09VolumeRaytracer::VPrimitiveAttributes attr;\0D\0A\09\09\09attr.normal = hitNormal;\0D\0A\0D\0A\09\09\09ReportHit(tEnter, 0, attr);\0D\0A\09\09}*/\0D\0A\0D\0A\09\09VolumeRaytracer::VPrimitiveAttributes attr;\0D\0A\09\09attr.normal = float3(0, 1, 0);\0D\0A\0D\0A\09\09ReportHit(tEnter, 0, attr);\0D\0A\09}\0D\0A\09//else\0D\0A\09//{\0D\0A\09//\09VolumeRaytracer::VPrimitiveAttributes attr;\0D\0A\09//\09attr.normal = float3(1, 0, 0);\0D\0A\0D\0A\09//\09ReportHit(RayTCurrent(), 0, attr);\0D\0A\09//}\0D\0A\0D\0A\09//VolumeRaytracer::VPrimitiveAttributes attr;\0D\0A\09//attr.normal = float3(1, 0, 0);\0D\0A\0D\0A\09//ReportHit(RayTCurrent(), 0, attr);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid VRMiss(inout VolumeRaytracer::VRayPayload rayPayload)\0D\0A{\0D\0A\09float3 rayDirection = WorldRayDirection();\0D\0A\09/*float3 worldX = float3(1,0,0);\0D\0A\09float yawCos = dot(rayDirection, worldX);\0D\0A\0D\0A\09rayPayload.color = float4(abs(yawCos), 0, 0, 1);*/\0D\0A\0D\0A\09rayPayload.color = g_envMap.SampleLevel(g_envMapSampler, rayDirection.xzy, 0);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid VRMissShadowRay(inout VolumeRaytracer::VShadowRayPayload rayPayload)\0D\0A{\0D\0A\09rayPayload.hit = false;\0D\0A}"}
!183 = !{!"./DX/Resources/Shaders/RaytracingHlsl.h", !"/*\0D\0A\09Copyright (c) 2020 Thomas Sch\C3\B6ngrundner\0D\0A\0D\0A\09Permission is hereby granted, free of charge, to any person obtaining a copy\0D\0A\09of this software and associated documentation files (the \22Software\22), to deal\0D\0A\09in the Software without restriction, including without limitation the rights\0D\0A\09to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\0D\0A\09copies of the Software, and to permit persons to whom the Software is\0D\0A\09furnished to do so, subject to the following conditions:\0D\0A\0D\0A\09The above copyright notice and this permission notice shall be included in all\0D\0A\09copies or substantial portions of the Software.\0D\0A*/\0D\0A\0D\0A#pragma once\0D\0A\0D\0A#ifdef HLSL\0D\0Atypedef float2 XMFLOAT2;\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A#else\0D\0A\09#include <DirectXMath.h>\0D\0A\09using namespace DirectX;\0D\0A#endif\0D\0A\0D\0A#define MAX_RAY_RECURSION_DEPTH 3\0D\0A\0D\0Anamespace VolumeRaytracer\0D\0A{\0D\0A\09struct VPrimitiveAttributes\0D\0A\09{\0D\0A\09\09XMFLOAT3 normal;\0D\0A\09};\0D\0A\0D\0A\09struct VRayPayload\0D\0A\09{\0D\0A\09\09XMFLOAT4 color;\0D\0A\09\09UINT depth;\0D\0A\09};\0D\0A\0D\0A\09struct VShadowRayPayload\0D\0A\09{\0D\0A\09\09bool hit;\0D\0A\09};\0D\0A\0D\0A\09struct VSceneConstantBuffer\0D\0A\09{\0D\0A\09\09XMMATRIX viewMatrixInverted;\0D\0A\09\09XMMATRIX projectionMatrixInverted;\0D\0A\09\09XMVECTOR cameraPosition;\0D\0A\09\09UINT voxelAxisCount;\0D\0A\09\09float volumeExtend;\0D\0A\09};\0D\0A\0D\0A\09static const XMFLOAT4 BackgroundColor = XMFLOAT4(0.8f, 0.9f, 1.0f, 1.0f);\0D\0A\09static const XMFLOAT3 CubeNormals[] = {\0D\0A\09\09XMFLOAT3(1.0f, 0.0f, 0.0f),\0D\0A\09\09XMFLOAT3(-1.0f, 0.0f, 0.0f),\0D\0A\09\09XMFLOAT3(0.0f, 1.0f, 0.0f),\0D\0A\09\09XMFLOAT3(0.0f, -1.0f, 0.0f),\0D\0A\09\09XMFLOAT3(0.0f, 0.0f, 1.0f),\0D\0A\09\09XMFLOAT3(0.0f, 0.0f, -1.0f)\0D\0A\09};\0D\0A}"}
!184 = !{!"./DX/Resources/Shaders/Raytracing.hlsl"}
!185 = !{!"-Zi", !"-Od", !"-Fo", !"./DX/Resources/Shaders/Compiled/Raytracing.cso", !"-T", !"lib_6_3"}
!186 = !{i32 1, i32 3}
!187 = !{i32 1, i32 5}
!188 = !{!"lib", i32 6, i32 3}
!189 = !{!190, !195, !197, !199}
!190 = !{!191, !193}
!191 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?g_scene@@3URaytracingAccelerationStructure@@A", !"g_scene", i32 0, i32 0, i32 1, i32 16, i32 0, !192}
!192 = !{i32 0, i32 4}
!193 = !{i32 1, %"class.TextureCube<vector<float, 4> >"* @"\01?g_envMap@@3V?$TextureCube@V?$vector@M$03@@@@A", !"g_envMap", i32 0, i32 2, i32 1, i32 5, i32 0, !194}
!194 = !{i32 0, i32 9}
!195 = !{!196}
!196 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?g_renderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"g_renderTarget", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !194}
!197 = !{!198}
!198 = !{i32 0, %g_sceneCB* @g_sceneCB, !"g_sceneCB", i32 0, i32 0, i32 1, i32 152, null}
!199 = !{!200}
!200 = !{i32 0, %struct.SamplerState* @"\01?g_envMapSampler@@3USamplerState@@A", !"g_envMapSampler", i32 0, i32 0, i32 1, i32 0, null}
!201 = !{i32 0, %struct.RaytracingAccelerationStructure undef, !202, %"class.Texture3D<float>" undef, !204, %"class.Texture3D<float>::mips_type" undef, !207, %"class.TextureCube<vector<float, 4> >" undef, !209, %"class.RWTexture2D<vector<float, 4> >" undef, !209, %"struct.VolumeRaytracer::VSceneConstantBuffer" undef, !210, %struct.Ray undef, !217, %struct.RayDesc undef, !220, %"struct.VolumeRaytracer::VRayPayload" undef, !225, %"struct.VolumeRaytracer::VPrimitiveAttributes" undef, !228, %"struct.VolumeRaytracer::VShadowRayPayload" undef, !230, %g_sceneCB undef, !232}
!202 = !{i32 4, !203}
!203 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!204 = !{i32 20, !205, !206}
!205 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!206 = !{i32 6, !"mips", i32 3, i32 16}
!207 = !{i32 4, !208}
!208 = !{i32 6, !"handle", i32 3, i32 0, i32 7, i32 5}
!209 = !{i32 16, !205}
!210 = !{i32 152, !211, !213, !214, !215, !216}
!211 = !{i32 6, !"viewMatrixInverted", i32 2, !212, i32 3, i32 0, i32 7, i32 9}
!212 = !{i32 4, i32 4, i32 2}
!213 = !{i32 6, !"projectionMatrixInverted", i32 2, !212, i32 3, i32 64, i32 7, i32 9}
!214 = !{i32 6, !"cameraPosition", i32 3, i32 128, i32 7, i32 9}
!215 = !{i32 6, !"voxelAxisCount", i32 3, i32 144, i32 7, i32 5}
!216 = !{i32 6, !"volumeExtend", i32 3, i32 148, i32 7, i32 9}
!217 = !{i32 28, !218, !219}
!218 = !{i32 6, !"origin", i32 3, i32 0, i32 7, i32 9}
!219 = !{i32 6, !"direction", i32 3, i32 16, i32 7, i32 9}
!220 = !{i32 32, !221, !222, !223, !224}
!221 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!222 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!223 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!224 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!225 = !{i32 20, !226, !227}
!226 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!227 = !{i32 6, !"depth", i32 3, i32 16, i32 7, i32 5}
!228 = !{i32 12, !229}
!229 = !{i32 6, !"normal", i32 3, i32 0, i32 7, i32 9}
!230 = !{i32 4, !231}
!231 = !{i32 6, !"hit", i32 3, i32 0, i32 7, i32 1}
!232 = !{i32 152, !233}
!233 = !{i32 6, !"g_sceneCB", i32 3, i32 0}
!234 = !{i32 1, void ()* @"\01?VRRaygen@@YAXXZ", !235, void (%"struct.VolumeRaytracer::VRayPayload"*, %"struct.VolumeRaytracer::VPrimitiveAttributes"*)* @"\01?VRClosestHit@@YAXUVRayPayload@VolumeRaytracer@@UVPrimitiveAttributes@2@@Z", !237, void ()* @"\01?VRIntersection@@YAXXZ", !235, void (%"struct.VolumeRaytracer::VRayPayload"*)* @"\01?VRMiss@@YAXUVRayPayload@VolumeRaytracer@@@Z", !240, void (%"struct.VolumeRaytracer::VShadowRayPayload"*)* @"\01?VRMissShadowRay@@YAXUVShadowRayPayload@VolumeRaytracer@@@Z", !240}
!235 = !{!236}
!236 = !{i32 1, !2, !2}
!237 = !{!236, !238, !239}
!238 = !{i32 2, !2, !2}
!239 = !{i32 0, !2, !2}
!240 = !{!236, !238}
!241 = !{null, !"", null, !189, !242}
!242 = !{i32 0, i64 65537}
!243 = !{void (%"struct.VolumeRaytracer::VRayPayload"*, %"struct.VolumeRaytracer::VPrimitiveAttributes"*)* @"\01?VRClosestHit@@YAXUVRayPayload@VolumeRaytracer@@UVPrimitiveAttributes@2@@Z", !"\01?VRClosestHit@@YAXUVRayPayload@VolumeRaytracer@@UVPrimitiveAttributes@2@@Z", null, null, !244}
!244 = !{i32 8, i32 10, i32 6, i32 20, i32 7, i32 12, i32 5, !245}
!245 = !{i32 0}
!246 = !{void ()* @"\01?VRIntersection@@YAXXZ", !"\01?VRIntersection@@YAXXZ", null, null, !247}
!247 = !{i32 8, i32 8, i32 5, !245}
!248 = !{void (%"struct.VolumeRaytracer::VRayPayload"*)* @"\01?VRMiss@@YAXUVRayPayload@VolumeRaytracer@@@Z", !"\01?VRMiss@@YAXUVRayPayload@VolumeRaytracer@@@Z", null, null, !249}
!249 = !{i32 8, i32 11, i32 6, i32 20, i32 5, !245}
!250 = !{void (%"struct.VolumeRaytracer::VShadowRayPayload"*)* @"\01?VRMissShadowRay@@YAXUVShadowRayPayload@VolumeRaytracer@@@Z", !"\01?VRMissShadowRay@@YAXUVShadowRayPayload@VolumeRaytracer@@@Z", null, null, !251}
!251 = !{i32 8, i32 11, i32 6, i32 4, i32 5, !245}
!252 = !{void ()* @"\01?VRRaygen@@YAXXZ", !"\01?VRRaygen@@YAXXZ", null, null, !253}
!253 = !{i32 8, i32 7, i32 5, !245}
!254 = !DILocation(line: 193, column: 124, scope: !78)
!255 = !DILocation(line: 193, column: 94, scope: !78)
!256 = !DILocation(line: 193, column: 54, scope: !78)
!257 = !DILocation(line: 193, column: 30, scope: !78)
!258 = !DILocation(line: 193, column: 12, scope: !78)
!259 = !DILocation(line: 36, column: 14, scope: !108, inlinedAt: !260)
!260 = distinct !DILocation(line: 193, column: 12, scope: !78)
!261 = !DILocation(line: 36, column: 20, scope: !108, inlinedAt: !260)
!262 = !DILocation(line: 36, column: 9, scope: !108, inlinedAt: !260)
!263 = !DILocation(line: 37, column: 21, scope: !108, inlinedAt: !260)
!264 = !DILocation(line: 37, column: 26, scope: !108, inlinedAt: !260)
!265 = !DILocation(line: 37, column: 24, scope: !108, inlinedAt: !260)
!266 = !DILocation(line: 37, column: 54, scope: !108, inlinedAt: !260)
!267 = !DILocation(line: 37, column: 60, scope: !108, inlinedAt: !260)
!268 = !DILocation(line: 37, column: 9, scope: !108, inlinedAt: !260)
!269 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !108, file: !35, line: 46, type: !38)
!270 = !DIExpression(DW_OP_bit_piece, 0, 96)
!271 = !DILocation(line: 46, column: 6, scope: !108, inlinedAt: !260)
!272 = !DIExpression(DW_OP_bit_piece, 96, 96)
!273 = !DILocation(line: 48, column: 19, scope: !108, inlinedAt: !260)
!274 = !DILocation(line: 48, column: 15, scope: !108, inlinedAt: !260)
!275 = !DILocation(line: 48, column: 13, scope: !108, inlinedAt: !260)
!276 = !DILocation(line: 50, column: 43, scope: !108, inlinedAt: !260)
!277 = !DILocation(line: 50, column: 57, scope: !108, inlinedAt: !260)
!278 = !DILocation(line: 50, column: 56, scope: !108, inlinedAt: !260)
!279 = !DILocation(line: 50, column: 22, scope: !108, inlinedAt: !260)
!280 = !DILocation(line: 50, column: 18, scope: !108, inlinedAt: !260)
!281 = !DILocation(line: 50, column: 9, scope: !108, inlinedAt: !260)
!282 = !DILocation(line: 51, column: 43, scope: !108, inlinedAt: !260)
!283 = !DILocation(line: 51, column: 22, scope: !108, inlinedAt: !260)
!284 = !DILocation(line: 51, column: 18, scope: !108, inlinedAt: !260)
!285 = !DILocation(line: 51, column: 16, scope: !108, inlinedAt: !260)
!286 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currentRecursionDepth", scope: !78, file: !35, line: 195, type: !42)
!287 = !DIExpression()
!288 = !DILocation(line: 195, column: 7, scope: !78)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "color", scope: !78, file: !35, line: 196, type: !4)
!290 = !DILocation(line: 196, column: 9, scope: !78)
!291 = !DILocation(line: 196, column: 17, scope: !78)
!292 = !DILocation(line: 196, column: 39, scope: !78)
!293 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ray", arg: 1, scope: !34, file: !35, line: 56, type: !38)
!294 = !DILocation(line: 56, column: 32, scope: !34, inlinedAt: !295)
!295 = distinct !DILocation(line: 196, column: 17, scope: !78)
!296 = !DILocation(line: 58, column: 6, scope: !297, inlinedAt: !295)
!297 = distinct !DILexicalBlock(scope: !34, file: !35, line: 58, column: 6)
!298 = !DILocation(line: 58, column: 31, scope: !297, inlinedAt: !295)
!299 = !DILocation(line: 58, column: 6, scope: !34, inlinedAt: !295)
!300 = !DILocation(line: 60, column: 3, scope: !301, inlinedAt: !295)
!301 = distinct !DILexicalBlock(scope: !297, file: !35, line: 59, column: 2)
!302 = !DILocation(line: 64, column: 23, scope: !34, inlinedAt: !295)
!303 = !DILocation(line: 64, column: 10, scope: !34, inlinedAt: !295)
!304 = !DILocation(line: 64, column: 17, scope: !34, inlinedAt: !295)
!305 = !DILocation(line: 65, column: 26, scope: !34, inlinedAt: !295)
!306 = !DILocation(line: 65, column: 10, scope: !34, inlinedAt: !295)
!307 = !DILocation(line: 65, column: 20, scope: !34, inlinedAt: !295)
!308 = !DILocation(line: 67, column: 10, scope: !34, inlinedAt: !295)
!309 = !DILocation(line: 67, column: 15, scope: !34, inlinedAt: !295)
!310 = !DILocation(line: 68, column: 10, scope: !34, inlinedAt: !295)
!311 = !DILocation(line: 68, column: 15, scope: !34, inlinedAt: !295)
!312 = !DILocation(line: 70, column: 44, scope: !34, inlinedAt: !295)
!313 = !DILocation(line: 70, column: 63, scope: !34, inlinedAt: !295)
!314 = !DILocation(line: 70, column: 88, scope: !34, inlinedAt: !295)
!315 = !DILocation(line: 72, column: 2, scope: !34, inlinedAt: !295)
!316 = !DILocation(line: 74, column: 20, scope: !34, inlinedAt: !295)
!317 = !DILocation(line: 74, column: 2, scope: !34, inlinedAt: !295)
!318 = !DILocation(line: 75, column: 1, scope: !34, inlinedAt: !295)
!319 = !DILocation(line: 198, column: 43, scope: !78)
!320 = !DILocation(line: 198, column: 17, scope: !78)
!321 = !DILocation(line: 198, column: 2, scope: !78)
!322 = !DILocation(line: 198, column: 41, scope: !78)
!323 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "projInverted", arg: 4, scope: !108, file: !35, line: 34, type: !118)
!324 = !DILocation(line: 34, column: 107, scope: !108, inlinedAt: !260)
!325 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "viewInverted", arg: 3, scope: !108, file: !35, line: 34, type: !118)
!326 = !DILocation(line: 34, column: 81, scope: !108, inlinedAt: !260)
!327 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cameraPosition", arg: 2, scope: !108, file: !35, line: 34, type: !26)
!328 = !DILocation(line: 34, column: 53, scope: !108, inlinedAt: !260)
!329 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 1, scope: !108, file: !35, line: 34, type: !111)
!330 = !DILocation(line: 34, column: 36, scope: !108, inlinedAt: !260)
!331 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xy", scope: !108, file: !35, line: 36, type: !332)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 36, baseType: !333)
!333 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 36, size: 64, align: 32, elements: !334, templateParams: !337)
!334 = !{!335, !336}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !333, file: !1, line: 36, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !333, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!337 = !{!13, !117}
!338 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "screenPos", scope: !108, file: !35, line: 37, type: !332)
!339 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "target", scope: !108, file: !35, line: 50, type: !4)
!340 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currentRayRecursionDepth", arg: 2, scope: !34, file: !35, line: 56, type: !42)
!341 = !DILocation(line: 56, column: 45, scope: !34, inlinedAt: !295)
!342 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayDesc", scope: !34, file: !35, line: 63, type: !343)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 63, size: 256, align: 32, elements: !344)
!344 = !{!345, !346, !347, !348}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !343, file: !1, line: 63, baseType: !27, size: 96, align: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !343, file: !1, line: 63, baseType: !8, size: 32, align: 32, offset: 96)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !343, file: !1, line: 63, baseType: !27, size: 96, align: 32, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !343, file: !1, line: 63, baseType: !8, size: 32, align: 32, offset: 224)
!349 = !DILocation(line: 63, column: 10, scope: !34, inlinedAt: !295)
!350 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayPayload", scope: !34, file: !35, line: 70, type: !85)
!351 = !DIExpression(DW_OP_bit_piece, 0, 128)
!352 = !DILocation(line: 70, column: 31, scope: !34, inlinedAt: !295)
!353 = !DIExpression(DW_OP_bit_piece, 128, 32)
!354 = !DILocation(line: 199, column: 1, scope: !78)
!355 = !DILocation(line: 202, column: 107, scope: !81)
!356 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !81, file: !35, line: 202, type: !93)
!357 = !DIExpression(DW_OP_deref)
!358 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rayPayload", arg: 1, scope: !81, file: !35, line: 202, type: !84)
!359 = !DILocation(line: 202, column: 54, scope: !81)
!360 = !DILocation(line: 204, column: 38, scope: !81)
!361 = !DILocation(line: 204, column: 45, scope: !81)
!362 = !DILocation(line: 204, column: 50, scope: !81)
!363 = !DILocation(line: 204, column: 28, scope: !81)
!364 = !DILocation(line: 204, column: 19, scope: !81)
!365 = !DILocation(line: 205, column: 1, scope: !81)
!366 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !97, file: !35, line: 210, type: !38)
!367 = !DILocation(line: 210, column: 6, scope: !97)
!368 = !DILocation(line: 212, column: 15, scope: !97)
!369 = !DILocation(line: 212, column: 13, scope: !97)
!370 = !DILocation(line: 213, column: 18, scope: !97)
!371 = !DILocation(line: 213, column: 16, scope: !97)
!372 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volumeAABB", scope: !97, file: !35, line: 216, type: !47)
!373 = !DIExpression(DW_OP_bit_piece, 0, 64)
!374 = !DILocation(line: 216, column: 9, scope: !97)
!375 = !DIExpression(DW_OP_bit_piece, 64, 64)
!376 = !DIExpression(DW_OP_bit_piece, 128, 64)
!377 = !DILocation(line: 216, column: 25, scope: !97)
!378 = !DILocation(line: 216, column: 44, scope: !97)
!379 = !DILocation(line: 216, column: 33, scope: !97)
!380 = !DILocation(line: 216, column: 69, scope: !97)
!381 = !DILocation(line: 216, column: 58, scope: !97)
!382 = !DILocation(line: 216, column: 94, scope: !97)
!383 = !DILocation(line: 216, column: 83, scope: !97)
!384 = !DILocation(line: 216, column: 126, scope: !97)
!385 = !DILocation(line: 216, column: 150, scope: !97)
!386 = !DILocation(line: 216, column: 174, scope: !97)
!387 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tEnter", scope: !97, file: !35, line: 217, type: !8)
!388 = !DILocation(line: 217, column: 8, scope: !97)
!389 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tExit", scope: !97, file: !35, line: 217, type: !8)
!390 = !DILocation(line: 217, column: 16, scope: !97)
!391 = !DILocation(line: 219, column: 6, scope: !392)
!392 = distinct !DILexicalBlock(scope: !97, file: !35, line: 219, column: 6)
!393 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tExit", arg: 4, scope: !43, file: !35, line: 77, type: !50)
!394 = !DILocation(line: 77, column: 94, scope: !43, inlinedAt: !395)
!395 = distinct !DILocation(line: 219, column: 6, scope: !392)
!396 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tEnter", arg: 3, scope: !43, file: !35, line: 77, type: !50)
!397 = !DILocation(line: 77, column: 76, scope: !43, inlinedAt: !395)
!398 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aabb", arg: 2, scope: !43, file: !35, line: 77, type: !47)
!399 = !DILocation(line: 77, column: 57, scope: !43, inlinedAt: !395)
!400 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ray", arg: 1, scope: !43, file: !35, line: 77, type: !38)
!401 = !DILocation(line: 77, column: 42, scope: !43, inlinedAt: !395)
!402 = !DILocation(line: 80, column: 19, scope: !43, inlinedAt: !395)
!403 = !DILocation(line: 80, column: 29, scope: !43, inlinedAt: !395)
!404 = !DILocation(line: 80, column: 15, scope: !43, inlinedAt: !395)
!405 = !DILocation(line: 80, column: 7, scope: !43, inlinedAt: !395)
