#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: 7b5e8c90e2ca91c1b8c4af0997b2ea7c.pdb
; shader hash: 7b5e8c90e2ca91c1b8c4af0997b2ea7c
;
; Buffer Definitions:
;
; cbuffer g_sceneCB
; {
;
;   struct g_sceneCB
;   {
;
;       struct struct.VolumeRaytracer::VSceneConstantBuffer
;       {
;
;           column_major float4x4 projectionToWorld;  ; Offset:    0
;           float4 cameraPosition;                    ; Offset:   64
;       
;       } g_sceneCB;                                  ; Offset:    0
;
;   
;   } g_sceneCB;                                      ; Offset:    0 Size:    80
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; g_sceneCB                         cbuffer      NA          NA     CB0            cb0     1
; g_scene                           texture     i32         ras      T0             t0     1
; g_renderTarget                        UAV     f32          2d      U0             u0     1
;
target datalayout = "e-m:e-p:32:32-i1:32-i8:32-i16:32-i32:32-i64:64-f16:32-f32:32-f64:64-n8:16:32:64"
target triple = "dxil-ms-dx"

%struct.RaytracingAccelerationStructure = type { i32 }
%"class.RWTexture2D<vector<float, 4> >" = type { <4 x float> }
%g_sceneCB = type { %"struct.VolumeRaytracer::VSceneConstantBuffer" }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !99)
!1 = !DIFile(filename: "./DX/Resources/Shaders\5C./DX/Resources/Shaders/Raytracing.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17, !35, !38, !54, !55, !58, !66}
!17 = !DISubprogram(name: "TraceRadianceRay", linkageName: "\01?TraceRadianceRay@@YA?AV?$vector@M$03@@URay@@I@Z", scope: !18, file: !18, line: 49, type: !19, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false)
!18 = !DIFile(filename: "./DX/Resources/Shaders/Raytracing.hlsl", directory: "")
!19 = !DISubroutineType(types: !20)
!20 = !{!4, !21, !33}
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray", file: !18, line: 23, size: 192, align: 32, elements: !22)
!22 = !{!23, !32}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !21, file: !18, line: 25, baseType: !24, size: 96, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !26, templateParams: !30)
!26 = !{!27, !28, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!30 = !{!13, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !21, file: !18, line: 26, baseType: !24, size: 96, align: 32, offset: 96)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !34)
!34 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!35 = !DISubprogram(name: "VRRaygen", linkageName: "\01?VRRaygen@@YAXXZ", scope: !18, file: !18, line: 71, type: !36, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?VRRaygen@@YAXXZ")
!36 = !DISubroutineType(types: !37)
!37 = !{null}
!38 = !DISubprogram(name: "VRClosestHit", linkageName: "\01?VRClosestHit@@YAXUVRayPayload@VolumeRaytracer@@UVPrimitiveAttributes@2@@Z", scope: !18, file: !18, line: 86, type: !39, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false, function: void (%"struct.VolumeRaytracer::VRayPayload"*, %"struct.VolumeRaytracer::VPrimitiveAttributes"*)* @"\01?VRClosestHit@@YAXUVRayPayload@VolumeRaytracer@@UVPrimitiveAttributes@2@@Z")
!39 = !DISubroutineType(types: !40)
!40 = !{null, !41, !50}
!41 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !42)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "VRayPayload", scope: !44, file: !43, line: 38, size: 160, align: 32, elements: !45)
!43 = !DIFile(filename: "./DX/Resources/Shaders/RaytracingHlsl.h", directory: "")
!44 = !DINamespace(name: "VolumeRaytracer", scope: null, file: !43, line: 31)
!45 = !{!46, !48}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !42, file: !43, line: 40, baseType: !47, size: 128, align: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !43, line: 20, baseType: !4)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !42, file: !43, line: 41, baseType: !49, size: 32, align: 32, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !43, line: 23, baseType: !33)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "VPrimitiveAttributes", scope: !44, file: !43, line: 33, size: 96, align: 32, elements: !51)
!51 = !{!52}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !50, file: !43, line: 35, baseType: !53, size: 96, align: 32)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !43, line: 19, baseType: !24)
!54 = !DISubprogram(name: "VRIntersection", linkageName: "\01?VRIntersection@@YAXXZ", scope: !18, file: !18, line: 92, type: !36, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?VRIntersection@@YAXXZ")
!55 = !DISubprogram(name: "VRMiss", linkageName: "\01?VRMiss@@YAXUVRayPayload@VolumeRaytracer@@@Z", scope: !18, file: !18, line: 98, type: !56, isLocal: false, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: false, function: void (%"struct.VolumeRaytracer::VRayPayload"*)* @"\01?VRMiss@@YAXUVRayPayload@VolumeRaytracer@@@Z")
!56 = !DISubroutineType(types: !57)
!57 = !{null, !41}
!58 = !DISubprogram(name: "VRMissShadowRay", linkageName: "\01?VRMissShadowRay@@YAXUVShadowRayPayload@VolumeRaytracer@@@Z", scope: !18, file: !18, line: 105, type: !59, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false, function: void (%"struct.VolumeRaytracer::VShadowRayPayload"*)* @"\01?VRMissShadowRay@@YAXUVShadowRayPayload@VolumeRaytracer@@@Z")
!59 = !DISubroutineType(types: !60)
!60 = !{null, !61}
!61 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !62)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "VShadowRayPayload", scope: !44, file: !43, line: 44, size: 32, align: 32, elements: !63)
!63 = !{!64}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !62, file: !43, line: 46, baseType: !65, size: 32, align: 32)
!65 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!66 = !DISubprogram(name: "GenerateRay", linkageName: "\01?GenerateRay@@YA?AURay@@V?$vector@I$01@@V?$vector@M$02@@V?$matrix@M$03$03@@@Z", scope: !18, file: !18, line: 29, type: !67, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false)
!67 = !DISubroutineType(types: !68)
!68 = !{!21, !69, !24, !77}
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 75, baseType: !70)
!70 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 75, size: 64, align: 32, elements: !71, templateParams: !74)
!71 = !{!72, !73}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !70, file: !1, line: 75, baseType: !34, size: 32, align: 32, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !70, file: !1, line: 75, baseType: !34, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!74 = !{!75, !76}
!75 = !DITemplateTypeParameter(name: "element", type: !34)
!76 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 74, baseType: !78)
!78 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 74, size: 512, align: 32, elements: !79, templateParams: !96)
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !78, file: !1, line: 74, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !78, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !78, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !78, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !78, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !78, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !78, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !78, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !78, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !78, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !78, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !78, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !78, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !78, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !78, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !78, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!96 = !{!13, !97, !98}
!97 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!98 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!99 = !{!100, !102, !104, !106, !110, !112, !114, !116}
!100 = !DIGlobalVariable(name: "RAY_FLAG_CULL_BACK_FACING_TRIANGLES", scope: !0, file: !1, line: 65, type: !101, isLocal: true, isDefinition: true, variable: i32 16)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!102 = !DIGlobalVariable(name: "BackgroundColor", linkageName: "\01?BackgroundColor@VolumeRaytracer@@3V?$vector@M$03@@B", scope: !44, file: !43, line: 55, type: !103, isLocal: true, isDefinition: true)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!104 = !DIGlobalVariable(name: "g_scene", linkageName: "\01?g_scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !18, line: 19, type: !105, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?g_scene@@3URaytracingAccelerationStructure@@A")
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 19, size: 32, align: 32, elements: !2)
!106 = !DIGlobalVariable(name: "g_renderTarget", linkageName: "\01?g_renderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !18, line: 20, type: !107, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?g_renderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!107 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 20, size: 128, align: 32, elements: !2, templateParams: !108)
!108 = !{!109}
!109 = !DITemplateTypeParameter(name: "element", type: !5)
!110 = !DIGlobalVariable(name: "BackgroundColor.0", linkageName: "\01?BackgroundColor@VolumeRaytracer@@3V?$vector@M$03@@B.0", scope: !44, file: !43, line: 55, type: !111, isLocal: false, isDefinition: true)
!111 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !103, size: 32, align: 4)
!112 = !DIGlobalVariable(name: "BackgroundColor.1", linkageName: "\01?BackgroundColor@VolumeRaytracer@@3V?$vector@M$03@@B.1", scope: !44, file: !43, line: 55, type: !113, isLocal: false, isDefinition: true)
!113 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !103, size: 32, align: 4, offset: 32)
!114 = !DIGlobalVariable(name: "BackgroundColor.2", linkageName: "\01?BackgroundColor@VolumeRaytracer@@3V?$vector@M$03@@B.2", scope: !44, file: !43, line: 55, type: !115, isLocal: false, isDefinition: true)
!115 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !103, size: 32, align: 4, offset: 64)
!116 = !DIGlobalVariable(name: "BackgroundColor.3", linkageName: "\01?BackgroundColor@VolumeRaytracer@@3V?$vector@M$03@@B.3", scope: !44, file: !43, line: 55, type: !117, isLocal: false, isDefinition: true)
!117 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !103, size: 32, align: 4, offset: 96)
!118 = !{i32 2, !"Dwarf Version", i32 4}
!119 = !{i32 2, !"Debug Info Version", i32 3}
!120 = !{!"dxc 1.2"}
!121 = !{!"./DX/Resources/Shaders/Raytracing.hlsl", !"/*\0D\0A\09Copyright (c) 2020 Thomas Sch\C3\B6ngrundner\0D\0A\0D\0A\09Permission is hereby granted, free of charge, to any person obtaining a copy\0D\0A\09of this software and associated documentation files (the \22Software\22), to deal\0D\0A\09in the Software without restriction, including without limitation the rights\0D\0A\09to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\0D\0A\09copies of the Software, and to permit persons to whom the Software is\0D\0A\09furnished to do so, subject to the following conditions:\0D\0A\0D\0A\09The above copyright notice and this permission notice shall be included in all\0D\0A\09copies or substantial portions of the Software.\0D\0A*/\0D\0A\0D\0A#define HLSL\0D\0A\0D\0A#include \22RaytracingHlsl.h\22\0D\0A\0D\0ARaytracingAccelerationStructure g_scene : register(t0, space0);\0D\0ARWTexture2D<float4> g_renderTarget : register(u0);\0D\0AConstantBuffer<VolumeRaytracer::VSceneConstantBuffer> g_sceneCB : register(b0);\0D\0A\0D\0Astruct Ray\0D\0A{\0D\0A\09float3 origin;\0D\0A\09float3 direction;\0D\0A};\0D\0A\0D\0Ainline Ray GenerateRay(uint2 index, in float3 cameraPosition, in float4x4 projectionToWorld)\0D\0A{\0D\0A\09//Calculate screen space coordinates between -1 and 1 so that 0 is in the center of the screen\0D\0A\09uint2 renderTargetSize = DispatchRaysDimensions().xy;\0D\0A\09float2 xy = index + 0.5f;\0D\0A\09float2 screenPos = xy / renderTargetSize * 2.0 - 1.0;\0D\0A\0D\0A\09screenPos.y = -screenPos.y;\0D\0A\0D\0A\09//Convert to world position\0D\0A\09float4 world = mul(float4(screenPos, 0, 1), projectionToWorld);\0D\0A\09world.xyz /= world.w;\0D\0A\0D\0A\09Ray ray;\0D\0A\09ray.origin = cameraPosition;\0D\0A\09ray.direction = normalize(world.xyz - ray.origin);\0D\0A\0D\0A\09return ray;\0D\0A}\0D\0A\0D\0Afloat4 TraceRadianceRay(in Ray ray, in uint currentRayRecursionDepth)\0D\0A{\0D\0A\09if (currentRayRecursionDepth >= MAX_RAY_RECURSION_DEPTH)\0D\0A\09{\0D\0A\09\09return float4(0,0,0,0);\0D\0A\09}\0D\0A\0D\0A\09RayDesc rayDesc;\0D\0A\09rayDesc.Origin = ray.origin;\0D\0A\09rayDesc.Direction = ray.direction;\0D\0A\0D\0A\09rayDesc.TMin = 0;\0D\0A\09rayDesc.TMax = 10000;\0D\0A\0D\0A\09VolumeRaytracer::VRayPayload rayPayload = { float4(0,0,0,0), currentRayRecursionDepth + 1 };\0D\0A\0D\0A\09TraceRay(g_scene, RAY_FLAG_CULL_BACK_FACING_TRIANGLES, 0xff, 0, 2, 0, rayDesc, rayPayload);\0D\0A\0D\0A\09return rayPayload.color;\0D\0A}\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid VRRaygen()\0D\0A{\0D\0A\09float3 cameraPos = g_sceneCB.cameraPosition.xyz;\0D\0A\09float4x4 projectionToWorld = g_sceneCB.projectionToWorld;\0D\0A\09uint2 currentRayIndex = DispatchRaysIndex().xy;\0D\0A\0D\0A\09Ray ray = GenerateRay(currentRayIndex, cameraPos, projectionToWorld);\0D\0A\0D\0A\09uint currentRecursionDepth = 0;\0D\0A\09float4 color = TraceRadianceRay(ray, currentRecursionDepth);\0D\0A\0D\0A\09g_renderTarget[currentRayIndex] = color;\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid VRClosestHit(inout VolumeRaytracer::VRayPayload rayPayload, in VolumeRaytracer::VPrimitiveAttributes attr)\0D\0A{\0D\0A\09\0D\0A}\0D\0A\0D\0A[shader(\22intersection\22)]\0D\0Avoid VRIntersection()\0D\0A{\0D\0A\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid VRMiss(inout VolumeRaytracer::VRayPayload rayPayload)\0D\0A{\0D\0A\09float4 backgroundColor = float4(VolumeRaytracer::BackgroundColor);\0D\0A\09rayPayload.color = backgroundColor;\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid VRMissShadowRay(inout VolumeRaytracer::VShadowRayPayload rayPayload)\0D\0A{\0D\0A\09rayPayload.hit = false;\0D\0A}"}
!122 = !{!"./DX/Resources/Shaders/RaytracingHlsl.h", !"/*\0D\0A\09Copyright (c) 2020 Thomas Sch\C3\B6ngrundner\0D\0A\0D\0A\09Permission is hereby granted, free of charge, to any person obtaining a copy\0D\0A\09of this software and associated documentation files (the \22Software\22), to deal\0D\0A\09in the Software without restriction, including without limitation the rights\0D\0A\09to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\0D\0A\09copies of the Software, and to permit persons to whom the Software is\0D\0A\09furnished to do so, subject to the following conditions:\0D\0A\0D\0A\09The above copyright notice and this permission notice shall be included in all\0D\0A\09copies or substantial portions of the Software.\0D\0A*/\0D\0A\0D\0A#pragma once\0D\0A\0D\0A#ifdef HLSL\0D\0Atypedef float2 XMFLOAT2;\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A#else\0D\0A\09#include <DirectXMath.h>\0D\0A\09using namespace DirectX;\0D\0A#endif\0D\0A\0D\0A#define MAX_RAY_RECURSION_DEPTH 3\0D\0A\0D\0Anamespace VolumeRaytracer\0D\0A{\0D\0A\09struct VPrimitiveAttributes\0D\0A\09{\0D\0A\09\09XMFLOAT3 normal;\0D\0A\09};\0D\0A\0D\0A\09struct VRayPayload\0D\0A\09{\0D\0A\09\09XMFLOAT4 color;\0D\0A\09\09UINT depth;\0D\0A\09};\0D\0A\0D\0A\09struct VShadowRayPayload\0D\0A\09{\0D\0A\09\09bool hit;\0D\0A\09};\0D\0A\0D\0A\09struct VSceneConstantBuffer\0D\0A\09{\0D\0A\09\09XMMATRIX projectionToWorld;\0D\0A\09\09XMVECTOR cameraPosition;\0D\0A\09};\0D\0A\0D\0A\09static const XMFLOAT4 BackgroundColor = XMFLOAT4(0.8f, 0.9f, 1.0f, 1.0f);\0D\0A}"}
!123 = !{!"./DX/Resources/Shaders/Raytracing.hlsl"}
!124 = !{!"-Zi", !"-Od", !"-Fo", !"./DX/Resources/Shaders/Compiled/Raytracing.cso", !"-T", !"lib_6_3"}
!125 = !{i32 1, i32 3}
!126 = !{i32 1, i32 5}
!127 = !{!"lib", i32 6, i32 3}
!128 = !{!129, !132, !135, null}
!129 = !{!130}
!130 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?g_scene@@3URaytracingAccelerationStructure@@A", !"g_scene", i32 0, i32 0, i32 1, i32 16, i32 0, !131}
!131 = !{i32 0, i32 4}
!132 = !{!133}
!133 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?g_renderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"g_renderTarget", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !134}
!134 = !{i32 0, i32 9}
!135 = !{!136}
!136 = !{i32 0, %g_sceneCB* @g_sceneCB, !"g_sceneCB", i32 0, i32 0, i32 1, i32 80, null}
!137 = !{i32 0, %struct.RaytracingAccelerationStructure undef, !138, %"class.RWTexture2D<vector<float, 4> >" undef, !140, %"struct.VolumeRaytracer::VSceneConstantBuffer" undef, !142, %struct.Ray undef, !146, %struct.RayDesc undef, !149, %"struct.VolumeRaytracer::VRayPayload" undef, !154, %"struct.VolumeRaytracer::VPrimitiveAttributes" undef, !157, %"struct.VolumeRaytracer::VShadowRayPayload" undef, !159, %g_sceneCB undef, !161}
!138 = !{i32 4, !139}
!139 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!140 = !{i32 16, !141}
!141 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!142 = !{i32 80, !143, !145}
!143 = !{i32 6, !"projectionToWorld", i32 2, !144, i32 3, i32 0, i32 7, i32 9}
!144 = !{i32 4, i32 4, i32 2}
!145 = !{i32 6, !"cameraPosition", i32 3, i32 64, i32 7, i32 9}
!146 = !{i32 28, !147, !148}
!147 = !{i32 6, !"origin", i32 3, i32 0, i32 7, i32 9}
!148 = !{i32 6, !"direction", i32 3, i32 16, i32 7, i32 9}
!149 = !{i32 32, !150, !151, !152, !153}
!150 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!151 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!152 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!153 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!154 = !{i32 20, !155, !156}
!155 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!156 = !{i32 6, !"depth", i32 3, i32 16, i32 7, i32 5}
!157 = !{i32 12, !158}
!158 = !{i32 6, !"normal", i32 3, i32 0, i32 7, i32 9}
!159 = !{i32 4, !160}
!160 = !{i32 6, !"hit", i32 3, i32 0, i32 7, i32 1}
!161 = !{i32 80, !162}
!162 = !{i32 6, !"g_sceneCB", i32 3, i32 0}
!163 = !{i32 1, void ()* @"\01?VRRaygen@@YAXXZ", !164, void (%"struct.VolumeRaytracer::VRayPayload"*, %"struct.VolumeRaytracer::VPrimitiveAttributes"*)* @"\01?VRClosestHit@@YAXUVRayPayload@VolumeRaytracer@@UVPrimitiveAttributes@2@@Z", !166, void ()* @"\01?VRIntersection@@YAXXZ", !164, void (%"struct.VolumeRaytracer::VRayPayload"*)* @"\01?VRMiss@@YAXUVRayPayload@VolumeRaytracer@@@Z", !169, void (%"struct.VolumeRaytracer::VShadowRayPayload"*)* @"\01?VRMissShadowRay@@YAXUVShadowRayPayload@VolumeRaytracer@@@Z", !169}
!164 = !{!165}
!165 = !{i32 1, !2, !2}
!166 = !{!165, !167, !168}
!167 = !{i32 2, !2, !2}
!168 = !{i32 0, !2, !2}
!169 = !{!165, !167}
!170 = !{null, !"", null, !128, !171}
!171 = !{i32 0, i64 65537}
!172 = !{void (%"struct.VolumeRaytracer::VRayPayload"*, %"struct.VolumeRaytracer::VPrimitiveAttributes"*)* @"\01?VRClosestHit@@YAXUVRayPayload@VolumeRaytracer@@UVPrimitiveAttributes@2@@Z", !"\01?VRClosestHit@@YAXUVRayPayload@VolumeRaytracer@@UVPrimitiveAttributes@2@@Z", null, null, !173}
!173 = !{i32 8, i32 10, i32 6, i32 20, i32 7, i32 12, i32 5, !174}
!174 = !{i32 0}
!175 = !{void ()* @"\01?VRIntersection@@YAXXZ", !"\01?VRIntersection@@YAXXZ", null, null, !176}
!176 = !{i32 8, i32 8, i32 5, !174}
!177 = !{void (%"struct.VolumeRaytracer::VRayPayload"*)* @"\01?VRMiss@@YAXUVRayPayload@VolumeRaytracer@@@Z", !"\01?VRMiss@@YAXUVRayPayload@VolumeRaytracer@@@Z", null, null, !178}
!178 = !{i32 8, i32 11, i32 6, i32 20, i32 5, !174}
!179 = !{void (%"struct.VolumeRaytracer::VShadowRayPayload"*)* @"\01?VRMissShadowRay@@YAXUVShadowRayPayload@VolumeRaytracer@@@Z", !"\01?VRMissShadowRay@@YAXUVShadowRayPayload@VolumeRaytracer@@@Z", null, null, !180}
!180 = !{i32 8, i32 11, i32 6, i32 4, i32 5, !174}
!181 = !{void ()* @"\01?VRRaygen@@YAXXZ", !"\01?VRRaygen@@YAXXZ", null, null, !182}
!182 = !{i32 8, i32 7, i32 5, !174}
!183 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cameraPos", scope: !35, file: !18, line: 73, type: !24)
!184 = !DIExpression()
!185 = !DILocation(line: 73, column: 9, scope: !35)
!186 = !DILocation(line: 73, column: 21, scope: !35)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "projectionToWorld", scope: !35, file: !18, line: 74, type: !77)
!188 = !DILocation(line: 74, column: 11, scope: !35)
!189 = !DILocation(line: 74, column: 41, scope: !35)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currentRayIndex", scope: !35, file: !18, line: 75, type: !69)
!191 = !DILocation(line: 75, column: 8, scope: !35)
!192 = !DILocation(line: 75, column: 26, scope: !35)
!193 = !DILocation(line: 77, column: 52, scope: !35)
!194 = !DILocation(line: 77, column: 41, scope: !35)
!195 = !DILocation(line: 77, column: 24, scope: !35)
!196 = !DILocation(line: 77, column: 12, scope: !35)
!197 = !DILocation(line: 32, column: 27, scope: !66, inlinedAt: !198)
!198 = distinct !DILocation(line: 77, column: 12, scope: !35)
!199 = !DILocation(line: 32, column: 8, scope: !66, inlinedAt: !198)
!200 = !DILocation(line: 33, column: 14, scope: !66, inlinedAt: !198)
!201 = !DILocation(line: 33, column: 20, scope: !66, inlinedAt: !198)
!202 = !DILocation(line: 33, column: 9, scope: !66, inlinedAt: !198)
!203 = !DILocation(line: 34, column: 21, scope: !66, inlinedAt: !198)
!204 = !DILocation(line: 34, column: 26, scope: !66, inlinedAt: !198)
!205 = !DILocation(line: 34, column: 24, scope: !66, inlinedAt: !198)
!206 = !DILocation(line: 34, column: 43, scope: !66, inlinedAt: !198)
!207 = !DILocation(line: 34, column: 49, scope: !66, inlinedAt: !198)
!208 = !DILocation(line: 34, column: 9, scope: !66, inlinedAt: !198)
!209 = !DILocation(line: 36, column: 17, scope: !66, inlinedAt: !198)
!210 = !DILocation(line: 36, column: 16, scope: !66, inlinedAt: !198)
!211 = !DILocation(line: 36, column: 14, scope: !66, inlinedAt: !198)
!212 = !{!213}
!213 = distinct !{!213, !214, !"\01?GenerateRay@@YA?AURay@@V?$vector@I$01@@V?$vector@M$02@@V?$matrix@M$03$03@@@Z: %agg.result"}
!214 = distinct !{!214, !"\01?GenerateRay@@YA?AURay@@V?$vector@I$01@@V?$vector@M$02@@V?$matrix@M$03$03@@@Z"}
!215 = !DILocation(line: 39, column: 46, scope: !66, inlinedAt: !198)
!216 = !DILocation(line: 39, column: 28, scope: !66, inlinedAt: !198)
!217 = !DILocation(line: 39, column: 17, scope: !66, inlinedAt: !198)
!218 = !DILocation(line: 39, column: 9, scope: !66, inlinedAt: !198)
!219 = !DILocation(line: 40, column: 15, scope: !66, inlinedAt: !198)
!220 = !DILocation(line: 40, column: 12, scope: !66, inlinedAt: !198)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !66, file: !18, line: 42, type: !21)
!222 = !DIExpression(DW_OP_bit_piece, 0, 96)
!223 = !DILocation(line: 42, column: 6, scope: !66, inlinedAt: !198)
!224 = !DIExpression(DW_OP_bit_piece, 96, 96)
!225 = !DILocation(line: 43, column: 15, scope: !66, inlinedAt: !198)
!226 = !DILocation(line: 43, column: 13, scope: !66, inlinedAt: !198)
!227 = !DILocation(line: 44, column: 28, scope: !66, inlinedAt: !198)
!228 = !DILocation(line: 44, column: 44, scope: !66, inlinedAt: !198)
!229 = !DILocation(line: 44, column: 38, scope: !66, inlinedAt: !198)
!230 = !DILocation(line: 44, column: 18, scope: !66, inlinedAt: !198)
!231 = !DILocation(line: 44, column: 16, scope: !66, inlinedAt: !198)
!232 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currentRecursionDepth", scope: !35, file: !18, line: 79, type: !33)
!233 = !DILocation(line: 79, column: 7, scope: !35)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "color", scope: !35, file: !18, line: 80, type: !4)
!235 = !DILocation(line: 80, column: 9, scope: !35)
!236 = !DILocation(line: 80, column: 17, scope: !35)
!237 = !DILocation(line: 80, column: 39, scope: !35)
!238 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ray", arg: 1, scope: !17, file: !18, line: 49, type: !21)
!239 = !DILocation(line: 49, column: 32, scope: !17, inlinedAt: !240)
!240 = distinct !DILocation(line: 80, column: 17, scope: !35)
!241 = !DILocation(line: 51, column: 6, scope: !242, inlinedAt: !240)
!242 = distinct !DILexicalBlock(scope: !17, file: !18, line: 51, column: 6)
!243 = !DILocation(line: 51, column: 31, scope: !242, inlinedAt: !240)
!244 = !DILocation(line: 51, column: 6, scope: !17, inlinedAt: !240)
!245 = !DILocation(line: 53, column: 3, scope: !246, inlinedAt: !240)
!246 = distinct !DILexicalBlock(scope: !242, file: !18, line: 52, column: 2)
!247 = !DILocation(line: 57, column: 23, scope: !17, inlinedAt: !240)
!248 = !DILocation(line: 57, column: 10, scope: !17, inlinedAt: !240)
!249 = !DILocation(line: 57, column: 17, scope: !17, inlinedAt: !240)
!250 = !DILocation(line: 58, column: 26, scope: !17, inlinedAt: !240)
!251 = !DILocation(line: 58, column: 10, scope: !17, inlinedAt: !240)
!252 = !DILocation(line: 58, column: 20, scope: !17, inlinedAt: !240)
!253 = !DILocation(line: 60, column: 10, scope: !17, inlinedAt: !240)
!254 = !DILocation(line: 60, column: 15, scope: !17, inlinedAt: !240)
!255 = !DILocation(line: 61, column: 10, scope: !17, inlinedAt: !240)
!256 = !DILocation(line: 61, column: 15, scope: !17, inlinedAt: !240)
!257 = !DILocation(line: 63, column: 44, scope: !17, inlinedAt: !240)
!258 = !DILocation(line: 63, column: 63, scope: !17, inlinedAt: !240)
!259 = !DILocation(line: 63, column: 88, scope: !17, inlinedAt: !240)
!260 = !DILocation(line: 65, column: 2, scope: !17, inlinedAt: !240)
!261 = !DILocation(line: 67, column: 20, scope: !17, inlinedAt: !240)
!262 = !DILocation(line: 67, column: 2, scope: !17, inlinedAt: !240)
!263 = !DILocation(line: 68, column: 1, scope: !17, inlinedAt: !240)
!264 = !DILocation(line: 82, column: 36, scope: !35)
!265 = !DILocation(line: 82, column: 17, scope: !35)
!266 = !DILocation(line: 82, column: 2, scope: !35)
!267 = !DILocation(line: 82, column: 34, scope: !35)
!268 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "projectionToWorld", arg: 3, scope: !66, file: !18, line: 29, type: !77)
!269 = !DILocation(line: 29, column: 75, scope: !66, inlinedAt: !198)
!270 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cameraPosition", arg: 2, scope: !66, file: !18, line: 29, type: !24)
!271 = !DILocation(line: 29, column: 47, scope: !66, inlinedAt: !198)
!272 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 1, scope: !66, file: !18, line: 29, type: !69)
!273 = !DILocation(line: 29, column: 30, scope: !66, inlinedAt: !198)
!274 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "renderTargetSize", scope: !66, file: !18, line: 32, type: !69)
!275 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xy", scope: !66, file: !18, line: 33, type: !276)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 33, baseType: !277)
!277 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 33, size: 64, align: 32, elements: !278, templateParams: !281)
!278 = !{!279, !280}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !277, file: !1, line: 33, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !277, file: !1, line: 33, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!281 = !{!13, !76}
!282 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "screenPos", scope: !66, file: !18, line: 34, type: !276)
!283 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "world", scope: !66, file: !18, line: 39, type: !4)
!284 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currentRayRecursionDepth", arg: 2, scope: !17, file: !18, line: 49, type: !33)
!285 = !DILocation(line: 49, column: 45, scope: !17, inlinedAt: !240)
!286 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayDesc", scope: !17, file: !18, line: 56, type: !287)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 56, size: 256, align: 32, elements: !288)
!288 = !{!289, !290, !291, !292}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !287, file: !1, line: 56, baseType: !25, size: 96, align: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !287, file: !1, line: 56, baseType: !8, size: 32, align: 32, offset: 96)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !287, file: !1, line: 56, baseType: !25, size: 96, align: 32, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !287, file: !1, line: 56, baseType: !8, size: 32, align: 32, offset: 224)
!293 = !DILocation(line: 56, column: 10, scope: !17, inlinedAt: !240)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayPayload", scope: !17, file: !18, line: 63, type: !42)
!295 = !DIExpression(DW_OP_bit_piece, 0, 128)
!296 = !DILocation(line: 63, column: 31, scope: !17, inlinedAt: !240)
!297 = !DIExpression(DW_OP_bit_piece, 128, 32)
!298 = !DILocation(line: 83, column: 1, scope: !35)
!299 = !DILocation(line: 86, column: 107, scope: !38)
!300 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !38, file: !18, line: 86, type: !50)
!301 = !DIExpression(DW_OP_deref)
!302 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rayPayload", arg: 1, scope: !38, file: !18, line: 86, type: !41)
!303 = !DILocation(line: 86, column: 54, scope: !38)
!304 = !DILocation(line: 89, column: 1, scope: !38)
!305 = !DILocation(line: 95, column: 1, scope: !54)
!306 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rayPayload", arg: 1, scope: !55, file: !18, line: 98, type: !41)
!307 = !DILocation(line: 98, column: 48, scope: !55)
!308 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "backgroundColor", scope: !55, file: !18, line: 100, type: !4)
!309 = !DILocation(line: 100, column: 9, scope: !55)
!310 = !DILocation(line: 100, column: 34, scope: !55)
!311 = !DILocation(line: 101, column: 21, scope: !55)
!312 = !DILocation(line: 101, column: 19, scope: !55)
!313 = !DILocation(line: 102, column: 1, scope: !55)
!314 = !DILocation(line: 105, column: 63, scope: !58)
!315 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rayPayload", arg: 1, scope: !58, file: !18, line: 105, type: !61)
!316 = !DILocation(line: 107, column: 13, scope: !58)
!317 = !DILocation(line: 107, column: 17, scope: !58)
!318 = !DILocation(line: 108, column: 1, scope: !58)

#endif

const unsigned char g_pRaytracing[] = {
  0x44, 0x58, 0x42, 0x43, 0x5d, 0x03, 0xac, 0x7c, 0xaf, 0x6b, 0x71, 0x8f,
  0xc3, 0x20, 0x4f, 0x21, 0xfa, 0x4e, 0x57, 0x58, 0x01, 0x00, 0x00, 0x00,
  0x14, 0x79, 0x00, 0x00, 0x07, 0x00, 0x00, 0x00, 0x3c, 0x00, 0x00, 0x00,
  0x4c, 0x00, 0x00, 0x00, 0x28, 0x03, 0x00, 0x00, 0x9c, 0x4d, 0x00, 0x00,
  0xe8, 0x5b, 0x00, 0x00, 0x1c, 0x5c, 0x00, 0x00, 0x38, 0x5c, 0x00, 0x00,
  0x53, 0x46, 0x49, 0x30, 0x08, 0x00, 0x00, 0x00, 0x04, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x52, 0x44, 0x41, 0x54, 0xd4, 0x02, 0x00, 0x00,
  0x10, 0x00, 0x00, 0x00, 0x04, 0x00, 0x00, 0x00, 0x18, 0x00, 0x00, 0x00,
  0x60, 0x01, 0x00, 0x00, 0xd0, 0x01, 0x00, 0x00, 0xbc, 0x02, 0x00, 0x00,
  0x01, 0x00, 0x00, 0x00, 0x40, 0x01, 0x00, 0x00, 0x00, 0x67, 0x5f, 0x73,
  0x63, 0x65, 0x6e, 0x65, 0x43, 0x42, 0x00, 0x67, 0x5f, 0x73, 0x63, 0x65,
  0x6e, 0x65, 0x00, 0x67, 0x5f, 0x72, 0x65, 0x6e, 0x64, 0x65, 0x72, 0x54,
  0x61, 0x72, 0x67, 0x65, 0x74, 0x00, 0x01, 0x3f, 0x56, 0x52, 0x52, 0x61,
  0x79, 0x67, 0x65, 0x6e, 0x40, 0x40, 0x59, 0x41, 0x58, 0x58, 0x5a, 0x00,
  0x56, 0x52, 0x52, 0x61, 0x79, 0x67, 0x65, 0x6e, 0x00, 0x01, 0x3f, 0x56,
  0x52, 0x43, 0x6c, 0x6f, 0x73, 0x65, 0x73, 0x74, 0x48, 0x69, 0x74, 0x40,
  0x40, 0x59, 0x41, 0x58, 0x55, 0x56, 0x52, 0x61, 0x79, 0x50, 0x61, 0x79,
  0x6c, 0x6f, 0x61, 0x64, 0x40, 0x56, 0x6f, 0x6c, 0x75, 0x6d, 0x65, 0x52,
  0x61, 0x79, 0x74, 0x72, 0x61, 0x63, 0x65, 0x72, 0x40, 0x40, 0x55, 0x56,
  0x50, 0x72, 0x69, 0x6d, 0x69, 0x74, 0x69, 0x76, 0x65, 0x41, 0x74, 0x74,
  0x72, 0x69, 0x62, 0x75, 0x74, 0x65, 0x73, 0x40, 0x32, 0x40, 0x40, 0x5a,
  0x00, 0x56, 0x52, 0x43, 0x6c, 0x6f, 0x73, 0x65, 0x73, 0x74, 0x48, 0x69,
  0x74, 0x00, 0x01, 0x3f, 0x56, 0x52, 0x49, 0x6e, 0x74, 0x65, 0x72, 0x73,
  0x65, 0x63, 0x74, 0x69, 0x6f, 0x6e, 0x40, 0x40, 0x59, 0x41, 0x58, 0x58,
  0x5a, 0x00, 0x56, 0x52, 0x49, 0x6e, 0x74, 0x65, 0x72, 0x73, 0x65, 0x63,
  0x74, 0x69, 0x6f, 0x6e, 0x00, 0x01, 0x3f, 0x56, 0x52, 0x4d, 0x69, 0x73,
  0x73, 0x40, 0x40, 0x59, 0x41, 0x58, 0x55, 0x56, 0x52, 0x61, 0x79, 0x50,
